{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Weekly Notes: 2022-08-28" ],
    "category" : [ "fitness", "tools", "video games" ],
    "url" : [ "https://glyphy.com/2022/weekly-notes-2022-08-28/", "https://glyphy.com/2022/weekly-notes-2022-08-28/" ],
    "published" : [ "2022-08-28T22:00:00-04:00" ],
    "duration" : [ "PT6M-04:00" ],
    "content" : [ {
      "html" : "<p>Let&#x2019;s try this.</p>\n\n\n\n<p>I want to set a clear intention. I&#x2019;ll write these for myself, expecting no one else to read them, knowing full well that someone might. What I want to get out of these:</p>\n\n\n\n<ul><li><strong>Slow down time</strong>. I tend to fall into these routines, especially around middle of summer and winter when the outdoors feels downright hostile. Other times it&#x2019;s when work is particularly stressful. Either way I get caught up in <em>it</em> and time seems to fly by. I don&#x2019;t like that feeling.</li><li><strong>Leave a trace</strong> for myself. I don&#x2019;t have a great memory, and unless an event has been documented either visually (e.g. through photos) or in writing, it fades quickly.</li><li><strong>Clarify</strong>. I definitely write to think. Even if I end deleting or not posting, I&#x2019;m hoping this practice will help sort things out in my head.</li><li><strong>Practice writing</strong>. I don&#x2019;t intend for these posts to be even remotely polished, but I do want to write clearly, in general. This here can serve as a scratchpad to try things.</li><li><strong>Connect</strong> with others. Maybe. I don&#x2019;t know how I feel about this yet, but perhaps these can fit a space between social media, which I quit, and conversations.</li></ul>\n\n\n\n<p>I&#x2019;ve learned that putting pressure on myself never works, so I&#x2019;m treating these as an experiment. I&#x2019;m gonna let myself miss weeks or write very little, change the format, write in short form or poorly, and just generally do a terrible job. I also may decide to take these posts down or quit altogether. This is for me, not <em>the reader</em>.</p>\n\n\n\n<p>I was inspired by Jamie Tanna&#x2019;s <a href=\"https://www.jvt.me/tags/week-notes/\" data-wpel-link=\"external\" rel=\"external noopener\">week notes</a>. I like how he keeps it simple, which I&#x2019;m sure helps to make it a habit. Let&#x2019;s see how it goes for me.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\">\n\n\n\n<h2>&#x1F310; General</h2>\n\n\n\n<p>A bit of a transition period both professionally and personally. Letting go of my past self is both scary and liberating. The fear is always that I&#x2019;ll slip back into old roles and habits.</p>\n\n\n\n<h2>&#x1F503; <strong>Syncthing</strong></h2>\n\n\n\n<p>This one&#x2019;s more from the week prior, but I spent a bit of time setting up <a href=\"https://syncthing.net/\" data-wpel-link=\"external\" rel=\"external noopener\">Syncthing</a> between my laptop, phone, and NAS. I&#x2019;ve discovered it some years back, but couldn&#x2019;t really find a use case for it at the time. Now I have two:</p>\n\n\n\n<ol><li>Some personal docs that I&#x2019;d like to be able to access on the go, but also keep available on my laptop, while holding the source of truth on the NAS. These are things like insurance docs, vaccination records, etc.</li><li>Screenshots that I take either on the laptop or phone. On the former, the Desktop folder is shared, which makes every screenshot automatically sync to the phone. This is convenient when needing to grab some info in a rush out the door. I&#x2019;ve got Google Photos automatically syncing photos from the phone, so the reverse sync case is already covered.</li></ol>\n\n\n\n<p>One thing I&#x2019;m missing is a way to notify me when there&#x2019;re syncing issues, especially on the NAS. I changed some permissions there while doing something else and only realized that this broke syncing hours later when I opened Syncthing&#x2019;s UI. I only did that because I had just installed it, so was curious how it&#x2019;s running, but this isn&#x2019;t something I&#x2019;d want to remember to do regularly.</p>\n\n\n\n<h2>&#x1F3C3;&#x1F3FB;&#x200D;&#x2642;&#xFE0F; Fitness</h2>\n\n\n\n<p>I&#x2019;ve accepted that if I want to retain&#x2014;never mind improve&#x2014;my running level I&#x2019;m going to have to go early in the morning. It sounds pretty obvious when I write it out, but just in the past couple of months alone I&#x2019;ve missed many opportunities to run outdoors because I woke up too late or simply wanted to get my workday started as early as possible, thinking &#x201C;oh, I&#x2019;ll just go later&#x201D;. After 8am the temperatures rise really quickly and stay high late into the night, so practically the optimal window for a run is between 6-8am. It&#x2019;s too dark before 6 and too hot after 8. I need some time after waking up to settle my stomach, which shrinks the window further.</p>\n\n\n\n<p>Now, while I still aim for that sweet spot I will be going when it&#x2019;s &#x201C;too hot&#x201D; and compensate by not pushing as hard or doing shorter distances. I did my longest run yet today (16.5k), starting at 10am. It was slow, and I stopped a few times in a shady spot, but it felt better than just not going altogether. Thankfully, fall is coming, which will allow for more flexibility.</p>\n\n\n\n<h2>&#x1F3AE; Video games at the library</h2>\n\n\n\n<p>Who woulda thunk? I was pleased to discover that my local library allows borrowing (recent!) games for the Switch and PS5 for a week at a time. This is perfect! I&#x2019;ve been wanting to try out several games that I&#x2019;m not certain I&#x2019;ll like, so paying any amount for them, even if used, feels like too much. Current list:</p>\n\n\n\n<ul><li>Monster Hunter: Rise. &#x274E; Only one I played so far. Too much like Breath of the Wild, which I didn&#x2019;t enjoy.</li><li>Spirit of the North</li><li>Super Mario 3D World</li><li>The Legend of Zelda: Skyward Sword</li><li>Death Stranding</li></ul>\n\n\n\n<p>Other than that I bought and played through <em>Signs of the Sojourner</em>. For a game where all you do is talk it stressed me way out. It does a good job driving home the message that people grow apart, and that you can&#x2019;t expect to see eye to eye if you lose touch for a long time. I explored way too far way too early and tried to talk to everyone, which meant that half way through the game I couldn&#x2019;t match any cards with anyone anywhere! That in turn resulted in (probably) the worst possible outcome at the end. While it was frustrating I&#x2019;ll probably give it another shot when I feel in a less rejection-sensitive space.</p>\n\n\n\n<h2>&#x1F4A0; Misc</h2>\n\n\n\n<ul><li>Learning<ul><li>Reading up on Server-Driven UIs. The tech pendulum swings back and forth, but every time the situation is not <em>quite</em> the same as the last. Conditions change gradually until a shift occurs. I&#x2019;m curious how we got here.</li></ul></li><li>Reading<ul><li><a href=\"https://www.otherscribbles.com/#/the-galaxy-and-the-ground-within/\" data-wpel-link=\"external\" rel=\"external noopener\">The galaxy, and the ground within</a>. I would read anything Becky Chambers writes. It&#x2019;s the kind of sci-fi I wish we had in abundance. The starting point is respectful mutuality rather than psychopathic individualism. It shows that you can have an interesting story without domination, ambition, and abuse moving it forward.</li></ul></li><li>Watched<ul><li>First two episodes of The Sandman. Digging it so far.</li></ul></li></ul>",
      "value" : "Let’s try this.\nI want to set a clear intention. I’ll write these for myself, expecting no one else to read them, knowing full well that someone might. What I want to get out of these: Slow down time. I tend to fall into these routines, especially around middle of summer and winter when the outdoors feels downright hostile. Other times it’s when work is particularly stressful. Either way I get caught up in it and time seems to fly by. I don’t like that feeling.Leave a trace for myself. I don’t have a great memory, and unless an event has been documented either visually (e.g. through photos) or in writing, it fades quickly.Clarify. I definitely write to think. Even if I end deleting or not posting, I’m hoping this practice will help sort things out in my head.Practice writing. I don’t intend for these posts to be even remotely polished, but I do want to write clearly, in general. This here can serve as a scratchpad to try things.Connect with others. Maybe. I don’t know how I feel about this yet, but perhaps these can fit a space between social media, which I quit, and conversations.\nI’ve learned that putting pressure on myself never works, so I’m treating these as an experiment. I’m gonna let myself miss weeks or write very little, change the format, write in short form or poorly, and just generally do a terrible job. I also may decide to take these posts down or quit altogether. This is for me, not the reader.\nI was inspired by Jamie Tanna’s week notes. I like how he keeps it simple, which I’m sure helps to make it a habit. Let’s see how it goes for me. 🌐 General\nA bit of a transition period both professionally and personally. Letting go of my past self is both scary and liberating. The fear is always that I’ll slip back into old roles and habits. 🔃 Syncthing\nThis one’s more from the week prior, but I spent a bit of time setting up Syncthing between my laptop, phone, and NAS. I’ve discovered it some years back, but couldn’t really find a use case for it at the time. Now I have two: Some personal docs that I’d like to be able to access on the go, but also keep available on my laptop, while holding the source of truth on the NAS. These are things like insurance docs, vaccination records, etc.Screenshots that I take either on the laptop or phone. On the former, the Desktop folder is shared, which makes every screenshot automatically sync to the phone. This is convenient when needing to grab some info in a rush out the door. I’ve got Google Photos automatically syncing photos from the phone, so the reverse sync case is already covered.\nOne thing I’m missing is a way to notify me when there’re syncing issues, especially on the NAS. I changed some permissions there while doing something else and only realized that this broke syncing hours later when I opened Syncthing’s UI. I only did that because I had just installed it, so was curious how it’s running, but this isn’t something I’d want to remember to do regularly. 🏃🏻‍♂️ Fitness\nI’ve accepted that if I want to retain—never mind improve—my running level I’m going to have to go early in the morning. It sounds pretty obvious when I write it out, but just in the past couple of months alone I’ve missed many opportunities to run outdoors because I woke up too late or simply wanted to get my workday started as early as possible, thinking “oh, I’ll just go later”. After 8am the temperatures rise really quickly and stay high late into the night, so practically the optimal window for a run is between 6-8am. It’s too dark before 6 and too hot after 8. I need some time after waking up to settle my stomach, which shrinks the window further.\nNow, while I still aim for that sweet spot I will be going when it’s “too hot” and compensate by not pushing as hard or doing shorter distances. I did my longest run yet today (16.5k), starting at 10am. It was slow, and I stopped a few times in a shady spot, but it felt better than just not going altogether. Thankfully, fall is coming, which will allow for more flexibility. 🎮 Video games at the library\nWho woulda thunk? I was pleased to discover that my local library allows borrowing (recent!) games for the Switch and PS5 for a week at a time. This is perfect! I’ve been wanting to try out several games that I’m not certain I’ll like, so paying any amount for them, even if used, feels like too much. Current list: Monster Hunter: Rise. ❎ Only one I played so far. Too much like Breath of the Wild, which I didn’t enjoy.Spirit of the NorthSuper Mario 3D WorldThe Legend of Zelda: Skyward SwordDeath Stranding\nOther than that I bought and played through Signs of the Sojourner. For a game where all you do is talk it stressed me way out. It does a good job driving home the message that people grow apart, and that you can’t expect to see eye to eye if you lose touch for a long time. I explored way too far way too early and tried to talk to everyone, which meant that half way through the game I couldn’t match any cards with anyone anywhere! That in turn resulted in (probably) the worst possible outcome at the end. While it was frustrating I’ll probably give it another shot when I feel in a less rejection-sensitive space. 💠 Misc LearningReading up on Server-Driven UIs. The tech pendulum swings back and forth, but every time the situation is not quite the same as the last. Conditions change gradually until a shift occurs. I’m curious how we got here.ReadingThe galaxy, and the ground within. I would read anything Becky Chambers writes. It’s the kind of sci-fi I wish we had in abundance. The starting point is respectful mutuality rather than psychopathic individualism. It shows that you can have an interesting story without domination, ambition, and abuse moving it forward.WatchedFirst two episodes of The Sandman. Digging it so far.",
      "lang" : "en-CA"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Dmitri Vassilenko" ],
        "photo" : [ "https://secure.gravatar.com/avatar/b522b8152cb33df8e23455dcd28911d6?s=40&r=g" ],
        "url" : [ "https://glyphy.com" ],
        "uid" : [ "https://glyphy.com" ]
      },
      "lang" : "en-CA",
      "value" : "Dmitri Vassilenko"
    } ]
  },
  "lang" : "en-CA"
}
