{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Allie R. 🏳️‍⚧️ (@grissallia@aus.social)" ],
    "summary" : [ "A little professional story:\n\nPlease be kind when \"correcting\" co-workers about something you feel they've misunderstood or are just wrong about.\n\nOne of the really weird things in my life is that I seem to encounter -or trigger- edge cases.\n\nFor non-technical folks: an \"edge case\" is a generally rare bug that only occurs under a very particular set of circumstances, usually quite obscure.\n\nSomeone might report a bug that no-one can reproduce, and it turns out that the bug only occurs on the last Friday of the month, if the device is used between 9pm and 10pm. We refer to something like that as an \"edge case\".\n\nA few years ago I found a *really* weird bug in one of our products, and I mentioned it to one of our senior developers.\n\nThat person then proceeded to loudly, and in front of an entire group of co-workers, lambast me for something that was OBVIOUSLY end-user error, and was \"fundamentally impossible\" to be anything else.\n\nIt was one of the most humiliating professional experiences of my life.\n\nIt made me incredibly wary of raising Jira tickets, unless I could fully reproduce and document a bug.\n\nA couple of years after this incident, I was chatting with another dev who'd started working with our company, and was in QA, and he mentioned this edge case he'd recently encountered. \n\nIf condition A, and condition B, and condition C, AND condition D were all met, it would trigger this really weird bug.\n\n...the same one I'd mentioned to one of our senior devs a couple of years earlier. It wasn't end-user error. It was an edge case.\n\n[sigh]\n\nYesterday during our weekly technical meeting, I asked a question as to whether an underlying software process had been significantly & quietly changed recently.\n\nI explained that I'd encountered a number of weird incidents over the past couple of months, but nothing I could log or document, just that I had a gut feel that there's a intermittent bug in play, and that after my 15-hour day on Wednesday, I was now almost certain that changes might have occurred in that particular process.\n\nTurns out that entire process had been rewritten.\n\nI was asked why I hadn't raised any Jira tickets for it.\n\nOur dev team could have had a couple of months headstart on this issue, and documented occurrences of it, if a deeply frustrated and under-pressure dev hadn't publicly ripped me a new arsehole five years ago.\n\nEverything is copacetic. No-one is upset with me, the dev who asked me why I hadn't raised the ticket was the QA dev, and all I had to say was \"Bug X\", and we both laughed, and the dev team gets more of my \"gut feel\" bug reports moving forward.\n\nThe other dev and I are on excellent terms these days as well. I went to the mat with them three years ago, and they apologised, and we talked out our differences, and we have a great working relationship now.\n\nHow you treat people matters, even in a moment of deep frustration, and can have long-term consequences in ways that you may not expect.\n\nBe kind. Always." ],
    "url" : [ "https://aus.social/@grissallia/110913286131892970" ]
  }
}
