{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "The Tech Talks Daily Podcast: 2290: OpenUK CEO Amanda Brock On The Future For Open Source" ],
    "summary" : [ "As businesses and individuals, we rely increasingly on digital services in our everyday lives. Our lives have become dependent on technology, from cloud services to mobile phones and streaming sites to the apps we use. And behind these technologies lies open source software. Open source software has become a vital part of building digital services. It has made it possible for developers to collaborate and share code, making it faster and more cost-effective to build software. But with this increase in use, the importance of security planning and governance has also grown. Amanda Brock, CEO of OpenUK, is a leading open-source software and governance expert. She has been an advocate for open source software for over a decade and has seen its impact on the industry. Amanda shares where we are with open source and why we must care about how our software gets put together and where it comes from. Amanda discusses the importance of understanding the source of the code and the licenses used. With the rise of open source software, it is essential to be aware of potential legal issues and ensure compliance with licensing requirements. She also highlights the importance of building and maintaining trust with open source communities and contributing back to them. Amanda also emphasizes the role of governance in ensuring the security and reliability of open source software. She points out that open source projects must have a strong governance structure to ensure that contributors are held accountable and that the code is secure. As Amanda notes, open source software has become too important to ignore. We must ensure that we are not only using it but also contributing to it and supporting its continued growth.&nbsp; By understanding where our software comes from and its governance structure, we can ensure the security and reliability of the technologies we rely on daily. As businesses and individuals, we must recognize the importance of open source software and take steps to ensure its continued growth and success. Sponsored VPN Offer  " ],
    "featured" : [ "http://assets.libsyn.com/show/69550?height=250&width=250&overlay=true" ],
    "audio" : [ "https://traffic.libsyn.com/secure/techblogwriter/Open_UK_2023.mp3" ],
    "url" : [ "https://techblogwriter.libsyn.com/open-uk-4k" ]
  }
}
