{
  "type" : [ "h-card" ],
  "properties" : {
    "name" : [ "Matthias Ott" ],
    "url" : [ "https://matthiasott.com/" ]
  },
  "id" : "body",
  "lang" : "en",
  "children" : [ {
    "type" : [ "h-entry" ],
    "properties" : {
      "name" : [ "How I (Usually) Write Blog Posts" ],
      "summary" : [ "" ],
      "url" : [ "https://matthiasott.com/notes/how-i-write-blog-posts" ],
      "uid" : [ "https://matthiasott.com/notes/how-i-write-blog-posts" ],
      "published" : [ "2023-04-07 17:04:34" ],
      "content" : [ {
        "html" : "<script async=\"\" type=\"text/javascript\" src=\"https://cdn.carbonads.com/carbon.js?serve=CEBI65QJ&amp;placement=matthiasottcom\" id=\"_carbonads_js\"></script>\n\t\t\n\t\t<div class=\"b-content__intro p-summary\">\n</div>\n\t\t\n\t    \t    \t\t\t\t    \t\t      \t    \t<p><a href=\"https://front-end.social/@matuzo/110156090066292634\">Manuel shared how he approaches writing</a> and publishing blog posts on his personal site. If you follow him, and especially if his RSS feed is on your list of feeds, you know that Manuel indeed does put out a lot of posts. Just recently, he <a href=\"https://www.matuzo.at/blog/2022/100-days-of-more-or-less-modern-css/\">completed 100 posts about more or less modern CSS</a>, so his process certainly works for him.</p>\n\n<h2>Keeping The Friction Low</h2>\n\n<p>What works for some people might not work for others. So if you struggle to put out blog posts, Manuel’s approach might work well for you or also not work at all. But there are a few things he mentions that are, in my experience, key if you want to publish posts more easily. For example, he does not care about the details too much, particularly early in the process. This <em>keeps the friction low</em> and it keeps you going. It maintains momentum. This includes that he doesn’t care about typos, correct sentence structure, or anything else that people might call “a mistake”. Separating a quick, messy research and drafting phase and a final writing phase also makes writing much easier because you already know what you want to write about.</p>\n\n<h2>The Input Phase</h2>\n\n<p>My usual process is somewhat similar. I also collect all the stuff I can find – links, examples, own thoughts – in a very messy and rough way in iA Writer in a markdown file in my drafts folder. Sometimes I have nothing but a first idea or a post title. Sometimes I’ll write down a few keywords and paste a bunch of links into the document, sometimes I’ll write a few sentences with key points, and sometimes even a few paragraphs. This really depends on the topic and my form of the day. 😉 It helps if this input collection phase is short and, for example, done in just one hour or throughout a day. For some posts, I might also collect ideas and links for several weeks.</p>\n\n<h2>The Shitty First Draft</h2>\n\n<p>I then write most of the <a href=\"https://matthiasott.com/notes/ideas-on-writing-shitty-first-drafts\">shitty first draft</a> of the post, usually in one go, and I also don’t fiddle around with the sentences and grammar yet. There might also be a bit of German in there when I can’t find the right word for something immediately. This first version of your post is not about getting it right. It’s about getting it out. And knowing that you don’t need to get it right at the first try gives you an immense amount of freedom. It permits you to write freely and without pressure. By the way: not putting pressure on yourself also means that if you have a great idea for a sentence or happen to write a paragraph in one go that is just right, you are, of course, allowed to polish it a little right away. The important thing is just to not lose the flow and keep going until the end of the post.</p>\n\n<h2>Editing</h2>\n\n<p>After writing this first draft, I go through the post with my “editor self”, often on the next day with a clear mind and bit of distance. It is amazing how different a post can feel after a good night of sleep. I now try to cut out all the unnecessary stuff. I <a href=\"https://matthiasott.com/notes/thoughts-on-writing-read-it-out-loud\">read the post out loud</a> and imagine that I’m reading it for the very first time. Is everything clear and concise? Do the sentences connect? Could I add a few headings to make the structure of the text more clear? Does the main point come across? Are the code samples fine? It the title good?</p>\n\n<p>What is important in this phase is that you don’t confuse the editor in you with the inner critic. As Rick Rubin writes in his book “<a href=\"https://www.penguinrandomhouse.com/books/717356/the-creative-act-by-rick-rubin/\">The Creative Act</a>”, the inner critic doubts the work and undermines it, while “the editor steps back, views the work holistically, and supports its full potential.”</p>\n\n<h2>Publication</h2>\n\n<p>The last important step is to not overdo it with the fine-tuning of the post. <a href=\"https://chriscoyier.net/2022/06/27/there-is-no-bar/\">As Chris Coyier said</a>, “we’re not shootin’ for the Pulitzer over here”. So, at some point, I ignore the voice in my head that tells me that I could still improve the post further, move the text over to Craft CMS to look at it in preview mode, and, ultimately, hit publish. </p>\n\n<p>How do I know that a post is ready? I have no clue. I think there is a sense of completeness that can be felt, the feeling that while you could hone the details forever, it would not make the post any better. And you also can’t really add or remove something without making the piece worse. That feeling often comes out of a sudden. Just seconds ago, a post might have felt unfinished. You change just one little detail and, suddenly, it’s done.</p>\n\n<p>After publishing it on my site, I <em>always</em> read the post one last time. And almost every time, I will find something that I overlooked. A missing link, a typo, whatever it is – that last check is always worth it.</p>\n\n<h2>What About You?</h2>\n\n<p>What is your process of writing blog posts? I’d love to hear what works for you. Maybe in a blog post in response to this one?</p>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>~</p>\n\t\t<div>\n    \t<form class=\"webmention-form\" method=\"post\" action=\"/webmention\">\n\t<label for=\"webmention-source\">Have you published a response to this? Send me a <a href=\"http://indiewebcamp.com/webmention\">webmention</a> by letting me know the <abbr title=\"Uniform Resource Locator\">URL</abbr>.</label>\n\t<input type=\"url\" name=\"source\" id=\"webmention-source\" placeholder=\"URL / permalink of your article\">\n\t<input type=\"hidden\" name=\"target\" value=\"https://matthiasott.com/notes/how-i-write-blog-posts\">\n\t<button type=\"submit\">Ping!</button>\n</form>\n    </div>",
        "value" : "Manuel shared how he approaches writing and publishing blog posts on his personal site. If you follow him, and especially if his RSS feed is on your list of feeds, you know that Manuel indeed does put out a lot of posts. Just recently, he completed 100 posts about more or less modern CSS, so his process certainly works for him. Keeping The Friction Low\nWhat works for some people might not work for others. So if you struggle to put out blog posts, Manuel’s approach might work well for you or also not work at all. But there are a few things he mentions that are, in my experience, key if you want to publish posts more easily. For example, he does not care about the details too much, particularly early in the process. This keeps the friction low and it keeps you going. It maintains momentum. This includes that he doesn’t care about typos, correct sentence structure, or anything else that people might call “a mistake”. Separating a quick, messy research and drafting phase and a final writing phase also makes writing much easier because you already know what you want to write about. The Input Phase\nMy usual process is somewhat similar. I also collect all the stuff I can find – links, examples, own thoughts – in a very messy and rough way in iA Writer in a markdown file in my drafts folder. Sometimes I have nothing but a first idea or a post title. Sometimes I’ll write down a few keywords and paste a bunch of links into the document, sometimes I’ll write a few sentences with key points, and sometimes even a few paragraphs. This really depends on the topic and my form of the day. 😉 It helps if this input collection phase is short and, for example, done in just one hour or throughout a day. For some posts, I might also collect ideas and links for several weeks. The Shitty First Draft\nI then write most of the shitty first draft of the post, usually in one go, and I also don’t fiddle around with the sentences and grammar yet. There might also be a bit of German in there when I can’t find the right word for something immediately. This first version of your post is not about getting it right. It’s about getting it out. And knowing that you don’t need to get it right at the first try gives you an immense amount of freedom. It permits you to write freely and without pressure. By the way: not putting pressure on yourself also means that if you have a great idea for a sentence or happen to write a paragraph in one go that is just right, you are, of course, allowed to polish it a little right away. The important thing is just to not lose the flow and keep going until the end of the post. Editing\nAfter writing this first draft, I go through the post with my “editor self”, often on the next day with a clear mind and bit of distance. It is amazing how different a post can feel after a good night of sleep. I now try to cut out all the unnecessary stuff. I read the post out loud and imagine that I’m reading it for the very first time. Is everything clear and concise? Do the sentences connect? Could I add a few headings to make the structure of the text more clear? Does the main point come across? Are the code samples fine? It the title good?\nWhat is important in this phase is that you don’t confuse the editor in you with the inner critic. As Rick Rubin writes in his book “The Creative Act”, the inner critic doubts the work and undermines it, while “the editor steps back, views the work holistically, and supports its full potential.” Publication\nThe last important step is to not overdo it with the fine-tuning of the post. As Chris Coyier said, “we’re not shootin’ for the Pulitzer over here”. So, at some point, I ignore the voice in my head that tells me that I could still improve the post further, move the text over to Craft CMS to look at it in preview mode, and, ultimately, hit publish.\nHow do I know that a post is ready? I have no clue. I think there is a sense of completeness that can be felt, the feeling that while you could hone the details forever, it would not make the post any better. And you also can’t really add or remove something without making the piece worse. That feeling often comes out of a sudden. Just seconds ago, a post might have felt unfinished. You change just one little detail and, suddenly, it’s done.\nAfter publishing it on my site, I always read the post one last time. And almost every time, I will find something that I overlooked. A missing link, a typo, whatever it is – that last check is always worth it. What About You?\nWhat is your process of writing blog posts? I’d love to hear what works for you. Maybe in a blog post in response to this one?\n~ Have you published a response to this? Send me a webmention by letting me know the URL. Ping!",
        "lang" : "en"
      } ],
      "author" : [ {
        "type" : [ "h-card" ],
        "properties" : {
          "photo" : [ "https://matthiasott.com/apple-touch-icon-120x120.png" ],
          "name" : [ "Matthias Ott" ]
        },
        "lang" : "en",
        "value" : "Matthias Ott"
      } ]
    },
    "lang" : "en"
  } ]
}
