{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Week 44: Spain" ],
    "category" : [ "weeknotes", "emoji-🇪🇸", "holiday" ],
    "url" : [ "https://barryfrost.com/2022/07/week-44-spain" ],
    "published" : [ "2022-06-26T21:00:10.556Z" ],
    "updated" : [ "2022-07-03T21:00:45.796Z" ],
    "content" : [ {
      "html" : "<ul>\n<li>This last week and a bit we were on holiday in <a href=\"https://barryfrost.com/2022/07/24aawlxnjum\">Majorca</a>, staying at the <a href=\"https://barryfrost.com/2022/06/dlgto54bhfq\">Protur Bonaire</a> in Cala Bona. Because of Covid restrictions, it was to be the boys&#x2019; first time outside the UK, their first flights and also their first time staying abroad.</li>\n<li>And it worked out well: it was an all-inclusive, family-focused package affair for minimum stress. The journey was super-smooth, the boys had a great time at kids&#x2019; club and we got some quality sun-lounger time.</li>\n<li>H loved the buffet: his breakfast was pancakes which chocolate spread and squirty cream, followed by a lunch of burger /and/ hot dog, chips and all the ice creams.</li>\n<li>Our days settled into kids&#x2019; club sessions for the boys, sunbathing, the swimming pools, eating and drinking.</li>\n<li>Evening entertainment was two enthusiastic Dutch girls who alternated between dressing up in a dog costume as &#x201C;Captain T&#x201D;, setting tasks for the kids and doing dances. Their catchy songs remain firmly lodged in my head.</li>\n<li>I didn&#x2019;t post weeknotes while away, in part because it would be clear our home would be empty to a burglar reading my website. Has this ever actually happened? Is it even remotely possible opportunistic thieves subscribe to my weeknotes?</li>\n<li>Anyway, better safe than sorry!</li>\n</ul>",
      "value" : "This last week and a bit we were on holiday in Majorca, staying at the Protur Bonaire in Cala Bona. Because of Covid restrictions, it was to be the boys’ first time outside the UK, their first flights and also their first time staying abroad. And it worked out well: it was an all-inclusive, family-focused package affair for minimum stress. The journey was super-smooth, the boys had a great time at kids’ club and we got some quality sun-lounger time. H loved the buffet: his breakfast was pancakes which chocolate spread and squirty cream, followed by a lunch of burger /and/ hot dog, chips and all the ice creams. Our days settled into kids’ club sessions for the boys, sunbathing, the swimming pools, eating and drinking. Evening entertainment was two enthusiastic Dutch girls who alternated between dressing up in a dog costume as “Captain T”, setting tasks for the kids and doing dances. Their catchy songs remain firmly lodged in my head. I didn’t post weeknotes while away, in part because it would be clear our home would be empty to a burglar reading my website. Has this ever actually happened? Is it even remotely possible opportunistic thieves subscribe to my weeknotes? Anyway, better safe than sorry!",
      "lang" : "en-GB"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Barry Frost" ],
        "photo" : [ "https://barryfrost.com/barryfrost.jpg" ],
        "url" : [ "https://barryfrost.com/" ]
      },
      "lang" : "en-GB",
      "value" : "https://barryfrost.com/"
    } ]
  },
  "lang" : "en-GB"
}
