{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Week 81 - Presentation" ],
    "category" : [ "weeknotes", "emoji-🧑‍💻" ],
    "url" : [ "https://barryfrost.com/2023/03/week-81-presentation" ],
    "published" : [ "2023-03-12T21:06:23.407Z" ],
    "content" : [ {
      "html" : "<ul>\n<li>I don’t want to break the streak of posting weeknotes for the last 80 weeks, but I’m struggling to fill this week’s entry with anything other than job-hunting. I won’t be insulted if you skip this!</li>\n<li>Most of the last week has seen me busy at my laptop preparing a presentation and then presenting it at a panel interview on Friday. I’ll get feedback soon, but I was happy with the end result and hopefully the effort I invested will have been worth it.</li>\n<li>I’m contemplating writing up a retrospective of my interviewing experiences, without including names of course, because I’ve learned quite a bit about the whole process of applying for technology leadership roles. It’s certainly been tough in the current climate of mass tech redundancies.</li>\n<li>I’ve also learned about my own interviewing strengths and weaknesses. I was particularly nervous of system design interviews following a bad experience several years ago, but recently I’ve performed pretty well. I’m now a dab hand at <a href=\"https://excalidraw.com\">Excalidraw</a>!</li>\n<li>Arsenal comfortably beat Fulham 3-0 today, and for the first time, H watched the whole match with me on the sofa. He’s suddenly football-obsessed and decided he wants to be a professional footballer when he grows up. Daddy is now delighted he can download his nerdy footballing knowledge onto a willing recipient.</li>\n</ul>",
      "value" : "I don’t want to break the streak of posting weeknotes for the last 80 weeks, but I’m struggling to fill this week’s entry with anything other than job-hunting. I won’t be insulted if you skip this! Most of the last week has seen me busy at my laptop preparing a presentation and then presenting it at a panel interview on Friday. I’ll get feedback soon, but I was happy with the end result and hopefully the effort I invested will have been worth it. I’m contemplating writing up a retrospective of my interviewing experiences, without including names of course, because I’ve learned quite a bit about the whole process of applying for technology leadership roles. It’s certainly been tough in the current climate of mass tech redundancies. I’ve also learned about my own interviewing strengths and weaknesses. I was particularly nervous of system design interviews following a bad experience several years ago, but recently I’ve performed pretty well. I’m now a dab hand at Excalidraw! Arsenal comfortably beat Fulham 3-0 today, and for the first time, H watched the whole match with me on the sofa. He’s suddenly football-obsessed and decided he wants to be a professional footballer when he grows up. Daddy is now delighted he can download his nerdy footballing knowledge onto a willing recipient.",
      "lang" : "en-GB"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Barry Frost" ],
        "photo" : [ {
          "value" : "https://barryfrost.com/barryfrost.jpg",
          "alt" : "Photo of Barry"
        } ],
        "url" : [ "https://barryfrost.com/" ]
      },
      "lang" : "en-GB",
      "value" : "https://barryfrost.com/"
    } ]
  },
  "lang" : "en-GB"
}
