{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Week 79 - Burglars" ],
    "category" : [ "weeknotes", "emoji-🦹‍♂️" ],
    "url" : [ "https://barryfrost.com/2023/02/week-79-burglars" ],
    "syndication" : [ "https://mastodon.social/@barryf/109932830124827509", "https://twitter.com/barryf/status/1629936204899557376" ],
    "published" : [ "2023-02-26T20:04:03.041Z" ],
    "updated" : [ "2023-02-26T20:07:28.287Z" ],
    "content" : [ {
      "html" : "<ul>\n<li>We had a break-in this week. Thankfully it was only our side gate that was damaged before we disturbed them and they ran off. The burglars probably hoped to quietly gain entry to our garden, but crowbarring open a bolt lock is noisy and it was only 9:50pm.</li>\n<li>The police response was excellent. We called 101 and had an officer visit 90 minutes later. But there wasn’t much to report: I only saw a silhouette of a person exit our driveway and nothing was left behind. A neighbour in our local WhatsApp group reported seeing people drive away quickly just after.</li>\n<li>In response I followed my instincts. I ordered outside cameras with floodlights and sirens. If someone’s going to try gaining entry again I want a video clip and an alarm button to press! Plus I also installed much beefier gate locks and padlocks.</li>\n<li>The week had otherwise started well. Lunch out with Laura at <a href=\"https://barryfrost.com/2023/02/5dij1rsjnhr\">Postino</a> and some encouraging interviews.</li>\n<li>And then our washing machine broke with the message “E06 PUMP”. We drained the water and found the filter was clear, so something more serious was wrong. Siemens are booked for next week. Meanwhile, no clothes washing.</li>\n<li>Bad news comes in threes? We had new cleaners who managed to lock our cat’s catflap without us realising. Poor Poppy lasted 48 hours before weeing on H’s bed and pooing on his beanbag. Did I mention our washing machine is broken? Beanbag in the bin; duvet, cover, sheet and mattress protector scrubbed in the bath.</li>\n<li>The week ended better. My parents and sister visited with her children. The cousins played well together while my dad and I installed the cameras and locks. And then today I cooked a roast chicken which my two fussy children ate, and one even said they enjoyed.</li>\n</ul>",
      "value" : "We had a break-in this week. Thankfully it was only our side gate that was damaged before we disturbed them and they ran off. The burglars probably hoped to quietly gain entry to our garden, but crowbarring open a bolt lock is noisy and it was only 9:50pm. The police response was excellent. We called 101 and had an officer visit 90 minutes later. But there wasn’t much to report: I only saw a silhouette of a person exit our driveway and nothing was left behind. A neighbour in our local WhatsApp group reported seeing people drive away quickly just after. In response I followed my instincts. I ordered outside cameras with floodlights and sirens. If someone’s going to try gaining entry again I want a video clip and an alarm button to press! Plus I also installed much beefier gate locks and padlocks. The week had otherwise started well. Lunch out with Laura at Postino and some encouraging interviews. And then our washing machine broke with the message “E06 PUMP”. We drained the water and found the filter was clear, so something more serious was wrong. Siemens are booked for next week. Meanwhile, no clothes washing. Bad news comes in threes? We had new cleaners who managed to lock our cat’s catflap without us realising. Poor Poppy lasted 48 hours before weeing on H’s bed and pooing on his beanbag. Did I mention our washing machine is broken? Beanbag in the bin; duvet, cover, sheet and mattress protector scrubbed in the bath. The week ended better. My parents and sister visited with her children. The cousins played well together while my dad and I installed the cameras and locks. And then today I cooked a roast chicken which my two fussy children ate, and one even said they enjoyed.",
      "lang" : "en-GB"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Barry Frost" ],
        "photo" : [ {
          "value" : "https://barryfrost.com/barryfrost.jpg",
          "alt" : "Photo of Barry"
        } ],
        "url" : [ "https://barryfrost.com/" ]
      },
      "lang" : "en-GB",
      "value" : "https://barryfrost.com/"
    } ]
  },
  "lang" : "en-GB"
}
