{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "The Art of Open Source: A Conversation with Stephen Augustus | Open at Intel" ],
    "summary" : [ "Stephen Augustus, the Head of Open Source at Cisco, shares his experiences and insights about contributing to and maintaining open source projects including Kubernetes and OpenSSF Scorecard. Stephen highlights the importance of building sustainable practices and the value of having product, program, and project management skills in open source projects. Discussions delve into the inner workings of the Kubernetes project, the role and functionality of the OpenSSF Scorecard, and the process of incorporating new contributors and projects. He further emphasizes the importance of transparency and intentionality in corporations' involvement in open source projects.\n00:00 Introduction and Guest Background00:22 Stephen's Journey into Open Source and Kubernetes05:41 The Success Factors of Kubernetes06:09 Maintaining the Maintainers: The Balance of Work in Open Source06:28 The Role of Corporations in Open Source09:03 The Overwhelming Nature of Open Source Contribution10:10 The Impact of Kubernetes on Other Open Source Projects10:59 The Increasing Complexity in Full Stack Development12:29 The Importance of Open Source Project Management20:27 OpenSSF Scorecard \nGuest:\n\nStephen Augustus is a Black engineering director and leader in open source communities.\nHe is the Head of Open Source at Cisco, working within the Strategy, Incubation, &amp; Applications (SIA) organization.\nFor Kubernetes, he has co-founded transformational elements of the project, including the KEP (Kubernetes Enhancements Proposal) process, the Release Engineering subproject, and Working Group Naming. Stephen has also previously served as a chair for both SIG PM and SIG Azure.\nHe continues his work in Kubernetes as a Steering Committee member and a Chair for SIG Release.\nAcross the wider LF (Linux Foundation) ecosystem, Stephen has the pleasure of serving as a member of the OpenSSF Governing Board and the OpenAPI Initiative Business Governing Board.\nPreviously, he was a TODO Group Steering Committee member, a CNCF (Cloud Native Computing Foundation) TAG Contributor Strategy Chair, and one of the Program Chairs for KubeCon / CloudNativeCon, the cloud native community’s flagship conference.\nHe is a maintainer for the Scorecard and Dex projects, and a prolific contributor to CNCF projects, amongst the top 40 (as of writing) code/content committers, all-time.\nIn 2020, Stephen co-founded the Inclusive Naming Initiative, a cross-industry group dedicated to helping projects and companies make consistent, responsible choices to remove harmful language across codebases, standards, and documentation.\nHe has previously held positions at VMware (via Heptio), Red Hat, and CoreOS.\nStephen is based in New York City.\n\n" ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/image-logo/15590967/open_intel_podcast_cover_8f8j2k_1200x628.jpg?s=f1c2c21c86337ba9eaa6c6dc399bed63&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://openatintel.podbean.com/e/the-art-of-open-source-a-conversation-with-stephen-augustus/" ]
  }
}
