{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #19: A spotlight on GOV.UK Notify | Government Digital Service Podcast" ],
    "summary" : [ "We take a deep-dive into GOV.UK Notify and hear from teams at Defra, the Canadian Digital Service and NHS Business Services Authority about how they use it.\nThe transcript for the episode follows:\n-------------\n \nLaura Stevens: \nHello and welcome to the Government Digital Service podcast. My name is Laura Stevens and I’m a Creative Content Producer at GDS. And like last month’s episode, this one will also be recorded via Hangouts as we’re all remote working now. \n \nSo today we’re going to be talking about GOV.UK Notify. This is the government’s messaging tool which allows teams across the public sector to send out text messages, letters and emails to their users - cheaply and easily.\n \nIt sent its first notification in May 2016, and this month GOV.UK Notify reached a milestone and has sent out one billion messages. \n \nNotify gets critical information to people that need it. It’s used by local councils, health organisations, central government departments, fire services and many other public sector bodies. And it’s used for a diverse range of services including flood alerts, blue badge notifications, doctor appointment reminders and informing prison wardens of their rotas, to name a few. \n \nSo to tell me more is Pete Herlihy, so please could you introduce yourself, what you do here at GDS and your role on Notify. \n \nPete Herlihy: \nYes, I can Laura. So yeah, I’m Pete, I work on the Notify Team, I help them out. I’m a Product Manager. I’ve been at GDS since the beginning, I haven’t, I haven’t made parole just yet.\n \nI’ve worked a lot on a number of platforms in GDS, so publishing platform, GOV.UK, register to vote, petitions and more recently, when I say more recently, my, my latest gig is on Notify, which we’ve been doing now for just over 4 years. And we started with literally 2 people and we’re now 11, and yeah my role on that is just to help and support that team to deliver what is GOV.UK Notify.\n \nLaura Stevens\nAnd why was Notify set up 4 years ago?\n \nPete Herlihy: \nWell there’s a story there. So Notify was one of the solutions that came out of something called the ‘Enabling Strategy’, which was a piece of work GDS did. The, the reality behind that piece of work was we needed to figure out as an organisation what we could do to help the rest of government do what they do.\n \nAnd so there was a bunch of stuff going on, we looked at various different kind of common problems across government that we wanted to solve, and, and that was kind of where the whole Government as a Platform programme emerged during that time. And one of the problems we wanted to solve was keeping people informed.\nAnd we, we learned very quickly that we probably didn’t need a status tracking application, but what we needed was a notifications platform. And the reckon was, which we did soon validate very quickly, was that if we could kind of just tell people what we knew as soon as we knew it, we didn’t have to wait for them to get anxious enough to jump on a website and look and you know, sign in and see where the thing was at. So it might have saved, or it would have solved our problems with regards to you know the cost of running contact centres and all that avoidable contact, but it wouldn’t really have helped our citizens or end users as much. And so we, we fairly early on validated that and pivoted from a status tracking application to a notifications application. \n \nLaura Stevens: \nAnd can you talk about some of the service teams that use it, like who uses it and what do they use it for?  \n \nPete Herlihy: \nWell we have now, what’s the number, around 2 and a half thousand service teams now using it, which is a lot. I think - when we started, someone, there was an external consultancy that did a little bit of work for us and they thought there might be 80 services that would use it. And, we were like OK cool, that’s a good number to aim at. But, it’s a completely different profile actually from what we’ve envisaged. \n \nWe thought at the start they’ll be a bunch of really big services using it and that will be like where the bulk comes from and then we kind of quickly learned that there was a really really long tail of smaller service teams that, and many we didn’t recognise as being a service, necessarily when we started who are really going to get the most benefit out of it. So the big teams might save money, and they’ll get a better product but they probably would have done something anyway. Whereas the rest of them just maybe wouldn’t enter the space of digital comms in this way - so they benefit massively from Notify. \n \nSo the types of teams, you list, you ran through a bunch at the start there. So, we do have nearly as many service teams in local government using it, as we do in central government. And an increasing number in the NHS as well. Obviously events of this year have seen massive surges in uptake from all of those sectors. \n \nFor example of things we’re doing a bunch of messaging for the COVID services, all the support and advice the NHS is providing to the extremely vulnerable, that’s all going through Notify. All your test results are going through Notify as well. We’ve got a huge amount of business continuity messaging, so accounts all telling the staff where and when they need to go to do work or changes-changes to opening hours or that sort of thing. \nWe do passport applications, progress updates, flood alerts, global travel alerts, I mean there are, every service is slightly different and that’s kind of the point. So yeah 2 and half thousand of them, 650 organisations I think across the public sector and there’s still a lot more out there who hopefully one day will be using Notify.\n \nLaura Stevens: \nAnd also was reading on GOV.UK, there was a press release put out which said that Notify is on track to save taxpayers an average of £35 million a year over the next 5 years. When you, it started, did you think you’d be making those sort of savings, yeah, to the taxpayer? \n \nPete Herlihy: \nWe were hopeful. We knew that the return on investment for something like Notify was massive because you know, a text message that cost you 1 and a half pence versus a phone call that costs you £5. That doesn’t take many many phone calls to be avoided to make a good case. \n \nAnd, I remember doing a presentation at GDS Sprint 16, Sprint 16, the orange one. It was very orange. And one of the slides on that was 1 in 4 calls to government is someone just asking for an update. It costs a lot of money to run a contact centre and the government deals with literally tens of millions of phone calls a year. So if we can knock out a quarter of those by investing in a small team doing notifications, then there’s going to be some massive savings. \n \nLaura Stevens: \nAnd I thought as well as hearing from you about, from the sort of product point of view, we also wanted to hear from one of the users. So we interviewed Silvia Grant who’s the Lead User Researcher at the Environment Agency, who works on the flood warning service which uses Notify. \n \nSilvia Grant: \nSo my name is Silvia Grant, I’m a Senior User Researcher for DEFRA [Department for Environment, Food and Rural Affairs]. And I work on an Environment Agency project called ‘The Flood Warning System’. We’re replacing that currently and the new project name is called ‘The Next Warning System’, so we’ve deliberately dropped the flood from that.\n \nLaura Stevens:\nAnd what, can you explain a bit more about that service? What does it do? \n \nSilvia Grant:\nYes, so the Environment Agency has been sending out flood warnings since 1996. It’s a category 1 responder and has the responsibility for issuing these messages to the citizens and people who are at risk of flooding. So what the system does is we send out these texts, these emails, we have this information on GOV.UK, and it’s all about warning people that flooding in the area is likely or is happening.\n \nLaura Stevens:\nAnd how does that system use GOV.UK Notify? \n \nSilvia Grant:\nSo at the moment we have over 500,000 user accounts registered to our service, and we use Notify to send letters and texts. And we send them letters to tell them when they’ve first registered that we update their account details, changes to the service, that sort of thing. And obviously also for our texts.  \n \nLaura Stevens:\nAnd how does that translate into the amount of notifications being sent to the people? And obviously this must change year on year depending on the flooding and depending on the weather and everything.\n \nSilvia Grant:\nYeah. Well so since we’ve moved across to Notify in December 2018, we’ve sent over 4 and a half million texts and close to 10,000 letters. So those are big numbers for us. \n \nLaura Stevens: \nHow does having Notify help you get the information to the people that need to hear it? \n \nSilvia Grant:\nWell first of all it’s it’s quicker - so it’s simpler and quicker and cheaper for us to use Notify. So we can send, in in terms of letters for instance, we can send them daily rather than weekly. We have much more freedom around content changes, we can test those changes. So it’s it’s saving us a lot of that admin time, and cost as well. \n \nAnd because it’s a very stressful scenario for our users, it’s quite again, high emotion, high stress, high impact scenario that we send these letters and these texts in, it, it’s, it’s very important for us to get it right and to, you know for the process to be as slick as possible. And I think Notify really helps us do that.\n \nLaura Stevens: \nSo this is a really important service because there are, there’s 2.6 million properties at risk of flooding. So what sort of information is being sent out through Notify? \n \nSilvia Grant:\nYeah, that’s right. So in England the estimate is between 1 in 5, 1 in 6 homes in England are at risk of flooding. And obviously that figure is growing because of climate change and a number of other factors. \n \nSo it’s, in some cases when we issue severe flood warnings, those are warnings where there is danger to life. So those can be very serious. But overall the flood warning service aims to save lives and livelihoods. So yes overall quite a high impact service. \n \nLaura Stevens:\nAnd how much would this, do you have an estimate on how much it’s saving money-wise for the Environment Agency? \n \nSilvia Grant:\nYeah so just got the figure off the team and it’s saved, in the last 2 years that we’ve been using it, approximately saved the taxpayer at least £150,000. So that’s letters, texts, running costs, everything.\n \nLaura Stevens:\nBut as you’re saying you’re working on like a high impact service that has to get out messages quickly and which has a, yeah an impact, a big impact on people’s lives. Does having something like Notify in place sort of allow you to then have the space to do other things? Because you know that that’s there, that’s just gonna work, and you can then focus on other thi-parts of this quite emotional and high impact service. \n \nSilvia Grant:\nYeah definitely. So it’s, it’s quite a long, for our users it’s quite a stressful time receiving those alerts or those warnings, and when they pick those up we, we need to make sure that they arrive instantly, that they say the right things and using a central government platform makes sure that we have that extra accountability that we really need for sending these out. \n \nAnd yes as well that that has given us a lot more space for actually focussing on things like the content of the message.\n \nSo it’s been overall a positive under all spheres. So it’s easy to use, it’s intuitive, it’s reliable, it’s transparent. So if ever there is an issue with it, we are notified instantly. And again the Notify Team has been really responsive with feedback, so whenever we have had requests or issues, there’s been a fantastic service on their part.\n \nLaura Stevens:\nHow do you plan to use Notify in the future, in your product?\n \nSilvia Grant:\n So as our system gets replaced, the Flood Warning System into what we call the ‘Next Warning System’, we anticipate to use Notify even more. So we’re planning to send confirmation codes to users who sign up to the service on their mobiles. So that is, is a step forward in terms of security for us and it’s again, a cheaper journey and for the user, it’s it’s a 2-step journey rather than a 4- or 5-step. We’ve been testing that with the user and it’s, it’s a very positive response. \n \nLaura Stevens: \nYeah, is that, is that how you imagined Notify would be being used? \n \nPete Herlihy: \nI don’t think we clocked Notify being used to protect life necessarily when we started out. \n \nBut we did get, or start working with the Environment Agency fairly early on, so, so, which was great, because what that meant was we had this use case that we could point out internally to say that look this is really crucial. This, this isn’t just about getting a passport update quicker or these kinds of things. This, this is literally a life-saving message and that, that allowed us to focus the right kind of energies on our resilience and make sure we got what we needed. Because we can’t not be there right like if we’re sending these-this kind of message. We have been working with them for a while, they’re a great team, they blog a lot about what they’re doing which is fantastic and very cool.\n \nLaura Stevens: \nWas there anything else in the clip that particularly stood out to you?\n \nPete Herlihy: \nYeah I think there’s 2 things. So one is letters. Because I think people think of text messages and emails and forget letters is a thing for Notify. Don’t forget but it’s less well understood. And when we started, back in 2016, when we started out, we were letters is probably a thing just because we need to offer a full palette of comms option and for some people they need a letter, or they prefer a letter, or digitally excluded, whatever it might be, they have legitimate reasons, some of them are legally required for example. \n \nAnd we only, and we kind of stumbled over letters, well not stumbled over, we confirmed our letters when we were doing our, these tours of the application processing. Tours sounds really grand doesn’t it? But we’d sit with a team and one of the things they would do is they would finish preparing an application receipt or confirmation of decision or whatever it was going to be. And then they’d press print and they’d select the printer and they’d walk over, join a queue and someone would yell out ‘stop printing I need to put in the letterhead paper’ you know and they’d, and we were like oh this must be very expensive, and then goes from a printer, they’re folding it up into an envelope, the envelope goes into a tray, someone comes round in the afternoon with a trolley and picks them all up and we thought ‘woah there’s got to be a better way of doing letters’.\n \nAnd that was real early confirmation that if we could make it easy for teams to do letters we could save, help them save, huge amounts of money and time. The amount of time people were just standing around waiting for the printers and things like this, so if that could just be a click it’s like great. And they could do lots more good things with their time. \n \nSo that was one thing that was really interesting. \n \nThe second is around the real time content changes. So one of the problems I guess we were trying to solve was often these things are like hard-coded and you need a developer and you need to pay a change request fee to your external supplier to update a typo even in a letter or change a URL in an email or something like that. \n \nAnd we really wanted, not only make it easier to do that in real time but also to allow the interface to be used by like a content designer or a comms person, so they could be involved in shaping the messages themselves in real time. Not just preparing it in a word doc that goes round for sign off by committee, and then is handed over to a development team to implement. \n \nSo we, we really tried to bring those roles into the team. And you know we were hearing horror stories of people paying tens of thousands just to change a few letters, or including extra things because they couldn’t change a letter saying so please ignore this section, these kind of horror stories you hear about. So that was one of the important bits for us to get real time content changes in an accessible way into Notify and I’m glad to hear they’re using it well as well. \n \nLaura Stevens: \nWe also have a clip from the Canadian Digital Service which is Canada’s version of GDS. Notify is obviously used across the UK in the public sector but how has Notify also been used around the world?\n \nPete Herlihy: \nSo we’ve worked with a number of teams actually around the world - some we’ve shared patterns with, others we’ve shared our open source code with. And we, as of today I think there are 2 Notify’s being used in anger, one in Australia through the DTA, the Digital Transformation Agency, it’s basically the, the Aussie version of GDS. They were the first, they forked the Notify code maybe about a year and a half, 2 years ago now. And they’re now running that for the Australian government. They’ve you know, taken the code, they then iterate on top of it to add things that are unique and special to them.  \n \nThe Canadian Digital Service are also running a version of Notify. And that’s growing quickly, it’s grown quicker than we did when we started, so yay for them. But those are the 2 that are being used at government level.\n \nHave to say there’s a lot of people who just pick stuff up from blogs or from Twitter or whatever, rather than any kind of formal introductions to the product. Yeah so it’s a great product, very proud that others have picked up the codebase and are running with it, we continue to work with those teams. Speak to teams like Code for America who are doing great stuff in the States. We’ve had a few all team web catch ups with the Canadian Team, and the Americans to show and tell really about what they’re doing, enhancements they’ve made, things they’d like to contribute back. So we’ve got a good little community going on, which is fantastic. \n \nLaura Stevens: \nYeah, a very nice international community. And we’re going to hear from Bryan Willey, who’s a Product Manager of Notify at the Canadian Digital Service.\n \nBryan Willey:\nSo my name is Bryan Willey, I’m a Product Manager here at CDS, the Canadian Digital Service. And I am the Product Manager for Notify, a piece of software, an open source software, we took from GOV.UK. \n \nSorry is that my cat or your cat? \n \nLaura Stevens:\nI don’t have a cat, so it’s not my cat.\n \nBryan Willey: \nShe’s miaowing outside the door. Sorry about that. \n \nLaura Stevens:\nAnd yeah would it be fair to say for UK listeners, the Canadian Digital Service is Canada’s version or the equivalent of GDS over there?\n \nBryan Willey:\nYes absolutely. I mean it basically has similar initials. Yeah, so the Canadian Digital Service was made with both GDS and the American 18F Group in mind. \n \nLaura Stevens:\nAnd could you describe what the product you manage is, Notify?\n \nBryan Willey:\nSo Notify is a email platform. Well we’re using predominantly as an email platform, it also does SMS. I know that yours does letters but we’re not there yet. We’re predominantly using it for email and it helps the Canadian government sort of send email messages from a centralised location to the public. Something that the Canadian government’s only been able to do with Outlook servers and traditional email servers before.\n \nNotify allows us to have this cloud-at-cost system that can deploy emails very quickly to anyone who wants to use the service, whether that’s an API integration to connect up to automatically reply when somebody submits an application, or if it’s a newsletter that goes out that people sign up for. And it’s been very helpful in sort of building any of those systems because in the past, we’ve had to go procure an individual cloud email vendor for each solution we built.\n \nNotify allows us to centralise all that, procure, secure and say yeah, this one thing is now what we use for email. And so we don’t have to go through the process of procuring it every time, and that’s been exceedingly helpful.\n \nLaura Stevens:\nAnd how’s it going? Because I see, I looked on your dashboard and now 22 services are using Notify and more than 740,000 notifications have been sent.\n \nBryan Willey:\nYeah. Well we think it’s going pretty well. The growth has been faster than we had expected. The current crisis has something to do with that. It’s definitely upped our volume more than it would have been.\n \nOut of the 22 live services, it’s a mix of how much they’re getting used; some are small, more prototype-y services that do things like password reset emails. Whereas some of our more recent ones include a subscription newsletter for Health Canada to combat COVID-19 misinformation. \n \nLaura Stevens:\nSo I saw your blog post on the CDS blog from November 2019, and in it you said ‘this, meaning your Notify tool, isn’t something we built entirely from scratch. Using open source code from the hugely successful GOV.UK Notify service, created by the GDS in the UK, our team is adapting it to fit within our context, in English and French - both of Canada’s official languages’. \n \nSo I wanted to talk about like, what were the user needs for Canada and how was that similar to the user need over here, and yeah how were you able to adapt, what had been done over here?\n \nBryan Willey:\nYeah. So much in the same way I imagine GDS discovered this problem, we had a lot of government services that were communicating with people by mail and phone and the people would rather just get an email, you know. Then they don’t have to sit around and wait for a phone call. And when we were building services early in CDS, we discovered this and we’d be setting up email for each of these services. So after doing this 2, 3 times, CDS said ‘we should really just make this so we can have it every time’. \n \nBecause we’re not, also not the only ones looking for this. The government of Canada is moving towards more cloud-first strategy and as such they’ve identified the needs for email notifications in a bunch of services. So we forked not just GOV.UK Notify, the DTA [Digital Transformation Agency] in Australia also had a copy of Notify that they had modified a bit from yours. And we looked at both of those and evaluated them, and we forked GDS Notify because we wanted to be able to get your upstream security changes and stuff and pull them down into our repo [repository]. And the Australian one was merged into a big mono-repo which gave us less flexibility with the code.\n \nSo forking the GDS one was a great idea to sort of prototype it and see what we had to work with because this was already a solution to the problem we’d found. And we then had to, we liked it so we modified it to Canada. Some of the first things we did was of course update SMS to Canadian phone numbers, add timezone support in, so that the logs and stuff functions across more than one timezone. We had to pull apart the whole UI [user interface] and translate it into French because Canada has 2 official languages. And so it’s been a bit of an overhaul for that, and that’s been a lot of our major work.\n \nAnd we also had to sort of modify the branding system bit. Because again, 2 official languages means 2 official government brands, one in English and one in en français. So we’ve had to sort of modify the templating system. We’re working on that a bit more now to expand it for both official language use cases.\n \nAnd so it’s, it’s just been a lot of tweaks here and there to the system and and re-you know changing the UI to look more like Canada.ca than GOV.UK.\n \nLaura Stevens:\nAnd by having this already in place, what has it allowed you to do? Has it allowed you to move quicker, has it saved you hassle? How has it affected your work and your plan with the product?\n \nBryan Willey:\nIt definitely saved us hassle because we’d have to set that all up from scratch on our own. The email problem, the notification problem, wasn’t going to go away. And these Canadian departments were going to solve it and were solving it by their own means - they were building up their own Outlooks servers and using email stuff. You know that wasn’t taking advantage of cloud-at-cost like Notify did. \n \nSo having the software that you’d spent 3 years building and already putting a lot of the settings and permissions and access and security and tech in place, really saved us the time having to go through that on our own.\n \nLaura Stevens:\nAnd also I wanted to ask, so when I’ll be playing this, this edited clip back, I’ll be with Pete. And I wondered if you had anything you wanted to say to him, any questions or any requests as the Lead Product Manager for Notify?\n \nBryan Willey:\nThanks for all your help, I guess. You know. I..it’s working great for us so I don’t know if there’s anything we need or any help specifically from Pete. The software is pretty complete in its solution for email and SMS, and so thanks for all your hard work Pete. \n \nLaura Stevens:\nSo was there anything in there that you were surprised by or that you hadn’t realised?\n \nPete Herlihy: \nSo I’d knew, I’d seen actually most of that we’ve shared with the team so. The one that I didn’t clock was the branding, and the dual language branding - I hadn’t even thought about that one. So we, we may, we may steal that back. Obviously there’s more than one official language in the UK as well so. \n \nThat’s really great to hear that.\n \nThere was an interesting point though around the use of Notify, either by an API or not, so again that was one of our really early reckons when we started Notify, was that not everyone’s got a development team or development capacity or is high enough a priority in their organisation to get the focus. And so we couldn’t just make something that only worked, worked for API and so everything you can do in Notify, you can do via the web interface as well. \n \nAnd the other bit I guess that is maybe even overlooked a bit, is that you get like 3 years worth of software development or whatever, but you also get 3 years worth of research. And we’ve, we’ve done a lot. You know we’ve always had a dedicated user researcher in the team, we’ve always done a huge amount of user research, which you have to d-, for something you’re aspiring to make completely self-service, you have to do the user research, otherwise it’s just never going to be. \n \nAnd so we’ve done loads with like developers, with finance people, with product teams - all the different types of people we see wanting to use Notify. I think what you get when you fork code or, or you know even just take the patterns that another team has, has, derived is you just save yourself years of user research. And again, at that point you can then focus on what are the, the like the niche research requirements around working en francais as he says or whatever else it might be. So that, along with kind of the blogging that goes along the way that shows some of the thinking that goes into the product and some of the decisions that are taken, I mean all of it just shows how, how sensible it is to be doing this stuff in the open. \n \nLaura Stevens: \nYeah, for sure. And I think that, talking about doing stuff in the open and blogging, leads me on quite nicely to my next part, because I wanted to talk about Notify’s most recent work on coronavirus, which you referenced at the top of the podcast. And 2 of our colleagues, Miriam Raynes and Mark Buckley wrote a blog post about how Government as a Platform, or GaaP services, as a whole are helping with the COVID-19 response. \n \nBut to talk specifically about Notify, they, in the blog post it’s talking about this huge increase in numbers, like 2 million SMS messages were sent using Notify on a single day in March compared to the daily average of 150,000. I’ve also got a figure here of daily messages up as much as 600%, as high as 8.6 million a day. \n \nSo what services are using Notify to help with the government’s coronavirus response?\n \nPete Herlihy: \nYeah, there, so the, the increase in communication is obviously massive and needs to be. And one of the biggest users of Notify is the GOV.UK email service, and they, they do all of the email for people who subscribe to any content that the government publishes - so travel alerts for example, if you want to know can I take a flight to Namibia, here’s the guidance, or if there’s hurricanes coming through the Caribbean and these countries are affected, then I need to like push out information to say don’t go to these places, or whatever it might be. And those alerts are, you know, again potentially protecting people, life and property - they’re like really important. And there’s been a huge amount of travel advice and alerts being given, as, as you can imagine. So that’s been one of the biggest users. \n \nWe’ve also seen, I mentioned earlier, like a huge amount of business continuity stuff. And we put a blog post out recently as well, just reminding I guess more than anything, that all of the public sector could use Notify to provide emergency staff updates for changes to working patterns et cetera. as a result of COVID-19. So there’s definitely been a big uptick there.\n \nAnd then I think, from, from the health perspective there’s, I’ll just say NHS because there’s like various bits of the NHS that are working like ridiculously hard and fast to spin out new services really quickly, and these services are like just incredibly crucial right now.\n \nSo the extremely vulnerable service, this is one where the government said if you are you know, in this extreme risk category you should stay at home for 12 weeks, and they’ve been texting this group of people.\n \nThere’s all the stuff around testing and results for testing, ordering home test kits, all these sorts of things. So there’s the very specific COVID response type stuff and that is, there is a significant volume of that that’s still ongoing. \n \nThere is business as usual to some degree actually still going on. So people are you know, people are still having to renew passports or whatever it might be. Whilst the volumes are down, they’re still happening. So we don’t stop all the other messaging and just focus on this, we’ve, we’ve got all that to do as well, and this is, this is all additional, it’s all on top. \n \nIt all came very quickly as well. You know this wasn’t a gradual ramp up over weeks and weeks to 5,6,700%, it was, it was almost overnight. And yeah, it’s been a huge task to, to keep the platform stable. We had one outage as a result of this on St Patrick’s Day. Which obviously we were massively disappointed at, like our resilience is like one of our, you know, one of the things we pride ourselves most on but we just couldn’t prepare for that kind of instantaneous ramp up. So we, we fixed that very quickly and you know Notify itself has been very stable since.\n \nBut we’re still continuing on the basis of what we’re seeing now, we’re going to call that the new normal and then we need to add again capacity, 2 or 3 times that again. So there’s still a lot of work to be done, the team still working incredibly hard as they have been ever since, well always, but particularly since, since lock-in began. \n \nLaura Stevens: \nAnd I believe I’m right in saying as well the 1 billionth message was also a coronavirus one - that was for a notification sent by the coronavirus home testing service.\n \nPete Herlihy: \nYes, it was, that was quite opportune. It’s a good example of the type, the primary type of messaging that’s going on with Notify at the moment. \n \nAnd you know those levels are still high, I think we had like 7 and a half million again on Friday, so we’re not getting any quieter. We’re, and we have to plan that we’re not going to. And if we do get quieter then ok, that’s fine but we, we can’t sort of take our foot off at the moment.\n \nLaura Stevens: \nAs you mentioned one of the organisations using Notify a lot at the moment is the NHS and the various teams within the NHS. And we’ve got a clip from Darren Curry, who’s the Chief Digital Officer at the NHS Business Services Authority, about how and why his team are using Notify. \n \nDarren Curry:\nHello I’m Darren Curry, the Chief Digital Officer for the NHS Business Services Authority [NHSBSA], which is an organisation which processes a lot of nationwide transactions on behalf of the NHS, so both public-facing and towards other clinical-facing services. \n \nLaura Stevens:\nAnd you’re quite a long standing member of NHSBSA, aren’t you?\n \nDarren Curry:\nYes, I am. So I’ve been at NHS Business Services Authority for roughly 17 years, 17, 18 years now. Believe it or not, I joined originally as a Data Entry Officer back in the day, whilst I was doing my university degree, for pocket money effectively, or beer money. And it paid for me through, through university and I have enjoyed it so much and progressed in the organisation to now be Chief Digital Officer so it’s, it’s been a good place to work. \n \nLaura Stevens:\nAnd I know that the NHS Business Services Authority has been doing lots of things in response to coronavirus but what I’d like to talk to you about today is what you’ve used GOV.UK Notify for.  \n \nDarren Curry:\nYeah. So we use GOV.UK Notify on a number of our live services as we stand now. So we, we issue exemption certificates, so prepayment certificates for prescription forms, maternity exemptions, which we now issue digitally - so, so we already use Notify for those services in our, our normal processing. \n \nWe, we first started around coronavirus with Notify on a, what was a relatively small service, for informing individuals who were returning into the UK or who were being advised to isolate, so to provide advice during the 7 days isolation period. \n \nAnd since then our support has grown in the services. So we then utilised the Notify service to support provisioning information to patients who were identified as high risk should they contract coronavirus. So there, there’s individuals who have been asked to shield during the outbreak in order to reduce the chances of them contracting the virus. So we, we text messaged all of those individuals over a 7-so we issued them with 7 texts messages, so one per day, providing advice and guidance on, on what to do during their shielding period. \n \nThat, that service has grown as, as more people who’ve been identified as being vulnerable, so working with GP practices and NHS England and NHS Digital to identify more individuals who, who may be vulnerable should they contract coronavirus. That, that has grown and we’ve issued more text messages and information to those individuals. \n \nWe’ve used Notify to provide test results for coronavirus, working with NHS Digital and other partners. We’ve used Notify to also provide advice and information for individuals who go through the 111 service in providing text messages and also emails for those services.\n \nAdding it all together, over the last 4 weeks, we’ve issued around about 17 million text messages via Notify through the services that we are, we are delivering, so. \n \nIt’s, it’s scaling and it’s growing very quickly. \n \nLaura Stevens:\nAnd so this is, the, the information you’re getting out there is obviously like, it’s really important it’s right, it’s really important that it gets to the right people, it’s an emotional service like, people are scared, like your users are concerned. So-why did you pick Notify to use this on, on these particular services? \n \nDarren Curry:\nYeah. So, So I mean Notify brings a lot of benefits. I, I think should also say that we, we, in terms of building those messages as well, we worked with colleagues in behavioural insights teams within government, Public Health England, NHSX, content designers, on all of those, and getting the content right was, was critical for these services. \n \nBut you’re absolutely right, the infrastructure to send those services, those, those messages needed to be kind of stable and dependable. And, Notify does that, so it’s, it is national infrastructure that we can, can leverage all of the benefits of that having already been built as a government platform that we can consume, to, to use as a service really quickly, securely and safely and knowing that, that those messages will, will be passed. There’s lots of benefits that the Notify service has, has brought us.  \n \nSo if, frankly if we were having to do this without the Notify service, we wouldn’t have been able to do it. So that we, we would have been dependent upon trad-more traditional legacy contact methods, such as post, to individuals to inform them on, on this scale. We would had to build a, a technology solution to meet this need - we clearly didn’t have to do that, we could leverage something that was already built for this purpose. \n \nAnd, and this is the benefit of government as a platform that we can consume, you know, the first service we set up with Peter was done within an hour. We, we were able to from, from the request to us being then able to actually push text messages, it took less than an hour to, to go from A to B on that. And you know, without Notify we would have been looking at days, and, and in this situation of a, of a national pandemic, then time’s obviously absolutely critical you know, for people to be able to act upon the advice which has been provided - it’s, it’s, it’s genuinely critical. \n \nYeah, so, so Notify brings all of those benefits - secure, platform, scalable, to be able to deliver those messages. Yeah. \n \nLaura Stevens:\nCan you tell me about some of the responses to these SMSs?\n \nDarren Curry:\nYeah. For the shielded patients list and the text messages we sent the first cohort when we sent those, we enabled individuals to reply. And some, and we did some analysis on the replies to, to those messages and some of, some of the messages indicated, well some of the replies that we received indicated the difference that the service was really having. \n \nSo you know the, the replies from people thanking, just saying thank you for informing us and like, they, they would follow the guidance and the maybe hadn't realised that they were in that high risk category beforehand. In this instance you know, we sent it out and we were able to see some of the replies and know that as a result of that action that was taken by sending that message out to an individual, there was an action that that individual was then going to take. And that action potentially, more than potentially, more than likely will result in a reduced risk of that individual being taken ill, and consequences of that. \n \nSo yeah, it, it really does bring home that and highlight the importance of some of these services and how they all join together. \n \nLaura Stevens:\nSo, NHS Business Services Authority is obviously doing a lot of work, you’re working also with other organisations across government as well, aren’t you?\n \nDarren Curry:\nYeah, so we, we are working alongside our partner organisations including so NHS England, NHS Improvement, NHSX, Department of Health and Social Care directly, Public Health England, the Behavioural Insights Team, GDS also and NHS Digital, have all, we’ve all collaborated and come together across on multiple different services that we are doing. So it’s been a real collaborative effort across the whole of the government family to get these services up and running.\n \nLaura Stevens:\nAnd had you, did you find you had to, ‘cause obviously it’s for use in like health services but it’s also used like in central government departments, it’s used by local authorities, it’s used in prison services, used by fire services. Like did you find you had to adapt it at all to the health context or was it all sort of ready to go for you? \n \nDarren Curry:\nThe great, one of the many great things about Notify is it works just out of the box. So from my development teams in the [NHS] Business Service Authority, it’s a, it’s a really easy integration point. So whether we’re integrating using an API to push the, the messaging or whether we're doing batch uploads of CSVs [comma-separated values files] or spreadsheets or whatever, it works for, for all of those things. \n \nI think the, the other thing as well to mention is, is that you know Notify, it’s a trusted service. So we were able to work with the National Cyber Security Centre [NCSC] as well to, to ensure working with the Notify Team and NCSC, to ensure that the messages we were sending were protected numbers. So it was you know again, just adding that, that security to the whole service when you’re doing critical services for people, that we can make sure that they’re trusted and they are known and protected. \n \nLaura Stevens:\nIf I’m playing this clip back to Pete, is there anything you want to ask him or anything you want the team to develop next? \n \nDarren Curry:\nI, you know what, it’s a, it’s a really tough question because the, the Notify Team, it’s, it’s a fantastic service. And I think rather than asking Pete to develop anything else, I think my encouragement to Pete and the team is to take that time to reflect on the things that this service has enabled in a time of a national crisis and the things that him and the team have been able to enable, are awesome. And it’s easy to forget that. And 17 million messages to people who needed support, that would not have been achieved, will have genuinely saved lives and protected people.\n \nPete Herlihy: \nWow. That’s awesome. Seeing the value that has to them and understanding that you know, without Notify being in place, that stuff just could not happen or you know wouldn’t have been remotely as effective as, you know I maybe hadn’t quite appreciated the, the extent of that.\n \nSo yeah, that’s pretty mind blowing. \n \nLaura Stevens:\nYeah. Yeah I think what Darren says well is articulate how this technology tool but how it translates to in people’s lives.\n \nPete Herhily: \nYeah, makes it, it makes it very real, for sure. I, I think, I think, you know we’ve talked a bit in the past about how we can’t afford not to have these platforms in place, and, and that was before a global pandemic right? But, and it’s not you know, Notify’s not the only platform in town - we’ve got publishing, you know identity, payments - so but we need them, we can’t afford to not have them. Yeah, now more than ever I guess.\n \nI just want my team to hear that. \n \nLaura Stevens: \nSo thank you so much for Pete for coming on today. \n \nPete Herlihy: \nWelcome. \n \nLaura Stevens: \nAnd you can listen to all the episodes of the Government Digital Service podcast on Apple Music, Spotify and all other major podcast platforms, and the transcript’s available on PodBean." ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_196l2nw_1200x628.jpg?s=149ff9cab638f70627f210ea55eabd5f&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-19-a-spotlight-on-govuk-notify/" ]
  }
}
