{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #25: GOV.UK Pay | Government Digital Service Podcast" ],
    "summary" : [ "The GOV.UK Pay Team explain how the government’s payment service works, and hear from those who use it across the public sector.\nThe transcript for the episode follows:\n-------------\n \nLaura Stevens:  \nHello and welcome to the Government Digital Service podcast. My name is Laura Stevens and I'm a Creative Content Producer here at GDS.\n \nFor this month's episode, we're going to be taking a look at GOV.UK Pay. GOV.UK Pay is the government's payment platform, letting service teams across the public sector take payments quickly and securely.\n \nIt's hit a few milestones this year as it's now used in more than 400 services in around 150 organisations. These services include applying for a Blue Badge, sending money to someone in prison and further afield in many British embassies around the world as part of the apply for an emergency travel document service. \n \nAnd since it started in 2015, GOV.UK Pay has processed more than 10 million payments to the total value of more than £537 million. And today, we're going to hear from users of GOV.UK Pay from central and local government, and we're also talking to Miriam and Steve from the GOV.UK Pay Team to hear about the product, its features and where it's going next.\n \nSo welcome, Miriam and Steve. Please could you both introduce yourselves and what you do on GOV.UK Pay. Miriam, first, please.\n \nMiriam Raines: \nHi, I'm Miriam Raines. I am a Product Manager on GOV.UK Pay.\n \nSteve Messer: \nAnd hello, I'm Steve Messer. I'm also a Product Manager on GOV.UK Pay. \n \nLaura Stevens: \nI gave a brief introduction to GOV.UK Pay at the start, but I was hoping that you could both maybe explain a bit more about what it is and how it helps service teams across the public sector. So could you describe a bit more about the product, please?\n \nSteve Messer: \nSo the GOV.UK Pay is like a part of the Government as a Platform programme. And the basic idea behind that is that service teams across government and local government have to do a bunch of the same stuff in order to move users through transactional services. So loads of people have to pay for things inside of a service, people have to apply for things, they have to receive emails - that kind of stuff.\n \nAnd there was an idea a while ago to turn those common problems and solve them with like components, common components. And that's where the products from Government as a Platform come from.\n \nMiriam Raines: \nAnd there's sort of 2 parts to Pay: there's the bit that the paying user would see and they're one of our key groups of users. So these are the payment pages that will ask for your card details and give you sort of helpful guidance and helpful error messages, make it really easy to pay, they're really accessible, they're designed in line with the Service Standard and Design System and they're intended to be really easy to use and we're really regularly user testing those to give a sort of consistent, trusted, experienced for users who are paying online across the public sector.\n \nAnd then there's the other part of Pay, which is for our other group of users, which is sort of public sector workers. So that is civil servants in central government and arm’s length bodies, it is police teams, it's finance people or digital teams in local government or the NHS. And this allows you to set up and manage your services, to take payments to really easily see what money you've had come in and make, issue refunds and track cases and applications and transactions. \n \nAgain, very much designed to be as simple to use as possible. We don't want to make this something that needs like a whole lot of training. We want to be really intuitive. \n \nLaura Stevens:\nOk, so how does GOV.UK Pay work with a service?\n \nMiriam Raines: \nSo you can plug Pay into your service. So if you've already got an existing online service, you-your users are on that service, they're paying for their licence, they're paying for, they're, they're making their application. At the point in which they're ready to pay, they're transferred over to Pay, it should look really seamless for that user, and it doesn't feel like jolting that they're going somewhere unexpected. That user can then really easily pay and is redirected back to that service. So that's when we do it in a sort of fully automated, integrated way.\n \nAnd we've also got options for teams that don't have digital services to really be able to take payments online instead of taking payments via a cheque or expecting someone to call up and pay over the phone, which we know can be time consuming, it could be quite expensive to handle those, you're much more restricted on the hours that you're able to manage those payments. So we've got those 2, those 2 options for different users. \n \nLaura Stevens: \nAnd can you describe some of the services it's been used in? \n \nMiriam Raines: \nYeah, we've got sort of a whole range of services. We've got some really big central government services right through to, so you mentioned, ours, we're open to local government, to NHS and police forces as well. So at sort of big central government level, we work with DVLA, we work with the Passport Office, so if you're making a digital application for passport, you'd be paying on GOV.UK Pay. We work some national services like Blue Badge. So we support a, lots of local authorities to handle Blue Badge payments. Right down to some really like small services that don't see a lot of transactions: we can have like yacht racing certificates. If you want to pay for an image of Field Marshal Montgomery at the National Archives, you can pay for that using Pay. It's quite, quite a variety. It's absolutely fascinating seeing all the things that government handles money for. \n\nLaura Stevens: \nSo you mentioned there how some of the people who use it are from health and also from local government and central government, and I’ve got here as a brief history, we started off in 2015 with central government departments, then opened up to local government in 2017 and then in 2018 the health sector started using GOV.UK Pay. \n \nBut I also wanted to talk about some of the successes that have happened this year, 'cause this year has been a big year for GOV.UK Pay. I see from Steve's weeknotes - every week there seems to be a new headline. So I just wondered if you could just take me through some of the highlights from this year in GOV.UK Pay.\n \nSteve Messer: \nYep. So I think it was a couple of weeks ago, so maybe mid-October when we had our 400th service go live, which was a good milestone. I think compared to last year, there were, I think there was something around about 100 live services. So we've seen a massive increase over the last 12 months, which is fantastic. It's good to see that the product is being used and talked about, but you know, it does mean that we have to work a bit harder now. So many more needs coming up, but that's fine, that's what we're here for. \n \nI think we've also just before then, so I think it was around about September, we passed a milestone in the value of payments that we've taken and we've now taken well over £500 million from users and passed that on to government departments. So you know half a billion pounds moving through the product is quite a big milestone because you know, a lot of people on the team remember when the first quid went through.\n \nBut it's also it's, it's, it's exciting to see the benefits that it can generate as well. So in our economic model, we know that it can save service teams, tens of thousands of pounds in procurement costs and the time that's associated with that. \n \nMiriam Raines: \nI think we've also seen, we've able to sort of respond quickly when teams have needed to get set up with services that related to sort of COVID support. You know we are one small part of that massive thing that those services are handling, but if we can make just even the payments bit of it that bit easier and take that burden off the team when they've got all these other things to work on and get people set up really quickly, that's felt really valuable.\n \nSteve Messer: \nThere was another episode just after the lockdown got lifted as well where like, no-one was applying for fishing licences because everyone was inside obviously. And then all of a sudden the, the, the break of the stay at home order was announced and people could go fishing again. And the number of fishing licence applications went from 0 to up to something like 2,000 per minute or something like that, within an hour. And it was just, it was fascinating to watch the dashboard just go, 'bleep, bleep, bleep, bleep' and you know things start happening. It was, it was a very cool. \n \nLaura Stevens:\nAnd yes Steve, you actually set that up very nicely as well, because we're now going to hear from the Environment Agency and they are talking about fishing, so you've clearly got some friends over there.\n-----\nHaroon Tariq: \nI’m Haroon Tariq. I'm the Delivery Manager for the I Want to Fish Team, who are responsible for digital service that enables anglers to purchase fishing licences and submit catch returns.  \n \nLaura Stevens: \nCan you tell me a bit more about what the service provides?  \n \nHaroon Tariq: \nSo the I Want to Fish Team looks after the service, which allows anglers to buy fishing licences which are legally required by law and also to submit catch returns, which basically means that if you go fishing for salmon and sea trout fishing, then we need to know where you fished, where you've caught, et cetera. So that's what I help look after.  \n \nLaura Stevens: \nAnd so I wanted to just give our listeners some context for this service for anyone who doesn't regularly fish, and because the numbers involved are quite big, aren't they? I've got here a million licences are purchased a year.\n \nHaroon Tariq: \nThat's right, yeah, so so about kind of a million licences get purchased a year. I mean, just to give some context, in England alone, angling is worth 1.4 billion and supports at least 27,000 jobs. Angling is increasingly being used to address mental and physical health, social inclusion, which are key issues in society, especially pertinent in recent times with the COVID-19 pandemic. \n \nLaura Stevens: \nAnd can you describe what the licence is? Is it something that's on your phone? Is it a physical licence or how does that work? \n \nHaroon Tariq: \nSo the licence is basically provided via you get an email confirmation and you will typically get a paper card with that licence as well. And that is something that we're looking to review going forward, so watch this space! But at the moment, it's a legal requirement. If you get caught fishing in England or Wales and you don't have a fishing licence, then it is a prosecutable offence. So it is very important that anglers do have a fishing licence. \n \nLaura Stevens: \nAnd how does GOV.UK Pay work with this service?\n \nHaroon Tariq: \nSo GOV.UK Pay is our kind of payment services platform. So we use it to process online card payments for fishing licences. We are one of the larger volume services that use Pay. So we process between 2 to 5000 transactions per day.\n \nLaura Stevens: \nAnd you mentioned it earlier, and also from my research you mentioned about how more people are fishing now with coronavirus with the lockdown when it lifted over summer.\n \nSo from my research, I’ve seen that when lockdown lifted in summer, there was a huge increase in people who wanted to fish, 6x in fact an increase with a peak of 1,575 applications per hour after the ease of restrictions, when there had been no higher than 252 applications per hour in the previous 30 days. So how did GOV.UK Pay help you process these?\n \nHaroon Tariq: \nSo when lockdown restrictions eased, licences sales are shot through the roof and the service suitably with the additional load of anglers purchasing licences over a short period of time. This is made really easy due to the close collaboration between our internal teams at I Want to Fish and the GOV.UK Pay teams, making enhancements to service to cope with the surge in demand for fishing licences. \n \nGOV.UK Pay was very good in working with us to understand in terms of the potential spike in peak of kind of people buying fishing licences. So effectively, we made the systems even more resilient than they already were. So they are very resilient anyway, just to kind of try and support that additional surge in demand. \n \nAnd I'm pleased to report that it did work really well. As you've quoted in some of your figures there, sales figures for fishing licences kind of hit the roof when Boris did kinda ease exercise restrictions back at the beginning of the summer. So, yes, it was very well kind of work together and it worked well for us.\n \nLaura Stevens: \nAnd so what features does the Environment Agency make use of GOV.UK Pay in both now with coronavirus, but also all the time? \n \nHaroon Tariq: \nSo I think one of the key benefits of working with GOV.UK Pay as a kind of payment services provider is that it allows us to benefit from platform enhancement. So what I mean by that is as the platform evolves and iterates, then we can kind of gain benefit from that. \n \nSo one of those examples is the recent card masking feature, which basically masks the card payment details when they’re entered. One of the other features that kind of is out of the box that we use is the transaction reporting, so we can review kind of transaction volumes and look to kind of forecast any potential peaks, such as you've mentioned, in light of Covid and exercise restrictions being eased.\n \nOne of the other features that I quite like is that if there are any production instances that occur on the service, we have the access to a live issue monitoring alert system, which allows us to track what those are, keep abreast of any updates and help us kind of predict any volumes going forward.   \n \nLaura Stevens: \nAnd looking forward with the future of your service, how can GOV.UK Pay help you with that? \n \nHaroon Tariq: \nSo we've got lots of exciting stuff coming up on the service for us, on I Want to Fish, which you'll have to wait and see. But GOV.UK Pay is our kind of payment platform provider as it kind of continues to try and add enhancements on the service. We will look to kind of gain the benefit from those as we move forward. \n \nSo I've already mentioned about the card masking feature. I'm sure there will be other benefits such as this that will look to glean and take forward. So I think that's one of the key things for us, is having a payment service provider that can iterate and move forward and kind of give us the benefit without us having to kind of spend time and research and money in that area. So with the GOV.UK Pay Team, it's very good. We've worked well together and look forward to working for in the future.  \n \nLaura Stevens: \nAnd I'll be playing this back to the GOV.UK Pay Team during the podcast, is there anything you'd want to say to them? Anything, any requests you want to put in for any of these new features? \n \nHaroon Tariq: \nFirstly to say thank you, we've kind of created a really good partnership with all the people that we work with, with the team and very much going to continue the good work. We've got some exciting stuff coming up. We're looking at different payment methods, which we're going to be working with GOV.UK Pay going forward on. So watch this space, but for now thank you. \n----------\nSteve Messer: \nThat's just really nice - it's so lov-lovely to hear. That was wonderful. \n \nMiriam Raines: \nOne, one thing I thought was really good and really interesting to hear about that sort of idea of partnership. I think we really do try and work very closely in partnership with our services. We sort of regularly talking to services about how they're finding it, you know what's working well, what's not working well, and really involve all of our users in shaping that future roadmap. So when we're talking about releasing new features and make sure that functionality is available, and really just sort of like upgrades that get sort of passed through to the teams without them having to do any sort of additional work - all of those things that we build in our roadmap are really based on these conversations with users that come out of the, the feedback we get from them and trying to understand their needs and expand the way that Pay can support that. \n \nSteve Messer: \nYeah, that's, that's the cool thing, really, and that's, I think that's one of the reasons I get up in the morning as a Product Manager, is that the job is never done. There's always more to be doing. So whilst we've created a product which allows government to take card payments pretty easily and simply and then manage those, there's always going to be some other problem around the corner that people need solved. And as you hear from Haroon there, they're sort of looking at other payment methods in the future. Things that were interesting to explore with people and looking at the moment.\n \nLaura Stevens: \nAnd Miriam, to quote your words back at you, you along with Mark Buckley, blogged about the use of GaaP products with Coronavirus, and in there you said “some services needed to stop taking cheques or reduce reliance on call centres as offices close and call centres have fewer staff. GOV.UK Pay has been able to help these services start taking payments within a day and keep important services running.” So what I wanted to do is I want to play a clip from Home Office who, like the Environment Agency, are a long established user of GOV.UK Pay to hear about their journey with GOV.UK Pay. \n------\nLisa Lowton:\nYeah, so it's Lisa Lowton. I'm from the Home Office and I am the Head Functional Lead for our ERP solution - and the ERP solution being the Enterprise Resource Planning Tool that we, we look after all of our HR and finance activities.\n \nLaura Stevens: \nLisa, I know you've worked in the Civil Service for quite a long time, particularly in finance and project work, could you just give us a brief description of your career? \n \nLisa Lowton: \nYeah, sure. So my career started, I was an accountant in the private sector and decided I wanted to change. And an advert came up to work in the Home Office as an Immigration Caseworker - so that's where I started.\n \nDone a number of years as an Operational Caseworker and then moved into the project space. And that slowly moved me then back into finance and looking at ERP [Enterprise resource planning] systems again. \n \nLaura Stevens: \nAnd as well as obviously being in the Civil Service for while, you've also been involved with GOV.UK Pay for a while I believe since its inception back in 2015 with, under Till Wirth at the time, the then Product Manager. So can you tell me how you used the GOV.UK Pay over the years?\n \nLisa Lowton: \nYeah sure. So, yeah, I met Till 5 years ago it was, at a Civil Service conference down in London, when we were allowed to travel at that point. So, so Till and I met when he was doing a stall and he was talking through payments and, and how things were going to be done in one place for government, and, and I kind of really enjoyed speaking with Till and I was quite interested. \n \nIt was literally by chance that about 4 or 5 months later, where I was working at the time, the Disclosure and Barring Service (DBS), decided to look at developing a product in-house and that would mean an element of payments that would be taken - so straightaway Till came to mind. So that literally was the-the start of the journey really. \n \nSo that was the DBS Basic Disclosure Service and they use all 3 of the GDS products - so Verify, Notify and Pay. So we were the first ones to go live with that. And it took around 2 years and it went live in January ‘18. And Gov.Pay was obviously a key element of that. So it was really nice to see from inception, them conversations in Civil Service Live to then actually it rolling out into that service - so that was where it started. \n \nLaura Stevens: \nAnd more recently, I know coronavirus has, like for many of us, pretty much all of us, have forced you to change some of the way you take payments on services. So can you explain a bit more about this service and how GOV.UK Pay has helped you with that shift? \n \nLisa Lowton: \nSo we were looking at the, the pay portal to move all our invoice payments to. So, so currently our card payments were, are taken through another provider, and they're kind of a shared service centre as such, and, and card payments are actually took through manual card terminals, which was, obviously means the-the agents having to obviously be in the office at the time, and also the number of issues that the guys faced with their manual card terminals including lack of, lack of Wi-Fi, that type of thing was-was also an issue. \n \nSo we were already looking to move the service to Pay. It was just by chance that COVID came along and meant that there was a real risk that the, the guys in Wales potentially might not be able to be in the office, which meant that we would, we would then have a bit of a gap as to how we would take payments for invoices that needed to be paid over that period, and who, who, people prefer to pay by card as well. So so that was the opportunity that we had. \n \nAnd therefore we-we had a conversation with your development team as to look how we could use a payment link in that situation. We put it through our internal governance - our DDaT [Digital, Data and Technology] governance - who were really supportive of us in-in getting this up and running. And it took around about 5 weeks and we managed to, to get it up and running to be able to provide that as, as a backup service should, should the team in Newport not be able to be in the office.\n \nLaura Stevens: \nAnd you mentioned payment links there, and I know this is a feature that's been really helpful to you. Could you explain a bit more about what a payment link is and how it helped you? \n \nLisa Lowton: \nYes, sure. So as I spoke about before the, the COVID response was how, how are we able to give customers the way to make a payment without having to, to call the call centre for example, or where the call centre can't take that payment.\n \nSo the payment link was,was really handy so that we were able to put on, counter the IVR - so the telephone solution, where we can say, you know, we can't take a payment right now so if you go to this GOV.UK and, and provide that information, and also we've put it on a number of, or we are about to put it on a number of potentially e-ma, at the bottom of emails that, that go out from the shared service centre, as well as the, the kind of the longer term view of putting it on the back of an invoice, and also on some of the, the penalties, which is also where we need to add that payment linked to as well.  \n \nSo just on the payment linked functionality - really easy to set up, very quick. Obviously the, we had some thinking internally as to how we make sure people provide the right information, because at this point, weren't quite sure how, how the data would come in. And so, so that was really easy to set up. And there was, you know, we did some internal reviews and to be able to make the changes like we did so quickly, I think there was absolutely astonishment because normally when you make changes on any type of, of portal, it normally takes a number of weeks, a number of months, and normal has a pound sign on it. \n \nAnd that wasn't the case. It was all, it was all at our fingertips and we were able to change it there and then in the sessions that we were having with the internal business colleagues as well. So that, that was really good.  \n \nSo we've been going for 5 months now, and again, this is not been advertised anywhere specific, this was only set-up for the, for people who weren't able to make a payment when they called up - to date we've had just under £200,000 of, kind of, revenue coming in. So which is great, which, which has come through a portal that would never existed 5 months ago.\n \nSo, so we've got to remember kind of you know, some of our customers you know don't want to, don't want to pay, you know some of these are penalties, and, you know, like any, anything like that, you, you potentially do struggle to, to get the income in. But it does show either how easy the solution is and how people are, the usability of it is really good. Because therefore, you know, we've got that promise to pay and you know, over 90%, which is, which is superb. \n \nLaura Stevens:\nAnd what other features have you used?\n \nLisa Lowton:\nI guess one of the advantages of going to GOV.Pay was that obviously as the payments industry develops, GOV.Pay are absolutely there at, at the frontend of this. And a recent example, well maybe not that recent but you know, 12 months ago when Apple and Google Pay we're, we're very much kind of hot on the heels of, of how people want to pay. That was something that, as part of where I spoke about before the Disclosure and Barring Service, Basic Service, that's something that we wanted to use. Again it gives people the opportunity to you know, more, more opportunity to pay through however they want to pay.\n \nI was really surprised, I don’t know why I was surprised, it was just a really good example of the where you guys had built the technology, and all I did was click a switch and that was it. And then my customers were then able to pay by Apple and Google Pay. And, and that for me was a real key benefit because it was something similar that we were looking at in another area of the service, which potentially would have cost that organisation quite a lot of money. So that is, that is something that I'll always remember that first kind of, I suppose it's an enhancement as such, of how that work was done you know, in GDS and we were all able to benefit from it. And that's something that I want to kind of make sure that people are aware of these types of things and the benefits of moving to GOV.UK Pay. \n \nLaura Stevens: \nAnd when I'm playing this clip back to the GOV.UK Pay Team, is there anything you'd want to say to them, or any requests you have or anything else? \n \nLisa Lowton: \nOoh..so, so firstly it is a massive thank you. And I guess it's, it's just what I suppose, you know, when I think about how, how can we make this service better, we've got to get the word out there. So things like this podcast, you know other, other advertisements that we can do, that I can do as a department to try and sell this service will only help longer term, and will also mean that you know the guys back in the GDS office, or in the, or in their living room or wherever they are now, understand that the important job that they do for central government. \n \nIt's very easy for people in the back office not to understand the impact of, of the front line. And I can give you an example really, a quite recent example of conversations that we're having with our colleagues at the border who want to be able to make sure they've got access to see information 24 hours a day, you know, our operation does not close down in the Home Office, it absolutely stays open 24 hours a day. \n \nAnd we are now working with them and using the Pay, using the Pay portal to provide them some information to which they, they're over the moon with. We're still early days. But just, you know, just for me to hear these guys tell me the impact of having this information 24 hours a day was, was quite emotional if, if I'm being honest, and sometimes people like ourselves and people in GDS might not see that front end impact, but it absolutely does, it does make a difference. And we need to make sure that we always keep that in mind - is that why we're doing it.  \n \n--------\n \nMiriam Raines: \nI'm pretty happy to hear Lisa's happy. Lisa's been such a great advocate for Pay, and you know, as she said we've been working with her you know, for the last 5 years through various, through her various jobs that have taken her to different parts of central government. As Pay has grown and changed and been thinking about the new things that we can offer, and hopefully you know, sounds like she's had some benefits from, from using us and from the things we've been able to add, but we've also gained hugely from like getting her insight into what it is like to be a finance person in central government. Like how, how can that work better, what are the problems they've got, what are the things that we can help with to make that easier. So she's been really great with her time sort of sharing that information with us. \n \nSteve Messer: \nSo that's one of the things that really excites me, is thinking about these different scenarios that people are in when they do need to pay government. So they might be on their way to work, on the bus using their phone, and they don't really want to like have the hassle of sort of going through a government service really. They have to do it. But knowing that they can just like coming along to GOV.UK, go to a service, fill in a form, use Pay to pay us, and then get on with the rest of their life quickly, simply and easily, I think is the value of what we do.\n \nI sort of did actually wonder what are the different devices you can use to pay government on? Because not everyone has access to the latest smartphone or a laptop or a computer or that sort of thing. So I had a bit of a play using some devices that might be more common that are a bit easier to get hold of, like a really old Kindle. So it's nice to know that you know anyone, no matter their digital access or requirements, they should be able to just pay government and get on with their life.\n \nLaura Stevens: \nAny other devices or just the Kindle? I know we've had, we've heard before that GOV.UK's been accessed by a PlayStation, services have been used on that as well. \n \nSteve Messer: \nYeah, PlayStations, games consoles, I've used it on a TV as well, that's like quite common. People have smart TVs but might not have a smartphone. So you can use it on that. I don't know what else I've tried it on. That's it - I need to try it on the very first Web browser and see if it works on there, I'm hoping it does. That's a bit of time travelling if you do that, it's quite fun.\n \nLaura Stevens: \nAnd yes, and before we hear from our final clip, which is from Surrey County Council, I wanted to talk about local government. And I wanted to talk about the collaborative project with local authorities and the Ministry of Housing Communities and Local Government or MHCLG. Could you tell me a bit more about that, what it was and what you found out about it? \n \nMiriam Raines: \nSo, yeah, MHCLG had set up the Local Digital Collaboration Unit and GDS has been working very closely with them to support that. They had a fund that local authorities could apply for to help solve common problems. And so local authorities could form groups, partnerships with other local authorities looking at the same problem, apply for money to investigate that either at sort of a discovery level or sort of alpha level if they'd already done some work on this in the past. \n \nAnd there were a group of local authorities led by North East Lincolnshire that included a few other local authorities of different sizes and different sort of geographic places around the country, who wanted to look at how they could make GOV.UK Pay easier to use and make it more sort of widespread within local government. They saw there was an opportunity there, but they wanted to understand you know, why wasn’t it necessarily being used more, how could they check that it was meeting the needs of local government as well as central government and sort of understanding the case for using Pay. So we worked with them January 2019. And it was really, really interesting.\n \nWe travelled round to lots of different local authorities. We watched finance teams and caseworkers sort of doing their jobs, what the tools they were using at the moment. Try to understand what the current payment platforms that they use, what were sort of good things about that, what were the pain points around that, how Pay might be able to address it now with the functionality we had at the time and what things you might need to do to enhance Pay. So again, basing our future roadmap entirely on the feedback that we've got from users, making it much easier to use and thinking about some specific issues for local, for local government as well. And I think it's been really beneficial so we've been able to do some of the changes that we looked at. \n \nSteve Messer: \nYeah, that would be great actually, if everyone could go to our website and look at the roadmap and just let us know if something's not on there or definitely let us know if something's on there and you're excited about it. This kind of feedback is what helps us make Pay and make it work for people.\n \nLaura Stevens: \nAnd now we're going to hear from a local government user from Surrey County Council. \n-------\nDavid Farquharson: \nSo my name's David Farqharson and I work at Surrey County Council and I'm a Developer who works in our integration team, which is a team that is specifically concerned with system integration. And part of that integration is the online payment solution.\n \nLaura Stevens:\nCould you tell me how you came across GOV.UK Pay?\n \nDavid Farquharson:\nYes. So my first exposure to GOV.UK Pay was when we implemented our Blue Badge scheme. And as part of that, there's a payment that has to be made. \n \nWe implemented a government solution as part of the end-to-end system, incorporated the GOV.UK Pay platform for online payments and the GOV.UK Notify for the messages and notifications. So that was my first exposure to it. \n \nAnd as we implemented it, I was quite impressed by what it was offering. And so decided to do an assessment of whether it would be a solution that we could look at for the whole council online payment strategy. \n \nLaura Stevens: \nSo yes, Surrey came across GOV.UK Pay through the Blue Badge. I also wanted to ask about how GOV.UK Pay helped Surrey County Council during coronavirus. On a blog post on the GDS Blog there was a quote from Surrey County Council talking about a service that was set up in one day using GOV.UK Pay. \n \nDavid Farquharson: \nYes. I mean, we had a particular example where we needed to take for COVID-19, we needed to take payments for a crisis fund. So it was a sort of fund set up where people could donate money to help people that were in immediate problems due to the COVID-19 issue. And as a result, we needed to get something up as quick as possible, to start taking that money. And so we used the payment links function that is provided by GOV.UK Pay, which is extremely quick way of getting up a payment page and taking those payments online. So that was the particular one that we were probably talking about. \n \nBut since COVID-19, we've already set up a number of additional live services, some using the payment links and some using more sort of in-depth integration. \n \nLaura Stevens:\nAnd so what features does GOV.UK Pay have that make it helpful to you as somebody working in local government? \n \nDavid Farquharson: \nThe GOV.UK Pay platform underpinned fully by the accessible rest APIs [application programming interfaces], which enable developers and local authorities like ourselves to build custom add-ons and to access data and information from the system and embed it in some of our external applications. And also allows us to do things like journaling for our ledger, by accessing the APIs. And the documentation of support for developers is excellent - it's accessible on the website so if anyone went to your website and looked, there's a documentation section and it's excellent on the APIs and how to use them. In fact, on the whole on the whole admin site and how to integrate it, it's very good for that. And the support both online from the call logging system and telephone supports has also been very good and responsive to our needs. \n \nWe've also actually been in personal discussion with some developers from your team, and they're very willing to speak to us and listen to our requirements. And we've actually, in conjunction with them, requested some additions and amendments that they have actually now developed and put live. \n \nAnother major advantage is how quickly it is to set up a test service on the admin site, it literally takes minutes. You can start, your developers can start carrying out some initial developments and proof of concepts very quickly. So we were able to do that. And it fits in with an agile development approach as well. So you can quickly get something out very quickly, show your, your customers so they immediately get an idea of what it is they're going to be getting. \n \nWe've touched on the payment feature, but again, that's a very nice feature. If you are looking at taking online payments that you don't need to integrate with another system and are fairly simple in their nature, you can set that up literally in a day, you could have something up and have a new URL that you can put out for people to take to make online payments. \n \nWe also found that each service set up, so we at Surrey, we've got 50 plus payment services that take online payments and that's growing all the time as well. So each one of these we call a different service. So they could be completely different things from highways to education to music tuition. So a lot of different services involved. And each of those is set up as a separate service in the GOV.UK Pay admin site. And you can then control the security and the access to those services. If you will use the admin site and using the admin site for your users, you can control the use of security so that they only see the service they're responsible for. And so in the council where we've got a very disparate level of services and of users, that's was very useful to us.\n \nSo, I mean, that's just an example of the advantages. But that’s why we’ve changed our whole strategy, which is to move over to the GOV.UK Pay platform.\n \nLaura Stevens: \nIf GOV.UK Pay didn't exist, how would that have impacted your work at Surrey?\n \nDavid Farquharson:\nWe possibly would have had to have built a similar thing ourselves. \n \nSo it's probably saved us a lot of our own in-house development work, but would also have been specific to Surrey County Council and one of the things we're looking at with this is the hope that this might lead to more of a standardised local government approach as well. We've been in talks to local authorities because then we can share our experiences. We can look for joint improvements rather than working independently and developing separate solutions. And I think there is a benefit in terms of costs going forward for local authorities to do that. \n \nLaura Stevens: \nIf any of our listeners are from local government and want to know a bit more, how would they get in touch with you?\n \nDavid Farquharson: \nIf anyone wanted to follow up on any of the comments I've made or ask us how at Surrey we've approached some of these issues, I'll be more than happy to talk about that. I think the easiest would be to contact me on my work email address, which is david.farquharson, which I better spell F for Freddie a r q u h a r s o n. S for sugar, s o n. At Surreycc.gov.uk [david.farquharson@surreycc.gov.uk] \n \nSo just drop me an email and I'll either get back in the email or I can contact the person that's I’d be more than happy to do it.\n---------\n \nMiriam Raines: \nSurrey have been such good supporters of, of Pay and we've, it's good to hear they were saying we've worked really closely with them: we've done like a couple of really useful research sessions with them. And yes, as you mentioned, we were able to release some changes pretty recently based on feedback that they'd given us. And yeah, that's really, it's just really positive. \n \nLaura Stevens: \nAnd would you say there, where, what David was talking about the sort of experience of GOV.UK Pay - is that typical for a local government user of GOV.UK Pay?\n \nMiriam Raines: \nYeah. So it's actually interesting, we've got some local government users who do sort of split everything out so they've got a different service in Pay for every different type of transaction and then they can really carefully manage the nuances sort of each of those services and who's got access to it - and in some ways that can make sort of, if it works for their process, it can make finance and reconciliation easier. And that was one of the things that we were doing research with Surrey about. \n \nThere are other teams where they just have one service in Pay, and they run absolutely every single thing through it. They've got other ways of handling reconciliation and they like to sort of just, keep, keep it quite simple with their sort of interaction with with Pay. So it will depend on how teams use it.\n \nLaura Stevens: \nI was thinking about how GOV.UK Pay will develop next. So we've talked a lot about the various features since it's launched and there seems like there's been lots of things added and has adapted with different users, different features. So what are you thinking about looking forward in the, in your roadmap? What's, what's on the horizon? \n \nSteve Messer: \nSo there's quite a few things, because the payments industry has changed quite a lot since the internet came along. You know it's not only online payments that have been enabled. Some exciting - if I can say that, regulation, exciting regulation, does it exist? Yes - exciting regulation went through in 2017 I think, which is open banking regulation. And this, what this does is it sort of opens up the way that you can transact with services by using your bank account.\n \nPreviously it would have been like quite expensive to build these kinds of things, but now there is a way for any kind of online service to integrate with an open banking solution and then provide information from your bank account to that service. And also to, to send money as well. So there’s quite exciting opportunities there where for people who don't have access to a card maybe could pay by bank account, which in most scenarios is quicker and might be simpler for them.\n \nI think we also want to be looking at how we can make it cheaper for government services to use GOV.UK Pay. We are pretty competitive and we work with the market rather than against the market, which means that you know services can save a lot of money. But again, there are ways that we can really reduce these transaction costs and make it quicker and easier for service teams to convince their governance to start using Pay. \n \nMiriam Raines: \nAnd sort of related to that, we've also been working very closely with Government Finance Function and Government Shared Services. So we're looking at what their aims and ambitions are for sort of better efficiency or sort of automation in those processes in government. And then we looking at how Pay can sort of support that, how we can be the vehicle to enable them to roll out these new sort of finance standards or data standards and make it easier to have that sort of that same technology used and reused across, across government. So that's really, that's really interesting - and Lisa has been very helpful in that. She's been very involved from Home Office as well. \n \nLaura Stevens: \nAnd I guess out of all those plans, what excites you both the most coming up in the next few months to work on GOV.UK Pay?\n \nSteve Messer: \nI'm quite excited about so, we do offer a Welsh language service for our services. And so if you're a Welsh language speaker, you can go from start to finish with a completely Welsh journey until Pay sends you an email confirming your payment - that's the only bit we haven't done yet. So I'm quite excited to work on that because it means I get to use the people I live with as a test group because they all speak Welsh. It might make the Christmas dinner quite interesting.\n \nMiriam Raines: \nSteve's learning Welsh, so Steve can practice too. \n \nSteve Messer: \nYeah, I can show myself up in how poor I am at my Welsh.\n \nMiriam Raines: \nI think we've been thinking about, I don't know if I'm allowed to get excited about invoicing, but I think I might be excited about invoicing. One of the things that Lisa was talking about in her service was they're using Pay for invoices. And definitely we have teams that are using Pay in that way, they might be using our API integration, more likely they're using that payment links functionality. But there's a lot of ways that we could probably make that better and tailor it a bit more to how people share invoices, receive invoices, want to check the invoices have been paid.\n \nSo I think there's some work there that we can do because that can be quite expensive to handle in government, it can be quite manual, it can be a bit awkward for users: lot of time they might have to make, you know call up and pay over the phone or something. So we're looking at how we could do that. So that's pretty something we might look at in the, in the New Year. \n \nLaura Stevens: \nFab. And if I've been listening and I want to find out more or I want to get in touch with you, how is best to do so? \n \nSteve Messer: \nSo probably go to our website, which is payments.service.gov.uk. There you'll be able to find information on what Pay is, how to get started, our roadmap that shows you what we're working on now, next and things that we're exploring. It also has a page that can allow you to get in touch with us. You can contact the support team or get in touch with us to tell us about anything you're excited about. \n \nLaura Stevens: \nSo yes, thank you both and thank you to all our guests for coming on the podcast today. This is actually my last episode as I'm moving onto a new role in GDS so it's been great to leave on a, such a great product. And you can listen to all the episodes of the Government Digital Service Podcast on Apple Music, Spotify and other major podcast platforms. And the transcripts are available on PodBean. So thank you again both. \n \nMiriam Raines: \nThanks, Laura. \n \nSteve Messer: \nThank you. That was great." ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_25bh92k_1200x628.jpg?s=aeec022fcbc42ea5f2c2658f0953b94a&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-25-govuk-pay/" ]
  }
}
