{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #28: Demystifying GOV.UK PaaS | Government Digital Service Podcast" ],
    "summary" : [ "The GOV.UK Platform as a Service team provides insight into how the service works and how it helps public sector organisations to host digital services.\nThe transcript for the episode follows:\n-------------\n \nVanessa Schneider: \nHello and welcome to the Government Digital Service Podcast. My name is Vanessa Schneider and I am Senior Channels and Community Manager at GDS. Today we will be talking about GOV.UK Platform as a Service. GDS has a reputation for creating best in class digital products and services for government, and GOV.UK Platform as a Service - or GOV.UK PaaS for short - is one of them. \n \nGOV.UK PaaS helps public sector organisations to secure and swiftly host their digital services without worrying about infrastructure. It’s currently used by 131 organisations, runs 1,652 applications and recently celebrated passing its live service assessment, providing a joined-up experience across channels. \n \nJoining me are Clare Barnett and Mark Buckley. Thank you for being here. Would you mind introducing yourselves to the listeners?\n \nClare Barnett: \nYeah. Hi, everyone, I'm Clare. I'm a Senior Researcher on GOV.UK PaaS. And my role involves spending most of my time with users of GOV.UK PaaS, understanding what they need from our platform, understanding how current features work and what we can do to improve them, and also understanding how we might need to develop the product in the future to help meet needs that we're not currently catering for. \n \nVanessa Schneider: \nGreat, thanks, Clare. Mark?\n \nMark Buckley: \nHiya, I'm Mark Buckley, I'm Product Manager on GOV.UK PaaS. And that means that a lot of the user needs and things that Clare identifies and other folks on the team, I help to prioritise in order to iterate and hopefully make that product better. \n \nVanessa Schneider: \nGreat. So both of you mentioned GOV.UK PaaS and I also gave an introduction at the top of the episode but I’m sure [laughs] our listeners would value hearing from an expert what GOV.UK PaaS actually is. \n \nMark Buckley: \nSo GOV.UK Platform as a Service - or as we abbreviate it to PaaS as it's quite the mouthful - is a cloud hosting platform essentially, where service teams around government and public sector can use us to host their applications and digital services in the cloud. So whether that's a service living on GOV.UK like the Teaching Service or a simple informational website such as technical documentation or something like that, they can host their app, those applications on our platform.\n \nThe platform side of it, and is doing this sort of hard work of connecting and running the infrastructure that underpins the World Wide Web. So is akin to the plumbing in a house. So, yeah, we take care of that so the service teams don't have to. \n \nVanessa Schneider: \nGreat, thanks Mark. \n \nClare, as a user researcher, can you tell us why should people use PaaS? Does that come up maybe in your work? \n \nClare Barnett: \nYeah, it absolutely does. And, you know, I'm talking close all the time and I'm always hearing: one of the things that we hear is how we can improve the product. But we're always hearing the good stuff as well and why people use us. And I mean, essentially PaaS is there to help teams avoid unnecessary overheads.\n \nSo it means that they don't have to run the infrastructure themselves and they don't need to have Web Ops capability in-house, which means they can focus their time and budget on running their service. And what we hear from our users is that using GOV.UK PaaS, it means that they can avoid procurement blockers, it's much easier to-to use us than it is other commercial services because they don't have to go through long procurement processes.\n \nWe also offer a great developer experience, which we've spent a lot of time developing and improving over the years. And we're trusted - we hear from a lot of users that the fact that PaaS is developed by the public sector for the public sector is a really good thing for our users. It helps avoid lock-in with expensive suppliers and it feels much more collaborative as well. And overall, we're offering teams much better value for money than, than some of the commercial providers out there.\n \nVanessa Schneider: \nDo you ever have people coming in thinking they know what PaaS is and you've got to clear up a couple of misconceptions? \n \nClare Barnett: \nI mean, I think we have people who maybe think they can use PaaS in a slightly different way to the way that they, they do. But I mean, I would say some of the common misconceptions are that: it's only for developers. And actually that's not true at all. We do have a number of designers using GOV.UK PaaS to host their prototypes. So yes, we-we do have some misconceptions, but we're able to clear those up quite easily. \n \nMark Buckley:\nYeah, I-I suppose more often than not, we get misconceptions the other way, as in they don't know what PaaS is or aren't clear on sort of the benefits or the purpose for us.\n \nA lot of teams we hear from: 'oh, well, it's only for, available for central government. It's made for central government by central government'. But that's not the case. We've done a lot of work over the years in opening up those contracts and focussing on the-the needs of not just central government, but the wider public sector. So we have teams and services from the devolved administrations, Northern Ireland Assembly use like pretty extensively, local authorities use us, NHS use us, College of Policing use us there - so we have representation from right across the public sector.\n \nAnd I suppose another kind of misconception   is that GOV.UK PaaS is only suitable for very simple services, such as, as I mentioned earlier, sort of a static website or something like that. But again, that's not true. We have quite we're a, we're a very flexible and powerful platform actually. And some of the services that folks might know: so the Document Checking Service is running on GOV.UK PaaS and GOV.UK Notify, which is, over, certainly over COVID, has become pretty much the UK's notification platform that also runs on GOV.UK PaaS. So we-we have the kind of full spectrum of services living quite happily and running reliably on GOV.UK PaaS.\n \nVanessa Schneider: \nI imagine that listeners know maybe of the word cloud, cloud hosting - because we do have a sizeable audience in the Digital, Data and Technology space. I'm sure they also know that there's commercial providers in this instance. So what motivated government to create this tool rather than just relying on external providers?\n \nMark Buckley: \nGOV.UK PaaS, yeah, is not the only Platform as a Service offering or cloud hosting offering that is available to public sector. Indeed, there is a somewhat confusing overlap with G-Cloud where you could procure different types of cloud hosting provider potentially. But we as a GOV.UK PaaS is a Platform as a Service which when it comes to cloud hosting and that type of thing, is different from Infrastructure as a Service, which is generally what private sector infrastructure providers would provide. \n \nAnd if services or teams decide to use that, they will have to stitch together and do all of that kind of plumbing themselves because there's sort of more raw materials. And in-in doing that, will have to hire and recruit significant web operations capability. Because we are a platform, we've done all that, built it once with the needs of government at its heart. So to-to fit with the-the kind of M.O. of the rest of the government as a platform products. So GOV.UK Notify, GOV.UK Pay and our ourselves: we built it once so that it can be reused and across the public sector, so that there isn't that same duplication of effort. And cloud infrastructure and hosting is not a simple kind of area and takes a lot of investment. So it's, you know, the, that we've provided or invested a lot in that is beneficial hopefully to other service teams.\n \nVanessa Schneider: \nYeah, definitely build once, use many, it's a favourite phrase in-in our organisation. \n \nRight. So obviously, you are working on the product itself. I was wondering if you maybe in user research, hear about the kind of challenges people have been able to overcome thanks to GOV.UK PaaS or whether you've got a particular case that you'd consider a success story.\n \nClare Barnett: \nYeah. So we-we hear a lot of the time that teams are able to move a lot faster when they are using GOV.UK PaaS. So they're able to deploy faster. Just generally it kind of helps their internal processes. We take away a lot of the work that otherwise they might have to do themselves. \n \nSo some research that we did recently around users evaluating PaaS for use. One user actually said to us: ‘largely all of the effort is offloaded onto ourselves’. So they see the value for money in that the-the service doesn't really feel like very expensive at all. You know we're taking away a lot of the work that-that users would actually have to do in their teams, that's being placed on us.\n \nOn top of that, the support that we offer is really comprehensive. So whereas if a team was using a commercial competitor of ours, they might be paying quite hefty sums to have a support model in place. With GOV.UK PaaS, they get all of that included and they get access to 24/7 support. So it-it really is-it's the speed at which people are able to operate and the fact that they can reduce their team size, they don't have to have web ops capability. And the fact that overall that these things combine to help them save money and get bet-better value for money in the long term.\n \nVanessa Schneider: \nIf someone is curious to find out more, maybe take their own time and to look at information, where can they go?\n \nClare Barnett:\nYeah, so if you'd like to find out more about PaaS and how it works, then you can go to our website, which is cloud.service.gov.uk for more information. If you're already using PaaS, then you can contact our support channel, and again, if you go to cloud.service.gov.uk, you'll see a support thing in the top right hand corner of the page. \n \nVanessa Schneider: \nSo obviously we've heard brilliant things about PaaS now, but don’t just trust us seeing as we are the organisation [laughs] that developed GOV.UK PaaS. We’ve actually chatted with some tenants. So first off we will be hearing from Himal Mandalia. \n \n[VOX POP STARTS]\nHimal Mandalia: \nHi I'm Himal. So I've joined GDS recently as Head of Technology for GOV.UK. I've been working around government digital for about the last 6 years. Working at the Ministry of Justice Digital and the Department of Education.\n \nSo I've just joined about a month ago, but over the last few months since last year, there's been some experimentation running, some trials around GOV.UK Accounts.\n \nAs part of the trial, the first step was to-to offer an account along with the Brexit Transition Checker. So as a user, as a citizen, you-you go through a journey, you get to some answers that you might want, but then you may want personalised notifications when some of that content changes and you may want a return journey, you may want to come back and, and see, see what you selected previously.\n \nNow, that's not being hosted along with the sort of main GOV.UK stack. GOV.UK is quite a large, complex service made up of many, many applications which are hosted on an infrastructure platform that's fairly manually set up and we are shifting over to something that will meet our evolving and quite sophisticated needs.\n \nBut for the experiment particularly the-the Accounts prototype - GOV.UK PaaS was the obvious thing to use for that. You know, just get it in there. You can deploy to it easily. You can tear it down. You can spin up additional things. And, you know, in my role as Head of Technology, I'm quite comfortable with advocating PaaS for any additional things like that. And as we, as we, as we go about re-platforming a lot of those components for GOV.UK, I definitely want to keep PaaS on the table as an option for some of those services that are very modular, that can just be, be stood up and, and then run very easily. \n \nVanessa Schneider: \nDo you mind sharing what you think the advantage is of hosting on GOV.UK PaaS versus other solutions?\n \nHimal Mandalia: \nWhat things don't you want to have to worry about? What things are just, you know, what's termed the undifferentiated heavy lifting. It's really the same for many of these use cases, and you just want it to happen magically. You don't want to have to think about it. You don't want anyone doing it. And a lot of that is that that site reliability engineering, the the infrastructure engineering required to create the environment in which your application lives. And you and this is where, this is where PaaS comes in because that's all set up for you. A developer can just issue a few commands and create an environment, and launch the app. \n \nI was describing this to some non-technical stakeholders and leadership in DfE a year or 2 ago, there was some confusion around, you know, why would we want PaaS when we have a cloud platform already? And I said, well, it's like having access to a-a really, really high quality construction site. So you've got your space to-to build your roads and your houses and you've got these amazing construction tools, but you need a level of specialism. You need actual-actual architects. You need people that can lay, can lay the electricity, wires under the road. You need to do a lot of stuff to build a few houses, but you have complete control in how you set, in how you set that up.\n \nPaaS is much more like moving into a, moving, moving into a flat that's just ready, and all you need to do is worry about the furnishings, what you're going to put in there. And that was a very sort of loose sort of metaphor that I kept sort of pushing the boundaries on, and it broke a few times. But it's, it's, it's pretty much that: it's that, it's that thing, your application just needs somewhere to live. You just want to take care of that furnishing layer of it, not have to worry about the wiring up the walls for any electrics. \n \nYou know, organisationally you need a range of options. You do need the very low level infrastructure offering for-for the things that are very differentiated. And you need to have a very customised infrastructure build. But you also need those things that remove all of that heavy lifting and just let teams put apps out there.\n \nAnd I think I've encountered in some places a very one dimensional view of what cloud means. It's, it's, it's basically a case of a one size fits all solutions, which is, which is not really the nuanced view that's needed. A nuanced view is ensuring you have the capabilities across the spectrum to handle all of your use cases. And some will be very IaaS - Infrastructure as a Service. But PaaS should definitely be there. And I think the, I think, I think the zenith of something like that is fully self-serve PaaS, which is, which is where we are with GOV.UK PaaS. It's, it's, it's great. And we just need to keep iterating it, improving it.\n \n[VOX POP ENDS]\n \nVanessa Schneider: \nI was wondering if anything particular stuck out to you or maybe we can discuss what it is about people working with PaaS that you all go to building and construction metaphors [laughs]?\n \nMark Buckley: \nYeah, well, thanks to Himal for speaking so eloquently and positively about GOV.UK PaaS.\n \nA couple of things sort of jumped out at me that it'd be really good to sort of reiterate. And one of those is: Himal mentioning it's not a, there's not a, it's, it's not a one-dimensional, one-size-fits-all when it comes to PaaS. There's absolutely no reason why services and departments can't use things in addition to PaaS, or as well as PaaS.\n \nSo Himal mentioned where there are those really sort of complex or specialised differentiated services. Then absolutely GOV.UK PaaS probably isn't the platform for-for them. But there are also vast swathes of services and applications across government that are quite typical, sort of 3-tier applications as they're kind of known in development terms. So there might be a presentation layer and a data layer and application layer all mixing together. They work really well on GOV.UK Paas, and that essentially is probably the majority of the services that run on GOV.UK, for instance, or not on GOV.UK but are part of that.\n \nSo if you're searching for a teacher vacancy as kind of said before or looking for your energy performance certificate at MHCLG [Ministry of Housing, Communities and Local Government], these are all services that run really well on GOV.UK PaaS and take that stress or drama away from Developers and Web Ops Engineers so they can concentrate on other things.\n \nClare Barnett: \nI was just going to add to that - that's something that kind of stood out for me was when Himal talked about wanting to use GOV.UK PaaS for other applications that they're looking to standup on GOV.UK as well. Because we hear that from a lot of users of the platform that once they've used it once, quite often they become advocates for GOV.UK PaaS.\n \nYou know they are selling it within their own organisations and wanting to use GOV.UK PaaS for as many things as they can and as many services suitable for. And basically end up with a really strong community of users who are really good at sharing with each other and, and, and sharing the patterns that they use and the way that they do things with, with other users to help them understand how they might be able to use the platform for their specific needs, which is, which is really great. And yeah, and it's nice for us to know that, you know, once someone used us once, actually they want to use us again. \n \nVanessa Schneider: \nYeah, I'm, I'm really enjoying hearing all the positive news about it, and it must be really nice to have that sort of unintended consequence of people becoming these evangelists essentially and also supporting each other when it comes to the use of it.\n \nSo next we’ll be hearing from Colin Saliceti and his experience using GOV.UK PaaS at Department for Education. \n \n[VOX POP STARTS]\n \nColin Saliceti: \nHi, my name is Colin Saliceti and I work for the Department for Education in the Teacher Services area. Teacher Services is a big area in the Department of Education [DfE], and our goal is to get excellent teachers for every child. My job title is actually Lead Infrastructure Engineer and me and my colleague, we take care of the cloud infrastructure for all the services that are developed in Teacher Services. \n \nVanessa Schneider: \nSo Colin, thanks for introducing yourself. You work in Teacher Services, I was wondering, how does that relate to PaaS? \n \nColin Saliceti: \nIn Teacher Services, we create and develop a number of services for, mainly for teachers and their careers. So we have a number of service teams which do a lot of development. So we need to provide them with the best tools to deploy their services and make it available for the, the public. And PaaS is a very good tool for that. We have different options. But we have experimented with one service which was teaching vacancies earlier, and this proved a massive success. And then next, we expanded to more and more services. \n \nFor example, Get Into Teaching, which is our main information website for teachers. That's where they can get information about the career, they can get in touch with an advisor, they can subscribe to events, and they can actually start the process to get them to-to become a teacher.\n \nAnd it ties well with another service that's also on PaaS, called Find Teacher Training. So the future candidates can find a-a teacher training. So this is a very important website that the providers of training all across England advertise their courses and the candidates can apply for them through the website.\n \nAnd we also have another one, which is Register Trainee Teacher - which is also on PaaS; it's not live yet, but it's almost there - where we can actually track all the, the trainees and see at which stage they are in-in their training and follow them in the beginning of their career. So there's quite a number of different services and it's just growing.  \n \nVanessa Schneider: \nSo our next question is what the advantage is of hosting on PaaS versus other solutions, would you mind explaining what the benefit of it is? \n \nColin Saliceti: \nThe first thing is because it's easy compared to different platforms. \n \nIt's not easy because it's simple. It's easy because t-the platform packages a lot of features, but the way to use it, the interface to use it is, it's-it's quite easy for us. So we don't actually need a highly skilled specialist, at least in the beginning, to get on board with PaaS. So a Service Team with developers, they can manage themselves to deploy to-to PaaS without any assistance, at least in the first stages.\n \nIt's very important that it's a very flexible platform. And we can deploy the production website, but we can deploy many test websites if we need to, and we can deploy a new one for, to test something in particular, and then we can destroy it because we don't need it again and we don't need to pay for it again. So that, this flexibility is very important. And it also makes it very cost effective because we only pay for what we use and when we don't need it, we can scale down or just delete it.  \n \nVanessa Schneider: \nI was wondering if you have a user story that relates to the service that shows why it was a good idea to go with PaaS. \n \nColin Saliceti: \nI got a very good example in the, actually, in the other part of the department.\n \nAfter Teaching Vacancies, which was the-the first, it became obvious that PaaS was a good choice and some of other teams adopted it as well in, in DfE. So you may have heard of the laptops that we delivered to all the schools and for the disadvantaged kids who, to help them do the homeschooling. And so this was done thanks to a programme called Get Help with Tech. This was built very quickly and it was built on PaaS from day one. And PaaS proved that there was very important because we were able to build very quickly and iterate very quickly until we got the service right and we're able to deliver to all the schools in England. \n \nVanessa Schneider: \nSo I was wondering if I was a member of a different government department or a different team, how would you convince me to use GOV.UK PaaS?\n \nColin Saliceti: \nFirst of all, the reasons I already explained: that it's easy to use and the, the learning curve is very easy. This flexibility is amazing as well, and that's really cost effective.\n \nIt's also very important that it's provided by government, it's not a separate commercial platform, it is actually provided by GDS. So all the security assurance has already been done and it's assured up to different levels of confidentiality. So you don't actually, in your department, you don't actually need to do that work again because it was already done by GDS.\n \nAnd another thing is that because it's supported by GDS and we have an amazing relationship with them and we get an excellent support for them, from them, from the people who build and actually run the platform, and we have direct contact with them. And they're also here 24/7 in case of an issue. Which, so it's a great experience to run things on PaaS. \n \n[VOX POP ENDS]\n \nVanessa Schneider: \nSo that was Colin. I also want to hasten to add, he was very concerned with appearing impartial because he did work at GDS previously on PaaS. Just wanted to make sure that he was completely representing DfE only.\n \nMark Buckley: \nAnd that's the impartial version? Well, that's, that's good to hear. [chair squeaks]\n \nVanessa Schneider: \nI think your chair just laughed.\n \nMark Buckley: \nYeah, potentially. \n \nNo, we've been working with DfE and Colin for, for a long time, but it's, it's great that Colin is still enjoying the benefits of our platform.\n \nVanessa Schneider: \nAnything stand out otherwise? I was wondering, he mentioned, for instance, the really good support that you provide and I think, Clare, you mentioned that as well, coming out in your user research interviews. \n \nClare Barnett: \nYeah, that comes up a-alot when we talk to our users, because it's part of what makes PaaS so cost-effective for people, but it's also it-it means that people feel reassured that they're going to get the help and support. They get you know, responses. There's a really quick turnaround time for, for responses.\n \nAnd we offer it not just through our support platform, called Zendesk, but we'll say through Slack. So there-there's multiple channels that people can use to get that support. And they will always be speaking to somebody from the team, as Colin said, who is well-versed in the platform, very experienced. And often the team will pair on them if they're trying to troubleshoot or problem-solve something and-and often help them fix problems that are not actually a PaaS problem. It might be that there's a problem with their, their code their end and quite often the PaaS team help identify that. So there's a lot of added value in that support package for our users.\n \nVanessa Schneider: \nThat seems to chime a lot as well with what Colin is talking about in terms of it being a really good test environment, in terms of being able to try things out, see if they work or not. Is that a common kind of use case across government?\n \nMark Buckley: \nYeah it's, but...we-we support services and applications running from everything from discoveries and alphas. As Colin was kind of mentioning, sort quick prototypes to check the viability. As Clare mentioned earlier, designers using it to test out and iterate sort of content and things like that. So you've got that at, at the start of the journey, but also all the way up to running mature products and services that teams do iterate on and improve those as well after going live, as it were.\n \nIt’s, in a sort of roundabout, roundabout way both Colin and Himal mentioned that things like Infrastructure as a Service, IaaS, and requiring real expertise and specialists. And quite often in government and early on in those services when they're getting up and running, will rely on suppliers and external parties to come in, maybe contractors, to come in and build things. And if they're built with incredibly specialist skills, then that becomes really difficult to maintain in the long term when the build team might have moved on to other projects for instance.\n \nHaving a platform like GOV.UK PaaS enables services to only need to recruit and employ Developers that they need and not the additional specialists and some, that kind of thing so that they can quickly iterate and test things out and not be at risk of not being able to support what they're doing over the long term. So, yeah, it's, what Colin said kind of brings a tear to the eye, right, in terms of being able to quickly build those things on a supported platform that can then enable support to folks in lockdown that really need help with education and homeschool. \n \nVanessa Schneider: \nWe always love it when our services have that direct impact, I think it's a lot more relatable to people to say I've got my kid a refurbished laptop, rather than saying that now you can get your document checked, because obviously Document Checking Service is much more a business-to-business kind of environment, isn't it?\n \nSo we've heard from some of the people who are using GOV.UK PaaS about why they like it, and about how your team develops it, but I think it's time now to share some GOV.UK PaaS fast facts with our listeners. As a starter for 10, can you tell me whether there's maybe a record for how fast a service was stood up via GOV.UK PaaS?\n \nMark Buckley: \nYou know, even though we are, from a development point of view, you can do a cf push and your application is running in minutes, in terms of actual real life bonafide services, the Shielded Vulnerable People Service as part of the support for people shielding and to get them support during coronavirus, the, there was a first kind of pull request on that service at 4pm on a Thursday, and the service itself went live when the Prime Minister a-announced it on, on the Monday.\n \nSo you know, within the space of 4 days, you've got something stood up and running on PaaS that, and the first care packages, or support packages, delivered to people within a week kind of thing. Which, yeah, at-at the beginning when, you know it seems like a long time ago now, was this was almost, almost almost a year ago, it was like indispensable to have GOV.UK PaaS and the other common platforms as well, GOV.UK Notify and GOV.UK Pay as ways to very quickly, cheaply and easily stand up new services. So 4 days to support the Vulnerable People Service was a really nice thing to do. I don't know if it's a record, but it's a good, good story.\n \nVanessa Schneider:\nIf you want to hear more about how this service was stood up, you can listen to our February episode of the podcast. \n \nClearly GOV.UK PaaS has had an important part to play in the UK government response to coronavirus but what other services do you host that you think listeners might be surprised by? \n \nMark Buckley: \nIt's not only GOV.UK designed system services and things like that, as, as mentioned, NHS, local authorities, various kinds of things are hosted. I think the probably most unusual service that is hosted on GOV.UK PaaS is called Cosmic Bazaar - and not bizarre as in unusual, although it is unusual, Bazaar as is in markets or souk [laughs] I suppose - which is a forecasting platform for economists to hone their, yeah forecasting and evaluation skills as part of the Cabinet Office. So that was an unusual one to be posed with. \n \nVanessa Schneider: \nClare, I'm thinking that across all of these various services that are being set up on PaaS, the user research element of it is probably still going to remain consistent even as the applications vary across the 'bazaar' to the mundane. Is that right?\n \nClare Barnett: \nYeah, absolutely. I mean, yes, we have a really wide variety of services, but within that we have a kind of core set of different types of users - they fit into you know, a certain user type that we see. Which means that we can build the product around those user types rather than building and designing the product around very kind of specific niche services. \n \nVanessa Schneider: \nSo my final question is just about whether you've known about any other governments taking advantage of our research here. For instance Notify, we've been quite grateful and flattered where the Australian government, the Canadian government, the Department for Veteran Affairs in America, they've used the GitHub basically forked it and made their own variations of it. I was wondering, have you heard about that being the case maybe for PaaS?\n \nMark Buckley: \nWe actually have a bit of a kind of community ourselves with other, other 'PaaS's' from around the world. So our PaaS, GOV.UK PaaS, is built upon a technology called Cloud Foundry, which is the abstraction layer I suppose away from the raw infrastructure that Colin and others have talked about. And as well as ourselves, also the Australian government and the American government, Cloud.Gov, use Cloud Foundry as well. So there's been quite a lot of sharing between our teams. So 18F was the kind of equivalent of GDS in America. We have quite frequent contact with them. We have shared our repos, we've used some of their repos. So yeah, that's a lovely global community of Cloud Foundry and PaaS users.\n \nVanessa Schneider: \nThat’s so great. Like I know we do a lot of international work but it’s, it’s really quite heartening to see that what, you know that we’re collaborating internationally in something that’s so important. What a lovely note to end on right?\n \nSo yeah, thank you so much to all of our guests for coming on today. You can listen to all the episodes of the Government Digital Service Podcast on Apple Music, Spotify and all other major podcast platforms. The transcripts are available on PodBean. \n \nGoodbye. \n \nMark Buckley: \nBye. \n \nClare Barnett: \nBye." ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_288o4ay_1200x628.jpg?s=d9b37e3fd2e103b57203edaad7314f71&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-28-demystifying-govuk-paas/" ]
  }
}
