{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #30: Tom Read talks GDS’s future strategy | Government Digital Service Podcast" ],
    "summary" : [ "Tom Read, CEO of GDS, sits down to chat about his first few months and what’s next, taking us through the GDS strategy for 2021 to 2024.\nDo you enjoy the GDS Podcast? Help us to make it even better by completing our short, anonymous survey.\nThe transcript for the episode follows:\n-------------\n \nVanessa Schneider: \nHello and welcome to the Government Digital Service podcast. My name is Vanessa Schneider and I am Senior Channels and Community Manager at GDS. Today I'm joined by the Chief Executive Officer for GDS, and that's Tom Read. \n \nTom, thank you so much for taking the time to be here today. I know that you joined GDS back in February, which in these times feels like an eternity. But could you please introduce yourself and what do you do to our listeners? \n \nTom Read: \nSure. And thank you for having me. So I'm Tom. I'm the Director General and Chief Executive of the Government Digital Service. As you said, I've been here just over 3 months now. So effectively my job is to set the strategy for the Government Digital Service, work out how it aligns with ministerial priorities, how much money we've got, what we're currently working on, and then keep out of people's way as much as possible and let people get on with delivery. That's sort of what I'm here for, I think. \n \nVanessa Schneider: \nOK, I hear it's not your first rodeo at GDS: do you mind sharing how this experience is different? \n \nTom Read: \nYeah. So I was, I was at GDS from for about 2 years in 2013 to 2015. Back then, I mean, everything was quite different. I worked in Liam Maxwell's area, which was the sort of, the more, the tech area than the digital area, and I was brought in to run a technology transformation programme in the Cabinet Office itself, plus DCMS [Department for Digital, Culture, Media and Sport]. It was great fun, really good fun. \n \nHow is it different? I don't know. It's... GDS back then was was smaller, much more sort of a scrappy start-up. It had this sort of triumvirate of real heavy hitters in Mike Bracken and Liam Maxwell and the Minister, Francis Maude, now Lord Maude. And so it had a really, it sort of felt very much on the bleeding edge and it was very much going out and trying to push down some doors to get people to-to let it exist and let it really make a difference. I think a lot of that spirit is still, still here in GDS. But there's a little thing I've written in-in our new strategy, which is we're not in start-up mode anymore. And I think that's it's quite important to recognise, we-we've, we've done that phase and now we're sort of maturing a little bit. So it's slightly different. But the spirit is the same. \n \nSo after 2015, I basically I did 2 years of just like super intense work, like it was just, you know, really, really fun. So much fun but incredibly tiring. And I basically sort of said, right, that's, that's it. That's my little tour of duty in government done. And I-I went off and joined a consultancy and about 3 months in working for the consultancy, which was a lovely place, really lovely place, great people. I suddenly thought, ‘ack, I'm not done, actually. I-I-I really miss government already’. \n \nSo later that year I applied for a few roles and I was successful in a role as the Chief Technology Officer at the Department for Business, as was. And I'd worked there with amazing people like Emma Stace, Mark O'Neill and other people, it was just - Andrew Greenway - it was, it was a really great team. And we really started to create a digital movement in that weird department because it's like a small policy department with loads of arm's length bodies. And it was good fun and we really got going. \n \nAnd then there was the machinery of government change. So energy and climate change came in, education went out so universities and things went out to education. And I don't know if any of our listeners have been through machinery of government changes, they're like mergers acquisitions in the private sector. I kind of saw the writing on the wall. I thought that there isn't space for, for 3 directors in what was to become BEIS [Department for Business, Energy & Industrial Strategy]. \n \nAnd so I started to look around government and it happened. There was a vacancy coming up at the Ministry of Justice [MoJ] working for Sir Richard Heaton, who I worked to when I was at GDS, he was the Perm Sec[retary] of the Cabinet Office and one of my all time sort of heroes in government. And so I was sort of managed moved across to MoJ. And that's where I've been for the last 4 and a half years. Up until now, by a long way, the best job I've ever had in my career. It was just this incredible, meaningful work of helping some of the most vulnerable people in society to fix their lives and get an education and get their lives back on track. It was brilliant. So yeah, I've been, I've been in a few departments. \n \nVanessa Schneider: \nWell, they tend to say, don't meet your heroes, but it seems to have worked out really well for you. I also wanted to give a shout out to Emma Stace because the Department for Education Digital and Technology team has just launched their first podcast episode with Emma in it. \n \nTom Read: \nOh, awesome. Oh, well, fantastic. Well, listen to that one. She'll be amazing. \n \nVanessa Schneider: \n[laughs] But also listen to us!\n \nTom Read: \nObviously listen to us!\n \nVanessa Schneider: \nSo it's clear to me, just listening to you that you're passionate about digital government, always coming back to it as well and looking at your resume in general. But I was wondering why that was. What is the power of digital? \n \nTom Read: \nWhat is the power of digital? That's a really good question. So the thing that's unique about digital teams in government, but also outside government, is we just have a relentless focus on users and how they work. And I know a lot of bits of government do that as well - it would be a bit insulting to policymakers to suggest we're the only people who do that. \n \nBut any bit of digital design, whether you're working for a supermarket or a retailer or a bank or government, you have to design around how users use things because otherwise they don't use them. And then you're wasting everyone's time, right? In government, I think we've used digital, now more the word data, user needs, these sort of things, kind of as stalking horses, they're, they're ways of expressing designing things around how users work. And I just think that's a great opportunity. \n \nI also think government itself is fascinating because some some bits of government have been around for hundreds of years and some bits have been around for a thousand years. And without being simplistic, some of the processes haven't changed very much in that time. And so you can stick a website over it. But really, you need to look at the whole, you know, policy through to what outcomes you're trying to get, the process, and then digitise that. And I think that's really missing from how we talk about digital in a lot of cases. \n \nVanessa Schneider: \nSo, you mentioned obviously that you've been here for 3 months and some people make a big deal out of it - the first 100 days somebody has spent in a new job, especially in a leadership position. Is there anything that you're keen to share that you've learnt in this time, or maybe you found something that surprised you? \n \nTom Read: \nYeah, I mean, just so much. It's quite weird hearing it's been 3 months actually, because, in the nicest possible way, it feels like a lot longer. And I do mean that in a positive way. I've learnt a lot. There's, there's a lot. GDS is a funny place because everybody's got an opinion about GDS just anywhere in government. And beyond actually, everyone's got an opinion about what's good, what's bad. There's a whole set of people on Twitter who seem to spend most of their lives just commenting on what on what GDS is doing. And it's really peculiar. And so coming in, or sort of back in, but, but into this role from a department has been fascinating. \n \nSo it's sort of off the top of my head, a few things I've I've learnt. One is I think the, GDS is just completely full of, like, super intelligent, incredibly civic-minded people who care. And I think, yeah, I don't want to go on a soapbox rant about this, but that's probably the thing that people really miss when they're judging GDS, is just how much people care about, you know, service design and, you know, the underlying technology and content design, accessibility, all these things that really matter. It just, it really infuses everything when you're speaking to people. And there are people who have been here for like 7 or 10 years who just still have the same absolute passion for improving public services, which is amazing. I mean, I've got a short attention span, so a lot of respect for those sort of people. \n \nOn the, on the, sort of, the more complex side. I think, the first, we still sort of hark back quite a bit to sort of the first 5 years of, of GDS, which I don't think is uncommon in a sort of quote unquote start-up. You hark back to the early days - I was speaking to a friend who works at Monzo recently. And he was saying everyone still talks about when there were 30 of us and we were trying to build from scratch. We're not like that anymore. So I think, I think a lot of people still look back at where we had all this support and we were crashing down doors and building things. And it was busy and we were on stage a lot. And then there were 5 years of much quieter GDS over the last 5 years - still doing very important work, but taking much more of a collegiate view. And I think one of the things I've been puzzling through over the last 3 months is how do you get the happy balance between those 2? I think maybe we need to get back a little bit into the setting direction and pushing delivery as well as working together. \n \nVanessa Schneider: \nYeah I mean, I think one of the things that people remember when they hearken back to those good old days is also the mottos that sprung up. There's a lot of stuff that we say at GDS that has spread beyond, that's really been used a lot. For instance, doing the hard work to make it easy for the user. So obviously our ambition is to make dealing with government easier. Where do you think we are in this mission? \n \nTom Read: \nThat's not what I thought you were going to ask me. So I think we're at a really interesting point. So thing, things that have been done well over the last 10 years, we talk a lot about the really good services. There are lots of services in government that are better than you would find in the private sector. And I think that the narrative that government's never going to be quite as good as the private sector: I've worked in the private sector. It's just not true. \n \nWe're all roughly trying hard, dealing with legacy, dealing with complexity, competing demands, that kind of thing. So there are a bunch of things that have been done just incredibly well. So, you know, the passport service is just an exemplar. There are amazing things in digital tax. There's stuff we were doing at MoJ, there's there's stuff at DWP [Department for Work and Pensions], which is really, you know, pushing the boundary and properly, you know, micro-services, architectured services that will last and stand the test of time. \n \nEqually, I think I think we just declared victory way too early. So it's one of the first things I was sent when I joined GDS was, I was like, we've got a list of the the paper forms in government, you know, the, the services that have never been touched. And I was sent a spreadsheet with with 4,000 lines, and each line is a PDF or a Word doc, that a user has to download, fill in, so they need a printer, then they can fax or post it. So you either need a fax machine - I genuinely don't know how that, how that technology works in the digital age - or you go to the Post Office and I think it's just not good enough. \n \nSo I think from that perspective, we've done a lot. We've embedded amazing digital talent across government. GOV.UK is standing firm and is still a really excellent sort of front end of government. But we've got a lot more to do. And I also think we're slightly, we have still been thinking in the context of 10 years ago, where it was a publishing layer and then individual silo transactions, I think we need to move beyond that now. We'll probably talk about that a bit more later. But I think we need to move beyond what was a good idea 10 years ago and iterate - use some of our, use some of our own secret sauce for that. \n \nVanessa Schneider: \nI am so curious. Where did you think I was going to go with that question? [laughs]\n \nTom Read: \nI thought you were going to ask me about some of the mottos [laugh from Vanessa] and whether they still stand up. So, you know, ‘the strategy is delivery’ and you've got on your laptop ‘Make things open. It makes things better.’ In fact, I've got it on mine as well. I-I thought you were going to ask about some of those things. \n \nVanessa Schneider: \nDo, I mean, if you want to riff on that, go for it. [laughs] [laugh from Tom]\n \nTom Read: \nThere is a lot to be said for the, the memory that goes with catchy, meaningful slogans like ‘strategy is delivery’. It's great because the strategy was never delivery. Right. The strategy was deliver something quickly and make it so good that once people come to tell you stop doing it, they'll look like idiots because you built something brilliant, fast and cheap. It's not-- the delivery isn't the strategy. Strategy is let's not talk about it. Let's let's deliver something and then we'll have something to show for it, which is great and similar with, you know, the talk about user needs, not government needs. It's still government needs. It's just if you build it around how users work, then the service is cheaper and it'll actually be used online. It's it's sort of proxies for for what we're trying to do. Big fan of that sort of proper marketing. \n \nVanessa Schneider: \nSo I was wondering if you wanted to reflect on the mission of GDS now and for the next 3 years in context of the 5 points that you outlined in your blog post? \n \nTom Read: \nYeah, absolutely. So the first thing we're trying to do is we need to kind of say, what are we really going to focus on? Because it's, I don't just want a shopping list of what we're busy with. It's like what can we uniquely do in GDS? We've got this, like, incredibly privileged position of being in a centre of government. We're reasonably funded at the moment. Good ministerial support. What are we uniquely able to do in that position? Let's let's leave the departments to do, to do what they do. \n \nSo we've we've we've come up with with 5 points, as you say, and I'll sort of rattle through them, but sort of explain why I think they matter. So the first and kind of most important one is we have to keep the things that we're already running running. So we, GOV.UK is a obviously fundamental part of what we do. We need it up to date, we need the publishing tools to be modern. We need to be iterating some of the design patterns around finding content, around exploring, sort of navigating content. And we need to re-platform it. It sits on a tech stack in the cloud. But but that's coming out of support. So so keeping things running, it's not always sexy, but it is the most important - if we do nothing else we'll keep GOV.UK running. \n \nThe second thing we really want to go to is, focus on is, is kind of what I meant earlier around moving the dial from just doing transactional services. So we want to focus on what we're calling whole, whole services or solving whole problems for users. So an example. And we're not sure which examples we're going to use, right. But an example that that we're looking at at the moment is around having a baby. \n \nSo if you if you are a person and you're having a baby, I've made a list here. Things you might need to know about, that government can help you with are: maternity pay, shared leave, maternity allowances, registering the birth, getting child benefits, getting tax credits, finding childminders, getting nursery places. And at the moment, you need to understand all of those things individually. Then you need to apply for each to work out whether you are eligible. It's, well, well-intentioned nonsense. And really what you should be able to do is what you would expect in a commercial transaction where you would go on, you would have your details already stored and it would say you are eligible for these 5 things. One click and we'll sort it out for you. \n \nAnd I think that's, maybe that's pie in the sky, there's so many reasons why that might not work. But that's what we're going to aim for. So so we're going to go hopefully for, as I said, really early days. And a lot of people have thought about this before. We are not unique in this, but we're going to look at maybe 5 or 10 ideas and try to push them through to delivery and work out: does GDPR stop us doing this, does money stop us doing this? Does the fundamental structure of government and accounting officers accountable to Parliament stop us doing this? I don't know, but we’re gonna have a good crack at it. \n \nVanessa Schneider: \nI think I saw on social media, because that's part of my role as well behind the scenes, that there has been work on that previously by the government, I think it was in the days of Directgov and Business Link, that life services was actually already a concept. So will it be resurfacing that kind of work? Are you going to look back at the old material and see what learnings you've made since? \n \nTom Read: \nProbably, yeah. So Jerry Fishenden, formerly of this parish, blogged about tweeted about it. I think it was before Directgov actually, that that that screenshot. So that was kind of based around life events. So having a baby is one. I think, I think some of them aren't life events. Some of them are whole, just just whole problems, like going abroad isn't really a life event. But you do need to think about what - particularly now - you need to think about passports, COVID[-19], political unrest. You need travel insurance. You need, yeah, vaccinations, you need visas. You know, that's not real life experience. It's more a collection of whole problems to solve one thing, which is the person wants to go abroad and needs government help. So we'll definitely look back on on on on that thinking. There's very little new under the sun. But equally, we haven't done it yet. So we need to, we need to press on and deliver. \n \nVanessa Schneider: \nNo it's that agile principle of iteration, isn't it? \n \nTom Read: \nRight, exactly. [laugh from Vanessa]\n \nVanessa Schneider: \nAll right. You've obviously mentioned that we're looking at areas that maybe aren't being captured by government departments and also haven't had that attention previously. So I was wondering if there are still opportunities for us to learn from other departments in that area. I know, obviously, like the thing that you were mentioning with the forms, those are sort of those low-usage services, is that right? Will we be leaning on government departments that own those services a little bit or will it be solely in our purview? \n \nTom Read: \nIt's a really good question, we cannot do, there are bits that we can do ourselves from the centre, but they are quite limited. I talk to, I keep talking about the getting the balance right between centralisation and working with government departments, things like the long tail of digital forms in government. That's something we can't force people to do. The, we kind of have a two-part strategy here. \n \nSo you'll be aware that there's a new bit of Cabinet Office called the Central Digital and Data Office. And basically that's set up to take the the strategy, policy, capability, those sorts of bits, and also the spend controls and like the mandate. And so they will be looking at which departments, which agencies, which bits of government still have a lot to do. And flagging that, being, you know, I don't know, a scorecard or something, but some way of measuring progress. \n \nWe're ‘good cop’ in GDS. So our job is to build platforms, continue the work of government, so platforms, so Pay, Notify, we're going to build a way of submitting information in forms. And there may be 3 or 4 others that we're looking at. And the idea is if departments haven't digitised their simple lower transaction services, we'll give them everything that they need to do that, and we'll give them some help if they need some help to do it, and kind of slowly remove all the possible reasons why you wouldn't digitally transform. So we're the, we want to be the oil, the enablers to to help the long tails transform across central government primarily, but but also local government. \n \nVanessa Schneider: \nAnd if you're interested in any of those products that Tom mentioned, we have a couple of podcast episodes that could be of interest [laughs]. So is there any chance that you can share more about what's happening at GDS right now with that focus?\n \nTom Read: \nSo we're in planning stages, is what I'd say. So we've got some some platforms that are really quite mature now, so GOV.UK Notify, I don't have the data with me, but GOV.UK Notify has an awful lot of organisations using it. We're going live with the alert cell broadcast system. And other platforms we're in planning stages. It's really looking at what are the barriers to adoption. And then we're also going to spin up a team to look at what are the next 5, what are the next 5 things that should be done centrally, may have already be done in 5 departments. So can we bring those together and package it and offer it back as a service, or do we have a federated approach to the platforms? We need to look at those different options over the next 3 months. \n \nVanessa Schneider: \nYeah, just to add in, it's been 2.9 billion messages sent since May 2016 when Notify started up. So honestly, hats off. \n \nTom Read: \nIt's cool. \n \nVanessa Schneider: \nAnd a shout out to Pete Herlihy. I hope he's enjoying New Zealand. [laughs]\n \nTom Read: \nI'm sure he is. \n \nVanessa Schneider: \nYeah. So I was also wondering, I think there might be some work on single sign-on and personalisation. I was just wondering if you wanted to give a sneak preview on those?\n \nTom Read: \nYeah, sure. So a single sign-on for government and a way of verifying your identity. So fundamental parts of our strategy for the next few years. We've got money this year. We've got a lot of political support for this. The, some of the most brilliant people I've ever worked with anywhere, worked on Verify over the last sort of 6 or 7 years, genuinely, just utterly brilliant technologists, designers and that sort of thing. And, and Verify worked, right. It's branded as like, that didn't work. It worked for millions and millions of people. \n \nEqually, there are some design patterns that that that that haven't quite worked. It didn't work for for certain sets of users in government. And we are now in a position where we take all of that learning and we're going to effectively build a new set of services that allow, as I said, a single sign-on for any services that need them across government and a way of proving your identity to government regardless of your social situation. \n \nI'm really excited about this. I'm genuinely excited about this for a couple of reasons. One is we've got all that learning from Verify that we can pick up on. Secondly, a load of governments around the world have done this now, they've they've they've gone out and built on what we did and they've built their own. Thirdly, we've got proper buy-in from across government, real buy-in from ministers and senior officials in DWP, HMRC [HM Revenue and Customs], Home Office. Everyone's kind of on board for this. They know this is needed and our new sort of, very sort of collaborative approach that we're taking is-is hopefully going to bear fruit.\n \nVanessa Schneider: \nIt's great to have those big hitters on board. Those are the services where users will find themselves logging in, in order to access the information that is specific to them, which I think brings us quite neatly onto personalisation, no? \n \nTom Read: \nSure. Yeah. You'll probably be getting the feel for this, that a lot of what we're talking about is interdependent. These aren't completely sort of separate silos of delivery. \n \nVanessa Schneider: \nThen what is in government, right? \n \nTom Read: \nWell, exactly. So the way to imagine this, we're not simply building a portal, that's first thing to say. I know that’s sort of a bogey word in government and or digital design in general. GOV.UK for a lot of people is just there to get information from. And that's fine. That's fine. For for for other people, for whom government is very important because they don't access it 4 or 5 times a year, they need to go in quite regularly because they need a lot of help from government or they’re going through something quite complex in their lives. \n \nThe concept is that you will use single sign-on to log on to a GOV.UK account. And from there, you will be able to access services ideally with one click, as I mentioned previously, you could have one click access to things you're eligible based on what we already know about you, or you can change your data. So the the great mythical beast in government is this thing called Tell Me Once. Right. So we we don't have a single register of citizens in UK government, but we have hundreds of them. We have, you know, our addresses, our names, dates of birth, addresses will be in a lot of databases across government. And if we move, I don't move very often because I'm at that stage in life, young folks move a lot and it's likely that most of those bits of data are wrong across government. \n \nSo that's sort of, a by-product of a personalisation is we should be able to update that data and push it out to other parts of government in a really seamless way. And what's really exciting about personalisation, though, is there are, there's so much information on GOV.UK and so many services. You kind of need a Ph.D. in Government Studies to be able to to know how what you're what you're eligible for, what's out there. If you could personalise it by saying, you know, so for me, I'm in my 40s, I have children, I travel sometimes, I earn a certain amount. The amount of information on GOV.UK will shrink right down to, I'm making up numbers here, but 5, 10 per cent of that information and I should only be offered services that are relevant to me. \n \nAnd I think from that you're doing, you know, that old adage of - it's written on your laptop - doing the hard work to make it simple. We're doing the hard work of trying to get information about a person and yes, shrink down the complexity of government to what, to what is relevant. And equally, we're not going to mandate this, right? That's really, really key to remember. If people don't want to do that, you will be able to go into your GOV.UK account and, you know, show what data we're linking and and de-link it. If you don't want to do even that, you know, you can continue accessing services how they are now and certainly we’ll always have an assisted digital method for people who don't want to or can't access services in the ways I'm describing. But I think personalisation is-is the big, our big play over the next few years. I think it will be transformational for a lot of citizens. \n \nVanessa Schneider: \nYeah, you mentioned the next few years. Obviously currently you're in post the next 3 years, am, is that right? \n \nTom Read: \nWell, no, that's that's kind of artificial. I think, I'm here forever. Right. So what I've been trying to say to people, I think because GDS has had quite a lot of change at the top, I'm just trying to make it clear that I'm not going anywhere anytime soon. I think if I'm still here in 5 years, you know, maybe somebody should start to say: ‘you should probably freshen up soon’. Equally, I'm certainly not staying less than 3 or 4 years. I mean, we've got a lot to do. I'm already enjoying it.\n \nVanessa Schneider: \nI was going to say, this is this is what you're doing for 2021 to 2024, is that right? \n \nTom Read: \nYeah. I've, I've, I've tried to-to sort of focus on the current Parliament cycle. \n \nVanessa Schneider: \nRight, but it's a lot. [laughs]\n \nTom Read: \nIt's a lot. It's a lot. And we don't do anything. I also didn't, I sort of think it's slightly artificial sometimes to say, you know, here's our 10-year strategy. Who knows what on earth is going to be happening in 10 years in terms of maybe they'll be tech innovations or maybe they'll be - more likely - machinery of government changes or something else. So I want us to focus on, you know, more than a year, less than 5 years. So our Parliamentary cycle, it also slightly secretly sharpens the focus for colleagues in the Treasury and so on for for the upcoming spending review. \n \nVanessa Schneider: \nVery strategic, I see. I know why they hired you. [laugh from Tom] Do you want to dabble in a bit of future casting? What happens beyond, or you know, say we achieve everything that you set out? What can we do after? \n \nTom Read: \nI have absolutely no idea, I don't think. So, I think - what do I think? - The, the, the-I'm sort of stepping into areas of the Central Digital and Data Office here rather than GDS, I think. But. \n \nVanessa Schneider: \nIt will influence our work. No doubt. \n \nTom Read: \nWe work hand in glove already. It really will influence our work. I mean, things that I'm really interested in long, long-term is the there is still a relatively low digital literacy across senior policymakers and ministers, you know, with some notable exceptions across government. And I think that will change organically. I think that is changing already. But I'd quite like to see, yeah, without wanting to be hyperbolic, I think fundamentally the way we do policymaking, it's not wrong. But it's the way we've done it for a lot of time. \n \nWhat what what slightly worries me about that way of doing it is 2 things. One is we've never properly stopped and really understood what are the most important policy changes for users, for people out there. You know, really, would this policy change your life or is there something else that we could do for the same amount of money with the same ambition that would change your life more? And I think we need to, the very qualitative, but I think we need to do more of that when we're doing policymaking right at the beginning. That's one. \n \nTwo: We tend to use data to prove hypotheses rather than than to suggest policy ideas. Really, I think we should be, you know, the really good work that Alison Pritchard is doing over at the Office for National Statistics around creating a data analytics platform that takes government data from all departments. That that's key because you should be able to look at the data, use, you know, authentic machine learning or similar, or just complex algorithms and say ‘find the connections’ that we don't quite know. What is that group, that for some reason they share a set of character traits or share a set of socio-economic situations? And then later on, they are the people who end up in prison or big users of the NHS or similar. And let's create some policy initiatives from the data. I think that would be spectacular. So anyway, so once we fix, once we've fixed all of the long tail of government and we've made GOV.UK personalised and we've done a digital identity service, we've moved all the legacy technology in the government to the public cloud, we've made everything secure. Yeah, that's where we'll go next, I think. \n \nVanessa Schneider: \nObviously yeah, that-that's some amazing work to look forward to, I hope. But I think we should finish on the hardest-hitting questions that I have for you today. \n \nAnd we'll start off with Marmite. Yes or no? \n \nTom Read: \nUh, yes. \n \nVanessa Schneider: \nWorking from home or working on location? \n \nTom Read: \nBoth. \n \nVanessa Schneider: \nJam before cream or cream before jam on a scone? \n \nTom Read: \nOh, well, my mum lives in Devon, so I'm going to get this the wrong way around and she'll be very upset. But jam and then cream.\n \nVanessa Schneider: \nOoh, that's the Cornish way. \n \nTom Read: \nDamnit. \n \nVanessa Schneider: \nEarly bird or night owl?\n \nTom Read: \nI'm a night owl. I'm not good at morning's.\n \nVanessa Schneider: \nMorning coffee or gin o'clock?\n \nTom Read: \n[laughs] Both! That's healthy isn’t it?\n \nVanessa Schneider: \nWe've been stalking your Twitter feed. [laugh from Tom]\n \nPlanes, trains or automobiles? \n \nTom Read: \nWell, I'll get in trouble with climate folk won’t I? Look, I really care about it. It's...I really miss travelling. I really miss travelling. \n \nVanessa Schneider: \nYou're allowed to say cycling, walking, canoeing. \n \nTom Read: \nYeah, a bit of that. Bit of, I don't really canoe. I really miss travelling on-on planes. I do live near a flight path and I'm quite enjoying not having planes going over. So I'm a hypocrite like everyone else. \n \nVanessa Schneider: \nTotally understandable. And this is quick fire isn't it. \n \nSo Batman or Superman? \n \nTom Read: \nSup--Batman. \n \nVanessa Schneider: \nAll right. All about the journey or the destination? \n \nTom Read: \n[laughs] I don't know! \n \nVanessa Schneider: \nToo, too airy fairy for you, that's OK, no worries. \n \nWhat about crunchy or smooth peanut butter? \n \nTom Read: \nI don't eat peanuts, so neither. \n \nVanessa Schneider: \nAllergic? \n \nTom Read: \nNo, just don't like them.\n \nVanessa Schneider: \nFair enough. And finally, what do you think of the idea of an office cat? I know this one's hot on people's minds.\n \nTom Read: \nSo. I'm a big fan of an office cat. I think we should have an office cat. I don't know if it's practical. We talked about an office dog when I was at MoJ with a, with a little you know, pass on its collar that was quickly squashed by our DGs [Director Generals].\n \nVanessa Schneider: \nYeah I feel like I've put a cat among the pigeons by mentioning this. So [laughs] [laugh from Tom] there's always, there's always chatter amongst the staff, ‘Oh, can we please have an office cat?’. But unfortunately, because we share this building with other tenants, it's not been, not been an option, apparently, especially with cat allergies. I don't know how they get away with it, with Palmerston and FCDO [Foreign, Commonwealth & Development Office], for instance, you know, there's probably going to be people with cat allergies. But if you can put in a word, the cat people will be very grateful. \n \nTom Read: \nOK, here's my most political statement of this whole interview. I will look into whether we can get an office cat. I think it's a great idea. \n \nVanessa Schneider: \nOh, fantastic. Well, I've run out of quickfire hard-hitting questions for you. \n \nThank you so much, Tom, for coming on today and sharing with us what you see as GDS's new mission and how that's going to be achieved. If you want, you can listen to all the episodes at the Government Digital Service podcast on Apple Music, Spotify and all other major podcast platforms. And the transcripts are available on Podbean. \n \nGoodbye.\n \nTom Read: \nGoodbye.\n \n----------------------\nDo you enjoy the GDS Podcast? Help us to make it even better by completing our short, anonymous survey.\n \n " ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_30ad3nc_1200x628.jpg?s=aaa33106ef09f95b0faa06a11fbee72b&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-30-tom-read-talks-gds-s-future-strategy/" ]
  }
}
