{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #24:Celebrating Black Excellence in Tech | Government Digital Service Podcast" ],
    "summary" : [ "GDS colleagues and the BBC’s Matthew Card discuss Black excellence, offer advice to young Black people interested in a career in tech and share how allies can help.\nThe transcript for the episode follows:\n-------------\n \nVanessa Schneider:\nHello and welcome to the Government Digital Service podcast. My name is Vanessa Schneider and I'm Senior Channels and Community Manager at GDS. Like previous episodes, this one will also be recorded via Hangouts as we're all working remotely now. \n \nToday's podcast topic is Black Excellence in Tech as part of the GDS celebrations to commemorate Black History Month. The GDS Black Asian Minority Ethnic Staff Network at GDS have planned a calendar of events for the third year running. This year, many of the events are themed around Black excellence. To learn more about this, particularly in the tech sector, I'm joined by 3 guests: Samantha Bryant, Matthew Card and Chuck Iwuagwu. Sam, could you please introduce yourself to our listeners? \n \nSam Bryant: \nHi, everybody. I am Samantha Bryant, or just Sam, and I am an Associate Delivery Manager on the GovTech Catalyst Team, and also one of the co-founders and co-chairs of the GDS BAME Network.\n \nVanessa Schneider: \nAwesome. Thank you, Sam. Chucks. Do you mind introducing yourself?\n \nChucks Iwuagwu: \nThanks Vanessa. Hi everyone. My name is Chucks Iwuagwu. I'm Head of Delivery in GOV.UK. And before becoming Head of Delivery on GOV.UK, I was Head of Delivery on the Verify programme.\n \nVanessa Schneider: \nGreat. Thank you, Chucks. Finally Matthew, could you please introduce yourself? \n \nMatt Card: \nHi, I'm Matthew Card. I'm a Software Engineer, also a Senior Leadership Team Advisor at the BBC. I also run a motivational platform called Release D Reality, and I've started a Black tech network group as well. \n \nVanessa Schneider: \nFantastic. Thank you, Matthew. So from what it sounds like, you all carry out important roles in digital, data and technology areas of your organisations. Would you mind sharing how you've gotten to the positions in your careers that you are in currently? Let's kick off with Sam, maybe. \n \nSam Bryant: \nOk, so I didn't come into the Civil Service thinking that I would land a tech role. And my initial idea, plan wasn't to be in the Civil Service for ages, but having found a tech role that is a non-techie tech role, I literally like found my niche, and that really encouraged me to stay in the Civil Service for longer. So I moved from the Cabinet Office to Government Digital Service, where I developed and progressed to being an Associate Delivery Manager. And I absolutely love the role. And also because I'm super passionate about D&I [diversity and inclusion], I formed the BAME Network here at GDS.\n \nI would say the most important thing about my role was just like being surrounded by like-minded people. So at GDS, there are a lot of people who are in the tech organisation but not necessarily holding tech roles. And so before I became a DM, I was able to liaise with different managers in GDS, get an understanding for the work that they do, and it really aligns with my natural skill sets. And because I had a natural love for technology anyway, it, those two things aligned. So that's how I became an Associate Delivery Manager. \n \nVanessa Schneider: \nThat's really cool to hear. Do you mind sharing if you've had any experience outside of the public sector, outside of the Civil Service maybe?\n \nSam Bryant: \nI have, but not in a technical role. So I've worked for, I would call them like e-commerce tech companies like Groupon. And prior to that, I did some teaching, like all of my other jobs prior to this were very diverse and not necessarily aligned with what I do right now. But I also did a degree in English, which is really helpful when you're in a tech role, because communication is key, whether we're thinking about how we make our communications accessible, and when when we think about how we communicate with all stakeholders or how we communicate tech things to non-techies.\n \nVanessa Schneider: \nThat's really great to hear, yeah. It's, I think it's probably really important to hear also that you can do a variety of things before you come into the tech sector and that it's not, you know, a waste of time, perhaps. Chucks, do you mind perhaps sharing with us how you came to GDS and to the position that you are in now? \n \nChucks Iwuagwu: \nI'm a bit like Samantha in, in the sense that I didn't set out in my career to work in, in tech and certainly to work in IT project management and in delivery leadership. This might surprise you, but my background is in biochemistry. I-I did a Master's in pharmacology and subsequent degrees in, in, in chemistry and, and making, manufacturing drugs, and got involved in clinical research. But it was actually my work in clinical research that led me to tech. I was involved in a clinical research project, and was particularly involved in writing specifications for the development of the application, the IT system, that we used in clinical research. And that was what sort of introduced me into business analysis and working with developers and those who write codes. I just made that transition from working in that sector into - I really enjoyed, you know, creating, you know, applications, IT systems. From then on, I moved to work initially for the health department in Scotland for NHS National Services Scotland. And then through that to several local authority. And, you know, ended up in GDS exactly about a year.\n \nI-I became an agile enthusiast about 11 years ago, became a scrum master 10 years ago, and started working in agile scrum and have been working in agile delivery, scrum, kanban, different flavours of agile, for about 10 years. I was, just so people know, I'm an independent consultant, and working as an independent consultant in an agile space have enabled me to meet some of the cleverest people I've ever met in my life. \n \nVanessa Schneider: \nThat sounds like a really wonderful experience. Well, finally, we turn to Matt, obviously we've heard from perspectives from people who work in the Civil Service, but the BBC is obviously also a very big institution in British lives - so it'd be really cool to hear how you wound up working there as you do now. \n \nMatt Card: \nSo what, I, so I did the traditional route. I started out not knowing what I wanted to do. So I took a like a gap year and I was just working in retail for a while, and then I decided to go back to university and I picked, I wanted to do comp-something in computers. I found myself on a computer all the time trying to work things out. So I thought let me go and learn how to work, to do stuff. I did a sandwich course - so one year was out in, in the real world. And then I came back, completed the degree, and then I found a job in London at a, a small company. And then I got made redundant out of my first job, cried my eyes out, you know, because, you know when you get your first job and you're like, 'oh, this is amazing'. Because I didn't know what to do before I found out what I wanted to do. And, you know, so I thought, I thought this was it. And then I got made redundant. \n \nAnd then I was looking for another job, and then I found the BBC - it was really interesting because I didn't actually want to work at the BBC because I, of the perception of what I thought it was going to be like. So I went for the interview and it blew my mind - it was like 'wow' - because it was so different, it was like all open plan, like loads of floors and you could look out on the, on the whole building and everything is like, 'wow, this is amazing'. And then the second interview that I had the, the person who interviewed me just said, 'oh, so tell me, what's your favourite site?' And I was like, 'wow, this is a really interesting question'. So I was like YouTube - ‘cause it was 2009 so it's like YouTube was massive - and I was like just everybody can share their content, it's just amazing, you know? And he was like, 'right. It's a really good answer'. He asked me some other questions, and then I got the job, and I've been at the BBC ever since. I went, I started in London and I moved up to Manchester with the BBC, and I'm here now.  \n \nVanessa Schneider: \nThat sounds like it was a really positive experience. Do you think that doing your degree was something that made you more successful in your career? \n \nMatt Card: \nYes and no. I think that my skills outside of, of the computer science field has really helped me. Like because, as I said, I worked in retail for a very long time, so my customer service skills really helped me because, at the end of the day, the users are customers, right? You just have to explain and you have to have difficult conversations with people to say, 'you can't have that right now'. You know that's got nothing to do with tech - that's just you can't have that right now. So, so it's, it's more about conversations and, and learning to talk to people and dealing with, dealing with personalities as well. That's, that's was really important.\n \nVanessa Schneider: \nBrilliant, thank you so much for sharing. So a question to both Chucks and Sam, do you think there are any kinds of supports that you've had in your life that were a factor in you being successful in your current jobs?  \n \nSam Bryant: \nSo is there anyone who has supported me in my life and helped me to be successful? I would say well, initially my parents in terms of installing values into me that have made me want to be the best version of myself, who have, they've made me feel like nothings impossible to achieve. \n \nThey helped to install values in me, make me bold, confident and just positive. And they made me a nice young lady who's good at communicating. And then along my career journey, I would say there have been a few people in GDS who have really encouraged me, especially along my journey to becoming a Delivery Manager - so I'm always thankful to them. And I feel like some of it's really internal and kind of spiritual, like, yeah, I feel that my connection, my religious connections helped to install lots of confidence and self-belief in me that helped me to naturally just push forward for myself as well. So, yeah.\n \nVanessa Schneider: \nYeah, that's actually a really interesting fact, you're talking about religion, because I think support can come not just from people, but also from networks for instance. So, yeah, Chucks, if you've got any reflections on that, I'd be really interested.  \n \nChucks Iwuagwu: \nAgain, very similar to Sams. I'm a person of faith and, a person of Christian faith, have very strong connections with with the church. And, you know, people might some people know this, but I'm a first generation immigrant. So family network has always been at the heart of everything. I'm the youngest of seven - and my brothers and sisters have just sort of spurred me on to to to strive for excellence. One of the things I have experienced being a first generation immigrant is that I am conscious that I have been given an opportunity, and being in this country for me is, I am, you know, eternally grateful, you know, that that those who were here before me have built a platform that has enabled me to-to flourish. And I have this sense that I have to contribute to making that, making this place a better, a better place, not just for myself, but for all people, you know, all people irrespective of their backgrounds and irrespective of, of, of where they've come from.\n \nBut on GDS particularly I have found the support of the Deputy Director for Delivery absolutely of great value. I-I you know, this person has become somebody who has inspired confidence in me, has enabled me to understand the Civil Service. And I think everyone, BAME or not, need to have people who inspire confidence in you. You know, the director of GOV.UK has some great ambitious plans for GOV.UK - and each time I talk to her about these things, I feel, wow, you know, you've got these ambitions, which means I can have ambitions for for things, for people, I can do this, you're doing it, I can do it\n \nVanessa Schneider:\nYeah, it sounds like mentorship is a through line. So obviously, I hope you are happy where you are, even if it's a way station on what's next, but if you could change one thing about your career, would you? And what would it be? I think Chucks, you've got something on your mind on that front, don't you?\n \nChucks Iwuagwu: \nYes. I actually set out to becoming a doctor. If I can change something in my career now, I'll tell you what it is: I-I would not leave, you know, delivery, I would not change career at all. What I would like is to have had, or to still have the opportunity to gain a bit more learning that would enable me to do a bit more teaching, you know, and coaching. That is the bit of my job that I love so much - is that, is that bit of helping people, supporting individuals or teams in-in realising their potential. I-If I could change anything, it would probably spend some time learning how to be a better teacher. \n \nMatt Card: \nSometimes I think everything happens for a reason, you know? And I struggled in a part of my career for, for a big part of my career. Some of that was because I moved up to Manchester by myself. I moved away from my support network. I learnt about resilience at the BBC and went on a course and it was really good. And what I realised is that I had lost a lot of confidence. And, you can break resilience down into many different parts, but there are four components, main components of resilience, and that is: confidence, adaptability, purposefulness and social support. And we all have a different varying range of all of these things. So I can safely say that most, most of my social support - and that's a lot in like our community, right? You know, it's our parents, Christian Faith, used to go church all the time, and that, we're centred around family, very centred around family. Other cultures too, not saying we're the only one. But I moved away from that. So then when things got a little bit tough, they got really tough, you know, so struggled for a bit.\n \nBut I would say if I could change anything, but I don't know if I would, it would be learning and realising my strengths earlier, because I've got a lot of strengths, and learning that failure isn't a bad thing. I took me a very long time to learn that failure isn't a bad thing.\n \nAnd also, actually, Chucks mentioned it I think: the, the mentors. I didn't believe in mentors before I went on this resilience course, I thought I was fine. And then I was, when I went, I was like 'whoa. I'm not fine'. So it's like mentors - I work with a gentleman now called Phil Robinson. We just delivered a talk on Tuesday called 'Decommissioning: an engineering guide to decommissioning systemic racism', and it went down really well. The-the first person, Mark Kay, was the first person who I spoke to and explained to him exactly how I felt. You know, the pressures, the, the extra cognitive load that we go through, you know, the running things through a filter just to make sure that we're saying something quite right, wondering what if we're saying something quite right, wondering if someone in the room is shutting us down because of the colour of our skin or something like that - all of these things were rolling round. He was the first person that said, 'you know what? That's not right, you know. And I think we, we definitely need to do something about that'. \n \nSome people don't think it's like their place to get involved - Like 'oh, who am I to do this?' When I was like, no, no, no, no, help, we need your help, right? We need allies.\n \nObviously my dad. He's, he's the reason why I'm who, how I am right now, you know. He always used to talk about fellowship and all of this, and I'd be sitting 'oh no dad. What you doing that?' But now I'm talking about fellowship because you know what he used to do: he always used to ring up and talk about, and, and find out how people are doing. What do I do now: everyday when I wake up, I go on WhatsApp:' how are you doing? How you doing? How you doing?' And I just c-continue my day. So dad's very, very strong influence to me. \n \nVanessa Schneider: \nThere are a lot of nods in this conversation through what you've been saying, so I can see everybody's relating to it. And it sounds like you have a really great network of people supporting you, rooting for you - I'm, I'm very happy to hear that. Sam, any reflections from you? If you could change anything, would you? \n \nSam Bryant: \nSo I think Chucks and both Matthew have reflected on things that I would agree on and things that have resonated with me. In addition, I probably would have changed how quickly I took my career seriously. Initially when I joined the Civil Service until I found my niche which was delivery management, I nat-I didn't like necessarily see all of the opportunities that were directly in front of me. So even though I was doing my job amazingly, I wish, I wish, I would like to say I wish other people like saw it and was like, 'you know you're, like you could do way more than this. And someone did eventually, but it was like years later. But taken the onus on myself, like, I wish I was just like, like, 'let me see what else GDS has to offer'. And like, you're definitely interested in technology, and there are probably some non-technical roles that would suit to the T. So to, I wish I just did that kind of investigation piece a lot quicker.\n \nI also don't feel like, I feel like everything happens in time and everything happens for a reason. So I'm sure my energies were invested elsewhere that it needed to be at that time. So, yeah, now I'm super focussed and I know exactly what my position is, where my skills lie and what I can offer to the tech industry as a Black female. So, yeah, that would be mine.  \n \nBut like Matthew said, I'm a bit of a perfectionist. So failing fast was hard for me to learn because I want everything to be perfect before I try out. So yeah, learning about that has literally revolutionised my life inside and outside of work. \n \nVanessa Schneider: \nJust a quick dive into it before I go on to the next question, but you mentioned being a perfectionist and I think Chuck's had a similar sort of conversation earlier. Do you think that is to do with your cultural background as well, that you feel like you've got to meet expectations and surpass them maybe? \n \nChucks Iwuagwu: \nYeah, I-I mentioned one of seven children, and the least qualification amongst us is Masters degree. My mother was a headteacher, my father was a Nigerian government permanent secretary. So, yeah, there, there is this thing about the drive to achieve excellence. My mother would say, you know, whatever you become, you would have to become by yourself. Nobody would give it to you. Go out there and get it. You know, don't wait for opportunities to be given to you - create them, take them, demand them, you know. \n \nIt's, it's unacceptable, you know, in my cultural background to, to sit on your hands. It's completely unacceptable. I cannot even conceive it. I really can't.\n \nVanessa Schneider: \nThose are really motivational things to say. I could see a lot of nodding with that again. I think that, yeah, Matt and Sam might have related to being raised like that maybe - I'm speculating. Let's hear from you both. \n \nSam Bryant: \nYeah, for me, my perfectionism definitely comes from my parents and my upbringing. My dad would always be like, if you get 99% on a test, like maybe other families would be like that’s an A, that's amazing, my parents would be like, where, what happened to the 1%? But I still, I-I don't necessarily wish I was brought up any different because I love who I am today. But I definitely know how to amend the things I was taught and implement them maybe in like a different, more creative way to get the same or better outcomes. So, yeah. \n \nVanessa Schneider: \nYeah, it sounds like you've taken the best lessons from what you were raised like and the best lessons of what you know now and fused them together. That sounds really nice. So, Matt, any reflections on your family?  \n \nMatt Card: \nYeah. So, so I would come from a different angle. It's very interesting. So you get very different variations, and this is really good because I find that with stereotyping, everybody thinks that all Black people are kind like the same and we're not - we're very, very different you know. There's so many different cultures, you know, so many different countries involved in this thing. But one of the things I've always said to people is that, I can speak for a lot of people that I know who look like me - that they've always heard, you have to work ten times harder than your counterparts. And it's like one of the things that it's, it's confusing, and, and I know my parents were trying to put me in a good position so that I would succeed, but then what that actually does that actually starts to set you apart from your counterparts. And it can have a damaging effect because then you go to school and you're like 'right, ok I am different. Why am I different?' And then you're getting confirmation bias by, you know, so like your teachers who don't understand your culture. And unfortunately, that's where a lot of people don't know who they are yet, and they're learning who they are. So, you know, then these confirmation biases are happening, you know on both sides. \n \nSo it's, it's kind of like, like what, what Sam said: y-y-you take what the good things and then apply it. Do, do agile with it right - put out some, get some feedback on it and then come back and then say, 'no, no, no. Let's change that here. What's the requirements? What, what was the user feedback? You know, I mean, was the stakeholders one?' And then then go forward again, you know? So that's what I would say. \n \nVanessa Schneider: \nThat was really cool. So our next question, we've had a bit of a look into your past just now, but I was wondering if you've got any idea about your future. Where do you see yourself in 5, 10, 20 years? I don’t want to make any guesses about how old people are so I'm keeping it open for you so you can pick how far into the future you're going to look and what you think you'll be doing at that point. How about we start with Sam? \n \nSam Bryant: \nYeah, so professionally I will be some sort of delivery manager head somewhere. I would love to work for a company that has a product that naturally is a part of my everyday life. And then using my experience in private sector come back to public sector, because I do feel like there's a lot we can learn in government from private sector organisations. But again, in turn, there's a lot that private sector companies can learn from government. So I'd love to like bring my expertise externally and then learn some stuff there and bring them back to government. \n \nI also see myself just being more of a head in the D&I [diversity and inclusion] space, especially where it comes to like being influential in terms of Black women in tech, Black people in tech in general. I'm going to be, or I already am a part of Mathew's network. So it's amazing that he's bringing together Black techs, so Black people in tech, so I am absolutely loving that and I'd love to do a lot more. I'm also really into working with organisations and schools, help them to be more diverse and inclusive. And I've done like, this summer, I did, did a session with some teachers with an organisation called Success through Soca, and we ran some sessions to give them ideas on how they can incorporate Black history into the curriculum. So that's really exciting, and I hope like, in the next 5 years we've really established a solid programme that can impact and revolutionise how we do stuff as businesses, organisations, schools, just like Matthew said, like we really can unpick a lot of the stuff if it really is just systemic. So, yeah, those are two highlights of where I see myself in 5 years.\n \nVanessa Schneider: \nI love it. You're already manifesting your future. That's great. So, yeah, Matt obviously your network was mentioned. What do you see in your future?\n \nMatt Card: \nAll right, I'll try to keep this quick. So more of the same. Straight up, more of the same. So I'm a software engineer right now. I'm applying for tech role, tech lead roles right now, I'm going to jump because I've realised my power, realised my strength. So engineering manager next, don't know how long that's going to take, probably 2 years on the trajectory that I'm on. And then probably moving up to CTO, Chief Technical Officer, stuff like that. Continue my public speaking and do more of that.  \n \nAnd then beyond there, I'm want to create more networks - I'm, I seem to be really good at creating networks and motivating people, so I just want to do more of that, and, and bringing out the culture. So as I said, I've got a motivational platform, I'm doing work on D&I inside and outside of the, of the BBC. Then I'm running a think tank called Future Spective, where we think about the future. We think about what's going-because a lot people are thinking about the past - which we have to we have to understand where you're coming from, right, and for the present, because there's a lot stuff going on now - but I want people to think about the future as well: what's going to happen in 25 years, 30 years time? How is that going to translate? We, we all need to link up and talk to allies as well, talk to majority groups - just start that conversation. So it's all about that conversation. \n \nOh, this might sound corny, but I'm going to change the world.  \n \nVanessa Schneider: \nI love it, you got to aim high, you gotta aim high. All right. Round to you Chucks.  \n \nChucks Iwuagwu: \nI'm conscious there'll be a lot of people who listen to this who think, 'oh my goodness, you know what's in it for me in the next 5, 10 years?' You know, Black people. And I'm not you know, I'm not embarrassed to say that I'm not quite sure. \n \nYou know, I-I hold this role as Head of Delivery for an organisation that has over 200 people in it. I know that I enjoy teaching. There is a lot that can be done in terms of education and and raising awareness. I, you know, when I said I'm very religious, I'm actually in my spare time a Church of England Vicar. So I do a lot of preaching on Sundays. And, and, and I have become this person who wants to bring people to a place where you realise that there isn't actually a need for discrimination. You know, there isn't actually a need for that. There isn't you know, there's no need to feel threatened by somebody who's slightly different from you. So I know what world I want to be in in the next 5, 10 years, I'm not quite sure my role in that. I'm also very ambitious. I know I'm qualified to be a director of a programme but I'm not quite sure how I'm going to navigate all of this.  \n \nI have a vision of the world I want to be in - it's an inclusive world, is an open world, is a world where, you know, government services can be accessed easily. I want to educate people about diversity and educate people about how to run good projects, good projects and good programmes. How all of that shapes in the next 5 to 10 years, I really don't know. And, and it will work itself out. But one thing I have to say and I want to say to any Black person, particularly up and coming people who are not sure of what the future holds, is don't do nothing. You know, you may not be sure of what what it is you're going to do and how you're going to get there or your role in all of this, you may not be sure of that. One thing you cannot do is just sit back and feel sorry for yourself. Ask questions, come out and say, these are the things I enjoy, how does this progress? How does this, how do I make a difference? Don't shy away. I don't know what I'm going to be doing in the next 5 years, but I'm not going to not explore what is out there.  \n \nVanessa Schneider: \nGreat. Wise words. Matt anything to add for the future in Black excellence in tech?  \n \nMatt Card: \nYeah, I just want to echo everything that Chuck just said actually - just keep moving. If you don't know what you want to do, do something big and perfect that because then you've got the transferable skills. You see how we all spoke about what we used to do and now we just do this, and it was just a, it's just a iteration - there we go again - an iteration on what we used to do in a different form, right. So I've got them laughing.  \n \nSo I'll just roll into my like what I would tell kids is: learn how you learn. That's the simplest thing I can say - just learn how you learn. Don't let other people tell you how you learn because the school system can only teach you in a certain way, they've only got a certain capacity. So you need to learn how you learn what works best for you. Don't discredit the other ways. Keep them there as well and use those as well, because you have to learn, you have to pick up the knowledge from different people, and people then communicate in different ways to you, so you have to understand how they communicating to you, but learn how you learn best. \n \nVanessa Schneider: \nVery simple. I like it, very straightforward. Yes, Sam, anything from you that you want to pass on to the future stars? \n \nSam Bryant: \nI would say just work on having self belief. I feel like a lot of things come from within, and I feel like it's really good to work on yourself. You can be around the right people and still not feel great within yourself. You really need to build up your self-confidence so that you don't feel intimidated in any room that you step into, even if you lack knowledge, because having the self-confidence will give you the power and the confidence to ask the questions, the silly question, the question that no one wants to asks, but to be fair half the people in the room want to know the answer to that question. When you just have that natural energy about you, you will naturally just go on that website and look for that networking event or go on YouTube and type in 'learn more about agile' or go on YouTube and find the video about how to get involved in tech or anything that your, you, your heart desires. \n \nSo you really work on yourself.  \n \nVanessa Schneider: \nThank you all for your amazing advice for any Black people who are interested in working in tech, data, digital, all that space. Do you have any advice for allies? What can we do to support Black colleagues in the workplace? Do you have any examples of exceptional ally action that listeners can take on and think about how they can put it into action maybe. \n \nMatt Card: \nIt's roughly the same thing. Have self-confidence because what happens on the other side is that people are like, 'oh I don't want to make a mistake'. Take the same approach that we do here - fail fast. You're going to get things wrong as long as it comes in the right energy, you're going to be able to move on and people who are BAME are going to be able to understand where you're coming from, if it comes in the right energy and, and with the right intent.  \n \nYou know, do your homework, do your reading - there's loads of resources out there now. Talk to people. But there's, here's one: be slow to speak and quick to listen. Learn from other cultures because you can't manage people from other cultures if you don't know their culture - it's, it's it's almost impossible. Right. Sorry, sorry you can't lead people. You can manage them, but you can't lead, and leadership is different, right. There's a big gap in the middle, so someone has to lean forward first right. You know, some of the peers might be behind the curve and might not understand. Just talk to them as well, you know. Do things, just get yourself in the right frame of mind, practising gratitude is is is number one and just being confident as well. Chucks was confident to say that he didn't know - it's the self belief, he's just like, 'I don't know what I'm gonna do, but I'm going to something.' And that's amazing. If you hear it's slightly different to saying, 'oh, I don't know. I'm not going to do anything'. \n \nSam Bryant:\nFor me I would say the first thing is accept that you are an ally. Within this context of race, if you are not Black or BAME, you are an ally, and you should treat that like really seriously. Like I don't have a choice that I'm Black. You actually don't have a choice that you're an ally. And I just feel like everyone in the workplace should take that really seriously. So just start taking action from today. If you are not BAME and you really want to help out, I just feel like everyone should feel like this: everyone, it's everyone's problem to resolve. That, I think that's my main message like, as long as you're in a workplace, you should just be trying to ensure that it's a great place for everyone to work. Whether your BAME or whether you're not.  \n \nSo yeah, like Matthew said, just reiterate the fact that there loads of re-resources out there. Go to your BAME network in the first instance. If you are an organisation that doesn't have an ally network, like GDS is really good at the moment, we literally have an allies network, but if you don't go to your BAME network and see how you can help out or just be, the be the bold person to start an allies network at your own organisation and bring your peers along the journey too. There's so much you can do, especially do you know what, in line, line management. I know Matthew said there's a difference between leadership and managing and there is, but really take your role as a line manager seriously. Literally, like all of my line managers in my career have not been BAME, and that always like I'm, I'm really always nervous about it because I really want my manager to be a champion for me naturally and take the role really seriously. So if you are a line manager, particularly for, for someone from a BAME background, really do you take that role seriously. Because in a lot of organisations, when it comes to like performance awards and performance ratings BAME people do tend to score the lowest. So we really need to work on how we are line managing BAME colleagues, encourage them, help them to recognise their skills. A lot of us want to be perfect, help us to work on the fact that we can fall fast, encourage us to just go and do random things in the organisation that naturally white colleagues are like naturally, more like risk averse - we're not. We, we don't want to like take risks because we feel that we might get in trouble. Or, yeah, just make sure the environment for your line reportee is one where they can just like flourish. Yeah, that would be my advice.  \n \nVanessa Schneider: \nThank you, Sam. Finally, Chucks, any sage words for you to allies in the workplace? \n \nChucks Iwuagwu: \nYes, absolutely. I'll start from some, something my father used to say: there are two types of people in the world. Those who listen to hear what you're saying and those who listen to respond. Unfortunately, I think that a lot of people who are not a minority in this country, listen to respond. They're not listening to hear what I'm saying, they're listening to, to give me the script, the answer as per the script. You know, there isn't active listening to hear what, what I'm saying. And when you're not listening to hear what I'm saying, you miss you know, the things that I say that I never say. So you miss you know, hearing what I'm saying, that I don't have the words to express.  \nA lot of, a lot of our white colleagues don't know how to listen to us. I had to learn how to listen too, I lived in Scotland for 14 years. I had to learn how to listen to my Scottish friends, not because of the accent, that's nothing to do with the accent, it's, it's, it's to learn expressions, colloquialism - all of that, what people say and what they mean. And then I moved down south. And as a-a-a-a Glaswegian friend of mine gave me a thing that has what English people say and what they mean. You know, when I was go-Chucks this is not Scotland, you're going down south and people are going to say one thing and mean another thing. And I had to learn how to listen.  \n \nThe other thing I want to say is, as an ally, please don't make assumptions. Assumptions, very bad things. You know unless you're making it in the context of project delivery and you can make assumptions and you come back it up and you can, you know, have your plans in place to respond to the assumptions. Don't make assumptions. Don't assume that because I am you know, I am Black, I-I-I don't have sunburn for instance. You know, that was one had to deal with today with somebody. You know, 'Do you burn? Do you get sunburn?' Assumptions, very bad things. If you don't understand the cultural manifestation of a behaviour, do ask. You know, Matthew's just said it all: read, ask, ask Google.\n \nVanessa Schneider: \nThat's a lot of material for us to go through as allies for you in the workplace. You've given us plenty to work with. Thank you so much for sharing. I can see that it did take a bit of a toll on you as well. And I want to acknowledge that, that we shouldn't be putting this burden on you. But thank you for sharing these resources and tips nonetheless.\n \nHopefully less draining and more exciting for you, this is more about sharing the resources for fellow Black people working in tech. I was wondering if there is anything that, any events or organisations, that you wanted to give a shout out to that listeners can look at, and we can include the details in the show notes and the blog post that accompanies the episode.\n \nMatt Card: \nSo I just wanted to say, you know, I've got my motivational platform - Release D Reality. The Future Spective is, is brand new - so just watch out for, for that. So that Black tech network group: you can contact me on info@ReleaseDReality.com or MatthewCard@gmail.com.\n \nChucks Iwuagwu: \nI would encourage an eye out for several agile meetups - I’m not sure in the current circumstance with Coronavirus. They’re usually advertised on key major network websites and Twitter, on Twitter as well. So people will do well to look out for such, and where possible, please a-attend. ‘Cause it’s, it’s a really good way to network and to learn and to hear what’s, what’s happening in the industry, what other people are doing, some of the ideas that are coming through.\n \nSam Bryant:\nFirstly I’d like to shout out GDS BAME Network, because I think we're doing some amazing things as a community and the anti-racism network as well that has formed this year - I would just like to shout them out because their work has literally been amazing and has changed, changed the culture in GDS essentially, and that has been extremely positive. \nI'd also like to shout out Success through Soca. I work alongside them doing, using Black British history to help to build leadership skills within schools, colleges, and we also work with organisations to help them transform the organisations and allow them to be more diverse and inclusive. \n \nAnother organisation I'd like to share, or give a shout out to is Pink Dynasty. They're doing some amazing work in the tech space. They have events with people who are not specifically techies, but want to get into a career in technology. And as I’ve said, I am a Delivery Manager and typically that’s not like a super techie role but definitely is a way to encourage people who have a passion for technology to not be dissuaded into getting involved. \n \nVanessa Schneider: \nAmazing, these sound like really worthwhile organisations and I really hope that our listeners take a look at them and get involved with them as well. \n \nThank you so much for sharing those and also for coming on today. You can listen to all the episodes of the Government Digital Service podcast on Apple Music, Spotify and all other major pad-you can listen to all the episodes of the Government Digital Service podcast on Apple Music, Spotify and all other major podcast platforms. And the transcripts are available on PodBean. \n \nGoodbye.\n \nChucks Iwuagwu: \nBye. \n \nSam Bryant: \nBye.\n \nMatt Card:\nBye bye." ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_249gcir_1200x628.jpg?s=8ee901991f69f6af2656e2e05d1e8590&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-24celebrating-black-excellence-in-tech/" ]
  }
}
