{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #31: The vision for GOV.UK and the roadmap to get there | Government Digital Service Podcast" ],
    "summary" : [ "Rachel Tsang and Ross Ferguson share how the GOV.UK roadmap contributes to GDS’s mission of building a simple, joined-up and personalised experience of government.\nThe transcript for the episode follows:\n-------------\n \nVanessa Schneider:\nHello and welcome to the Government Digital Service podcast. My name is Vanessa Schneider and I am Senior Channels and Community Manager at GDS. For those of you who tuned into last month’s episode, you’ll know that GDS has launched its new strategy centring around 5 core key missions:\n \nGOV.UK as the single and trusted online destination for government information and services;\n \nJoined-up services that solve whole problems and span multiple departments;\n \nA simple digital identity solution that works for everyone;\n \nCommon tools and expert services;\n \nand Joined-up data across departments.\n \nToday I am joined by Rachel Tsang and Ross Ferguson from the leadership team of the GOV.UK programme to hear more about how their roadmap objectives are contributing to making GDS’s mission - of building a simple, joined-up and personalised experience of government for everyone - a reality.\n \nRoss, could you please introduce yourself?\n \nRoss Ferguson:\nOK, thank you. So I'm Ross Ferguson and the Deputy Director for Portfolio Delivery within GOV.UK. And this is actually my second tour with GOV.UK. I started as an Associate Product Manager when GDS was first set up. GOV.UK was the first product that I worked on and I later worked as the Head of Product Management for GDS. And then after a little overseas tour, I was very pleased to return to GOV.UK in January and, yeah, very excited to be back and to be working with Rachel.\n \nVanessa Schneider: It's good to have you Ross. Thank you. Yes, Rachel, would you mind introducing yourself to the listeners, please?\n \nRachel Tsang:\nOf course. So my name is Rachel Tsang and I am Deputy Director for Governance and Assurance on GOV.UK. Like Ross, I am, I sort of boomeranged back to-to GOV.UK. So I was, I did a previous role and then stepped away to do something else. And I'm really, really thrilled. I think that's a, it's not a necessary condition to working on GOV.UK that you come back. I think it is testament to like just how much people enjoy working, working on GOV.UK. Before that, I so, I joined government as a Social Researcher and did a range of roles in different government departments and yeah, have settled here in GDS.\n \nVanessa Schneider:\nThank you. So as mentioned at the top of the episode, the GDS strategy strongly relies on GOV.UK as outlined in GDS's first mission, which is to establish GOV.UK as the single and trusted online destination for government information and services. It'd be really great to hear from both of you how this mission influenced the update to the GOV.UK roadmap.\n \nRachel Tsang:\nSo I think fundamentally our mission for GOV.UK is to provide a joined-up, personalised, and, and proactive service - we-we blogged lots about that recently. And we-we've evolved continuously since GOV.UK was first created in 2012. And what we're looking to do now is really a big step change in-in our offering for GOV.UK. Fundamentally, it's-it's about changing our offering to continually innovate to meet changing needs. I think that that is the crux for how we're feeding into the wider GDS strategy and vision.\n \nRoss Ferguson:\nYeah, absolutely. I think departments, GDS with GOV.UK and, you know, spend control standards alongside departments has done a really, really good job over the years of bringing services that were previously paper-based and office-based, online. And a lot of them are really great in isolation. But we know that the people who use GOV.UK don't experience them, don't want them in isolation. They don't, it's not a nicely compartmentalised linear process. You know, they-they want them in combination. So really, the next maturity step for Government Digital has to be that these services are joined up. Which means that departments need to coordinate with one another.\n \nGDS is in a great position and GOV.UK is a great platform for, for enabling that join-up to happen in a coordinating sense but also in in a public experience sense: that there is one domain that the public knows they can go to to get the guidance, to get access to the services. And, you know, that's what they would expect in all other walks of life when they're transacting with lots of, you know, utilities and and and entertainment. So it's perfectly reasonable that they should expect that from government, and government is perfectly capable of doing it. So that's work that we want to really accelerate this year. And, you know, it is a big undertaking. So it's something that will continue in the, in the years to come.\n \nVanessa Schneider:\nYes, speaking of joined-up services, I'd like you to listen to a couple of interviews that we recorded with colleagues in the different GOV.UK teams that are working towards the objectives of the roadmap. So first we’ll actually be hearing from Tina Mermiri, who shares about the work done to connect insights across GOV.UK to enable those joined up services. This is so that government understands its users and users understand the government.\n \n[Start of vox pop]\n \nTina Mermiri:\nI'm Tina Mermiri, the Head of User and Data Insight for GOV.UK. I set out the data and the insight strategy for the programme, and I oversee all the work within data science, performance analytics and user research. So as a team of experts, we have 3 wider objectives and that's understanding GOV.UK users and their needs; that's facilitating data-driven decision-making internally and across wider government; and it's also monitoring the impact of the work that we deliver and the products that we ship. So with performance analytics, we're looking at how people, or users engage with the site, what content they're engaging with and how we can optimise their journeys. \n \nThen we complement that with the user research to understand what their issues are. We get feedback from them. We're actually looking at why they're trying to do certain things that are, that are failing and how we can optimise those journeys as well. And so what the data science community does is go into a little bit more detail with some of the more complicated techniques whereby we might want to look at some of the data that we've got behind the scenes and create some models and scores and look at something like related links and surface them on the site for users that have done something similar to other users and make their journeys easier. So it's all going back to optimising the journey, making it as smooth and frictionless as possible with the power of data behind that.\n \nWe're using Google Analytics to power a lot of this data. And Google Analytics has a cookie consent. So we will only track people who have opted in to tracking, which means that our data is not 100 percent representative of all our users, but it's pretty indicative of what they'll be doing. It also means that we hash out any personally identifiable information. We don't actually track that and don't use it for any of our analysis. And we've worked really, really closely with the privacy team to make sure that, you know, privacy is at the heart of all the tracking that we do and all the consequent analysis that we conduct around it. So personalisation, the way that we're looking at it is two-fold. On the one hand, it is without any personally identifiable information. So it is just looking at common journeys and similar content that's being consumed by different users at aggregate level. So that's the one way of doing it where we don't collect any other personal information and we don't personalise it based on their background or any of the demographics, we don't even track that right now. But it is about that journey and other similar journeys. And then on the flip side, we will eventually be trying to do a little bit more personalisation based on people who hold accounts with us, where they will, again, share some of their information with us as part of their account. And that is information that they will have opted into as well. And we will hopefully use that to personalise further, based on, based on their location, for example, and other similar attributes that we want to start building on. \n \nThe nature of the data that we collect and making sure that that's representative is, is very, very important. So we could do a lot of really clever stuff with it. But if it's not in a good place, then the output-- if the inputs aren't reliable, necessary, then the outputs won't be as reliable either. So we're spending a lot of time on revisiting the way that we collect some of the data, the way that we cleanse the data, the way we make sure that it is reliable and ready for us to use. So that's one thing that we're investing in quite heavily. And we need to make sure that we're asking the right questions without, like, probing, leading wording. We need to make sure that we're able to differentiate between attitudes around, let's say, GOV.UK or what they're trying to do and wider government. We need to make sure that our data is representative across all our very, very wide range and diverse users.\n \nI think the work that we're trying to do and the opportunities that it opens up for users and to make their journeys easier is, is, is really impressive.\n \n[End of vox pop]\n \nRoss Ferguson: \nTina's a...and her crew, you know, clearly, clearly know what they're talking about. She was, she was giving great insights there into, you know, just how important the data usage is going to be to powering the sort of whole journeys work that we’re wanting to do, the personalisation. It's all, it's all dependent on us making, you know, proper, proper use of that, of that data. I think that she, you know, she did talk well about the tooling that we're starting to bring in to help us with that. We are, we're definitely stepping up the recruitment that we do of-of these data disciplines. And, you know, and I think it's about bringing our, the, the data scientists and engineers that we have already and have had for a while much more closer into the work with the with the team so that they're they're kind of doing less reporting and they're doing more in terms of the tactics and the and the strategy work.\n \nRachel Tsang: \nOn the objective to connect insights, I'm not sure we're allowed to have favourites, but this one is-is really, really important to me because I think it really goes back to the heart of why GOV.UK was first created. Right? You think about the world before 2012, where there are almost 2,000 websites, and you needed to understand the structures of government to interact with it. And so we've come a long way. But fundamentally, the way that we analyse and approach problems remain siloed by departmental boundaries. So you know, the work that we are looking to do over the next year to join up those insights, to be able to understand aggregate trends and patterns, that's super important, not just for GOV.UK like in helping us to improve the product, but for the rest of government more generally in terms of how we approach a much wider whole user journeys.\n \nVanessa Schneider:\nAnd I guess as with any insights, what’s important is what you use them to enable. I think it’s time to hear from Daisy Wain, one of our Lead Performance Analysts, about what we’re doing to translate insights into a more personalised and proactive service for users.\n \n[Start of vox pop]\n \nDaisy Wain:\nMy name is Daisy. I'm the Lead Performance Analyst on GOV.UK. It's my job to make sure that we are at the cutting edge of analytical technologies and practises to make sure that we're aligned with what the latest developments are and to make sure that they're fit for purpose, for what we want on GOV.UK that obviously has a strong focus around privacy and security.\n \nSo one of the things that we've been doing is doing a cross-government data commission. So it's been working as a small team to find out all the different transactional services there are in government, what data attributes they all collect, and if they have an account that's associated with that transactional service. And if they do, how many accounts there are, and all that sort of thing. And obviously what that allows us to think about then is how we can use that data to be proactive. So, for example, if we were to have, if we were able to know somebody's postcode or to know their date of birth, we can then start to infer things about them. So that means we can proactively show them things on GOV.UK that are specific. So, for example, we know you live in Scotland, we can show you the Scottish content first and foremost, as opposed to the English. What else we can do is obviously helping the product teams to deliver the first trial of the account. So that was what we did on the Brexit checker. So that was the product where any person could go through a series of questions related to their personal circumstances around, you know, where they live, what their nationality is, what their plans are for business and for travel, and what the output is, is a series of actions that you may need to take related to the changes related to Brexit. And the account allows you to store that information, to revisit it and to get notifications of when that might change. The job as an analyst is to look at how people are using that thing so we can look at the sign-up journey to see perhaps where certain steps might not be working as well. And then that starts to help us build a picture about the types of people that would like to use this account and where the value is.\n \nI think it's important for us to think about developing this, like, next generation of GOV.UK and how people interact with government and government services. But it can't be designed just for people that want that. We have to consider people that would not want to opt into that world and to make sure that we are still designing things that allow people to not have to consent, but still have that optimised journey based on the data that we have available on those people, which is non-consented, kind of basic, so from the server. Obviously this is an important aspect for people that don't want to have that universal government sign-in, which is completely, completely within a user's discretion. So from an analytical perspective is, what can we learn about your behaviour on GOV.UK that allows us then to personalise your experience and even be proactive. It could be that you have the option to save some of your preferences. So there's things that we can start to do, which is purely based on your behaviour on GOV.UK that we can say, “hey, we think this might be useful for you” purely based on this behaviour, and then you can opt in to say, “actually yeah, that's handy. I want that to happen. I want that to persist”. Or you can equally say, “no, I'm not interested. I just want it to be, I want to be completely anonymous”. \n \nI also think that some of the biggest hurdles around this is making sure that users’ experience reflects the reality on GOV.UK. There is an expectation, I think, around - for some users - that government is government and everything is joined-up behind the scenes. And there is a confusion around “why do I have to tell my, the tax service my personal details and I have to tell the-- things related to my vehicle, the same details. Why are they not joined up? Also, why can't I sign into this thing and do the other thing?” So the hardest thing is like how can we build something that has those privacy concerns at the centre, but also then reflects users’ expectation of how to, how to interact with government. Meeting those expectations but from our perspective of delivering it, it's how can we do that kind of crosscutting, bringing all of government services, different departments together, creating this kind of, almost this single sign-on vision, which is what we're hoping to achieve in the long term, where you only have to do things once. But how you do that is very, very challenging. The front, the front of it looks simple. The underneath is horribly complicated.\n \n[End of vox pop]\n \nVanessa Schneider: \nI think one of the areas that really impressed me was how much collaboration there is across government on it. And essentially that you've got this buy-in on this objective through the commission.\n \nRachel Tsang:\nDefinitely. I think we were saying before, this isn't just a project for GDS or for GOV.UK, right. It-it only really, really works, and you only get the real value for users if you're enabling that cross government collaboration. And to be honest, that-that is tricky because departments don't necessarily always have the same priorities; there, there is a lot of stuff that is happening across government. But I think we all have the shared objective of fundamentally making things better for our users. And I think the extent to which this is driven by data and driven by insight is incredibly powerful, right? Because it's all very much evidence-led and led by what is going to make a difference to meeting user needs.\n \nVanessa Schneider: \nDefinitely, and I think, again,Daisy also reiterated something that Ross mentioned before at the very beginning, actually, about how the user perception of GOV.UK isn't that there are these separations between the different departments, that it is just the monolith of government and how we're really trying to make that perception of reality. I was just wondering if you had any more reflections on that, Ross.\n \nRoss Ferguson:\nI think that GOV.UK makes it possible to engage with and transact with government as-as one thing, if-if that's helpful to you as the, as the user. But it is also possible to say you're a-a particular-an academic or maybe a business user - there are you know, we also do cater for those more specialist journeys through, through government as well. I think that's one of the things that GOV.UK has over the years put a lot of effort into, listened to a lot of user feedback, made use of the data that we have had to get that to get that right. And so I, you know, I like what Daisy was pointing out there that: when we're thinking about personalisation, we're thinking about it like, you know, individual needs and that somebody might be operating, coming, coming to GOV.UK, as you know, a private citizen, but they might also be a business owner. And, you know, we-we-we want to be able to-to cater for those different sorts of profiles that one person could-could have. And, you know, and that's what we, that's what we do well. We--is the care and attention we pour into these kinds of nuances, these-these complexities. These--Daisy's right to say that it's-it's complex. That's what we love. That's what we're here for. That's what every person on GOV.UK is here for, you know, to-to do that hard work to-to make, to make the things as simple as people need it to be for their circumstances.\n \nVanessa Schneider:\nAnd it's also beautiful how you're working at it from both ends, whether somebody wants to fully connect all of their personal information that government holds, make sure that everything is bespoke to them, or if somebody prefers to really just have that interaction standing on its own, and just as they need to be in touch with government, they'll handle it on a case by case basis and and just sort of like be shepherded down the right path without government necessarily knowing everything about them.\n \nRoss Ferguson:\nYeah, I think that there is so much that we can do with all the data that we generate automatically through, through our logs and that we've gathered over the over the years and that we can analyse very quickly to be able to make pretty good bets about other information on GOV.UK, other services that would be of interest to you based on the patterns of usage in a given session. Which is, you know, very unintrusive. And, you know, I think that there's lots that we can do without people telling us lots of attributes about themselves and having to sign up to things - that will always be at the core of GOV.UK. However the account is very exciting because it will put the user in the position of being able to say, to build up a profile for themselves and be able to choose how they then use that, and that will just make government work so much harder for the public. \nAnd I think that that is maybe a little bit of, has been a pipedream for many for many years, but it's a reality that we can that we are delivering now, that will start to see come to fruition over the next year. And I think the public will be really excited about that and it will help make government more efficient. And so I think that's-that's something that everybody wins from. And really, you know, the teams are excited about that, not just the account team, but all--that's one of the good things about what I'm seeing on GOV.UK is the way that the teams are working alongside one another. There are data insights teams that have been really proactive about how they get in touch with our team that's working on starting and sustaining a business journey. They're saying to the accounts team “look we could, we could really benefit from this functionality, this feature, can we share data on this”.\nVanessa Schneider:\nWe obviously need a really solid foundation for all of this work, so I guess that’s why our objective to ensure GOV.UK is always available, accessible and accurate is so important. Let’s hear from Kati now on what’s happening in that area.\n \n[Start of vox pop]\n \nKati Tirbhowan: \nI’m Kati Tirbhowan, I’m a senior content designer in the GOV.UK Explore team. Our team is working on making GOV.UK easier to navigate and we’re currently working on ideas that include improvements to the site-wide navigation, mobile experience on the site, page-level navigation elements, so things like how the breadcrumbs and related links work on the site.\n \nIn our team we run multiple rounds of user research to improve our designs and we're doing research with different types of users. That's people who come to GOV.UK for different reasons to do different things. And within those groups, we're also including users who might have low digital confidence or skills or access needs, for example. And then each discipline brings their expertise to make content accessible. So that's from design to developers, to content design. And for content design, for example, we've got our content guidance that includes an accessibility checklist that we use to design and review content changes as part of our regular work on the site. \n \nAnd in our team we've also just done some accessibility testing on the new site-wide main menu design, which is one of the ideas we're working on. And to do the testing we used accessibility personas the GDS accessibility team have created and those personas are really helpful and an engaging way of raising awareness and understanding of accessibility. And from that, we identified some improvements we can make to the design and we'll continue using those personas to test our work as we go on. Um we’re also optimise-- mobile-optimising the pages and components that we're working on. So they feel like they're designed with mobile in mind, and that includes things like expanding the touch target. So the area you need to tap on to follow a link so that they're larger and easier to use, um especially for people who have a tremor or a long term impairment, for example. \n \nI think one challenge is the size of GOV.UK. It's a huge and varied site, with many different types of content, and GOV.UK provides the route to hundreds of government services operated by departments, as well as the guidance published by every department. You also have a lot of people looking for information and services to do important things in their lives. And that means for us it's critical that people can find what they need quickly and as easily as possible. And it really is the hard work of all the teams and all the different disciplines and all the talent that makes it happen. \n \nAnd one of our design principles is “do the hard work to make it simple”. And I think people are really passionate about this and care about making things work for users the best we can. And I feel like this is a big part of it, making it such a great place to work too. We can help to make a real difference.\n \n[End of vox pop]\n \nRoss Ferguson: \nI might point to this one as being one of my one of the areas I care about the-the most. I think getting the basics right is so foundational to the innovation that we might want to put on top of that. It's really important that GOV.UK is there in times of need for people. It has to be reliable. And it's the sort of site that you go to when you're not sure if the internet's working properly, you can go to GOV.UK to see well, if GOV.UK's up then it's and then everything's all right. So we do put a lot of stock in making sure it's reliable, that it's secure, that it's performing quickly and smoothly for people.\n \nAnd, yes, that-that would--includes how our search and navigation works, how our-our pages help people to find their way around the information services and through it. And so, yeah, we've got some-some pretty major changes taking place to the navigation on GOV.UK planned. That starts with a test, of course, because we like to, you know, to test with users before we go, you know, rolling this out to everybody. We will do some multivariate, or A/B testing, with a proportion of our users on GOV.UK, who will see the site in slightly different ways: so the menu bar at the top will have some, some new options in there. And through the early testing that we've already done, we're pretty confident that's going to help people to find information quicker and then to find other related information if they, if they need it.\n \nA lot of people will want to come to GOV.UK, get the thing that they're after and then get going. But some people will want an ongoing journey. And so this new navigation bar helps people to understand where things are and how things relate to one another. And then later on in this year, that same team, well obviously they'll continue improving that that nav, but they will also then be working on the homepage, which, you know I suppose, it's a kind of a cliche that people say, well, Google is the homepage, but actually, you know, really you know, a lot of people it's actually one of our it's like our top page is the homepage - lots of people go there. And so it can work harder, we think, helping people to understand what's timely, you know relative to events that are taking place in society, maybe or maybe because they've given us, they've signed up to an account and they want maybe a more personalised experience. So we're going to start with some changes to the homepage, which make it clearer what's, what's available and what's timely. And so these will be really two of the biggest changes to the design of GOV.UK, really since-since its launch in 2012. And so we're obviously a little bit excited about those.\n \nRachel Tsang:\nYeah, definitely. So I think fundamentally it all starts with this, right? We support millions of users every day. And to be able to do that effectively, we need the platform, we need the information and services on it being reliable, resilient and secure. You can't have accounts and personalisation without this fundamental infrastructure. And-and so it's super duper important. And I think it also touches on something that's been implicit to what we've been discussing throughout, which is about retaining user trust. And that is inherent in how we need to build the account, that's inherent in how we do personalisation, but it's also inherent in just being available, accessible and accurate. \n \nAnd you know, we think about the sort of the premise of the work that we're doing now to increasingly personalised GOV.UK, right? We start from the premise of like, well, people's expectations have changed. They think about how they interact with you know, like Citymapper or with Netflix. And-and so our premise is that why should, why should the user experience of interacting with government be any different? That's the starting premise, but for us, it--trust takes on an extra important angle, and this is where having that infrastructure of content, of the platform, of availability is so, so important.\n \nVanessa Schneider:\nYou're so right, you're so right. But, yeah, obviously what's coming through through all of this is really that it's all about iteration. I mean, trying out new concepts is a part of iteration, isn't it? Like GOV.UK accounts is building on things that already exist. But one of the bigger questions really is the: how everything that we're doing right now supports what the rest of government is doing. So we talked with Anna Sherrington, who is working on that objective within the GOV.UK team.\n \n[Start of vox pop]\n \nAnna Sherrington:\nHi, my name is Anna Sherrington and I'm the Lead Delivery Manager at GOV.UK and I'm responsible for supporting the government priorities of the day objective. What that means in practise is that I work with a number of multidisciplinary, highly-skilled teams to ensure that GOV.UK is responsive to the issues of the day and that we are the source of the government is saying and doing and what it means for people day to day. \nSo there are 4 teams working on this objective at the moment, 2 are concentrating on coronavirus, 1 on Brexit and 1 on starting a business. This means we have around 60 people working on this objective. At the height of the pandemic, we had more people covering our coronavirus work and the team structure has been changing as the situation with the pandemic has developed. For example, last spring and autumn when things were very busy, we had a weekend and late evening support rota in place in order to support any updates as they happened. And although we don't have these rotas anymore, we still have the flexibility and the teams to support plans. So we have really adapted to changing needs for this objective. I feel very fortunate to be working with the teams I’m working with and very proud of the work we do every day. There's a very supportive culture within the teams and we have made it our priority to build resilience and flexibility with everyone's wellbeing at the forefront of our minds. And this has been crucial.\n \n[End of vox pop]\n \nVanessa Schneider: \nA lot has been achieved in the past year first of all, and it's important to recognise that. We've really managed to-to sort of scale up in a way that we are resilient.\n \nRachel Tsang: \nTalking about resilience and being able to meet the government's priorities of the day, I would completely agree with you, like it's been an extraordinary 18 months and it's super important that GOV.UK is, as the online home for government, is able to be able to be comprehensive and responsive to provide support for the government's critical priorities of the day. For-for the past 18 months, that's been Coronavirus and Brexit. And we've seen som,e we've seen some record levels of traffic. So I think during the pandemic we reached a peak of it was around 42 million page views at our daily peak. And that that is truly extraordinary, thinking about how the value and the importance of GOV.UK has grown over time. And I think what the last 12 to 18 months has shown us has really been the value of the value of GOV.UK as this critical source of truth, the value of collaborating across government, we've already talked about that, and the value of making sure that we're providing that trusted, accurate information and support to the millions of people that are relying on GOV.UK.\n \nRoss Ferguson:\nI am not surprised that given that people on GOV.UK are the sorts of people who will care about pixel widths on things like hover states and, you know, and and and punctuation to almost the pedantic degree - but I would never say that - that come, you know, a national, you know, emergency, an unprecedented event for for the UK and the world, that those people would rise to the occasion. You know, nobody wants a pandemic but thank goodness we had GOV.UK as a place that, you know, the civil servants, and GDS, GOV.UK and then across the government could all use to collaborate with one another in the creation and curation of guidance and services very, very swiftly. But also, you know, and then the public could be given a really clear steer on where they could go. \n \nAnd so I think that it's been interesting looking at the usage patterns we see, yes, an increase in the number of people overall coming to GOV.UK, but, you know, an increase in the regularity of those visits. So I think that that cross government collaboration that we saw come to the fore during the intense COVID period, paid off. And actually I think that it's, although we are glad that there's not the same urgency, I think that focus on collaboration does need to continue on now for and lots of aspects of running government, but particularly in that digital space where we're, we're good in the UK at digital government, but we're still not meeting our full potential. And so I think if we can keep that focus on-on good public services online, across government collaboration, I think that they, I'm very optimistic about the future for-for the digital government here, here in the UK.\n \nWe want to be doing more and we want to be doing better. And because that's what people here in the UK want us to do, and I think, you know, where you mentioned our, our blogs, podcasts, our code is all open. And we you know, we do, we share this so that our peers and other governments internationally also at the local level here in the UK can, you know, can can benefit from that and that we can benefit from their feedback and their scrutiny as well. I think that's-that's one of the things that I think the GOV.UK, GDS, UK dig-government digital does really, really well that that openness, that willingness to share and that drive to keep-keep doing better. And I think that that's what and that's what that gets me really motivated.\n \nVanessa Schneider:\nWe have now come to our final objective, is: be channel agnostic. So personally, I know we've done fantastic work in collaboration with third parties like search engines in order to link content outside of the confines of the website itself. I was just wondering, maybe Rachel, you can tell us about how such partnerships came about and how this has changed things for users.\n \nRachel Tsang:\nDefinitely. So I think we, unsurprisingly, are huge fans of-of collaborating. You mentioned that we've done some good work recently with Google to make sure that more GOV.UK content is available through-through rich search results. We also did some good work on the recent local elections as well. And so I think we start from the premise of wanting to collaborate and to think about how we can make more of our content more available. \n \nI think the broader objective on being channel agnostic, I mean, we know that users are increasingly accessing information through other channels. Right? Search engines or voice assistance and-and so on. I think we also know that in May of this year, it was around 67% of our users that were accessing GOV.UK on mobile. And we see that number increasing year on year. So the work that we've done so far is good. We're-we're responding to changes in user behaviour where possible. But this objective for this year is really about enabling that step change. So through coronavirus, all of our services were designed as mobile-first. But what we need to keep pace with technology. So this is thinking about exactly to your question, designing for provision for access to-to GOV.UK information and services beyond the website. And that's yeah, super exciting because I think it's-it's keeping it's keeping pace with the user needs and changing user behaviour.\nIt highlights how the 5 objectives that we have for our roadmap for the year, they're not, there's a huge amount of interdependency there. Right. We started out with the fundamental building blocks of being available, accessible, accurate. We build on with like supporting priorities of the day. We talk about personalisation. We talk about being channel agnostic. You put all of that together and like holistically that is about GOV.UK and enabling users to access information about government and services in a way that is tailor, that is personalised, that suits their needs. \nRoss Ferguson:\nGOV.UK's getting close to being one of the top five, most used to most visited sites in the, in the U.K., and it goes up that-that list every-every year. And so I think that people will always value there being a site that they can go to or certainly they will value that for-for many, many years yet. There have to be other other channels that you are able to benefit from the information and parts also the services that are on the GOV.UK platform. And because, again, you might not know that you you could benefit from that information and other services, other parties might usefully be able to suggest, OK, actually you need you need to know this from the government or actually at this stage in your transaction with us, actually government can is the best place to help you with this. \n \nAnd so I think that we want to explore those and call them partnerships, those and those crossover's a bit a bit more. Yes with some big household name technology companies, but also with groups that are involved in civil society. And this could be a national, it could be at a local level as well, and they are providing great support and services to-to their and their constituents, their members, their-their users. So I think there's a lot that we can do there. \n \nI think what cuts across all of these, whether you're using a voice assistant more, you're perhaps engaging with some citizens advice and service or information on BBC is that you want to know that that information from the government is-is-is quality, is reliable. And so I think that that's where the GOV.UK verification, the GOV.UK brand, if you like, can really, really be useful there. And that is new ground for us. It's exciting perhaps to be--have a presence off of our own domain. And, you know, you mentioned we've been talking about trust earlier on, whatever we do in this space has to be underpinned by trust. And to get that right, we'll do experimenting and we will, we will talk to users because that is what we've always done. And that will keep us right.\n \nVanessa Schneider:\nSo before we start to wrap up, I was wondering, what are you most excited for on this journey? Let's start with Ross.\n \nRoss Ferguson: \nThat's a tough, that's a tough question. I-I am excited to see what the, what the response to the account will be. I'll be interested to see the way when we--as we roll out across the whole of GOV.UK this year and how people will respond to that, whether they will see it as a good utility. I'm anticipating the feedback, anticipating it being positive. What-what I'm looking forward to most is, is the detail about what more it could do and about how it should interact with services. I think that will give us a lot to go on.\n \nVanessa Schneider:\nThank you Ross. Same question to you, Rachel please.\n \nRachel Tsang: \nI think for me this is going to sound incredibly broad, but I think it's the energy around the delivery that we're doing right now. Like, we've got a really clear vision and direction and we've blogged and can I say podcasted? We've podcasted about it. And I think having that honesty and clarity about what we're doing and being really open about it is super important. Right. And I think that buzz is we're-we're kind of generating that buzz out externally.\n \nBut it is also very, very much with the team that's delivering on GOV.UK. And that's super exciting. And-and we can, I--can I talk about recruitment? Because I know we're very, very, very keen for lots more people to join GOV.UK. And we've got super exciting vision. We've got a clear direction of travel. So we are recruiting lots and lots of different roles. So user researchers, data scientists, product delivery, design, technology. I would say, particularly in the technology space as we design the architecture we talked about we platforming earlier on and so worthwhile having a look at the GDS career site to see our live roles, have a look at the blog. Ross and I, we published a blog post on four tips for applying for a job on GOV.UK. And we're hiring with a particular focus on our Manchester hub. Indeed, both in--both Ross and I are based up North.\n \nThe only thing I would add with that: this is actually really exciting, I think this is important to both Ross and I is that we are investing in junior roles, right. We want to build our-our pipeline of talent and invest in the development of people. So I would say that this isn't just about recruiting at a senior level. We're looking at all sorts of roles and all sorts of levels. So please do come join us.\n \nVanessa Schneider: \nThank you to both of you for joining us today on the podcast, and thank you also to all of your colleagues who joined us to share their contributions to the GOV.UK Roadmap objectives.\n \nAs a reminder, we are currently recruiting across GDS, and quite extensively for the GOV.UK programme. So we invite you to look at our vacancies and apply if you’re interested in any of the opportunities. \n \nYou can listen to all the episodes of the Government Digital Service podcast on Apple Podcasts, Spotify and all other major podcast platforms. And the transcripts are available on PodBean.\n \nGoodbye.\n \nRachel Tsang:\nBye.\n \nRoss Ferguson: \nThank you very much. Goodbye. " ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_319p7nu_1200x628.jpg?s=f58d10fb5d337ea21460086445b1b981&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-31-the-vision-for-govuk-and-the-roadmap-to-get-there/" ]
  }
}
