{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #32: Technologists at GDS | Government Digital Service Podcast" ],
    "summary" : [ "We talk coding, solving common problems once and share some of the exciting challenges our developers, engineers and technical architects are working on.\nThe transcript for the episode follows:\n-------------\n \nLouise Harris:\nHello and welcome to the Government Digital Service Podcast. My name is Louise Harris and I head up the Creative and Channels Team at GDS. In this episode, we're talking about our wonderful technologists. The Site Reliability Engineers, Technical Architects and Developers who work in multidisciplinary teams to engineer solutions to our complex architectural needs, evolve our infrastructure and tooling to keep us resilient and online, and develop digital products and services used by millions of people across the UK, and that are emulated by governments around the world. \n \nTechnologists are a mainstay of how we help government transform and tackle complexity for users. Think about GOV.UK: it's actually 50 front and back end applications that are independently hosted and maintained that enable us to host over a million pages, deal with millions of visits a day and fend off regular Denial-of-Service attacks. But thanks to our technologists, all our end users see is a single site they can access day and night to get the information they need from government. \n \nTackling that kind of complexity is not always easy, but it's definitely worthwhile. And it's what GDS is here to do. Today I'm delighted to be joined by Himal Mandalia and Louise Ryan to talk about the important role GDS technologists play. Louise, Himal, why don't you introduce yourselves to our listeners and tell us a bit about your roles.\n \nLouise Ryan: \nHello, I'm Louise Ryan, I'm the Lead Technical Architect and Head of Technology in Government as a Platform. I joined GDS just under 4 years ago and I joined us from the private sector where I worked in a digital agency as a Technical Architect.\n \nHimal Mandalia: \nAnd I'm Himal, I'm Head of Technology for GOV.UK, and I joined about 5 months ago, and I've been working in digital circles for about 6 years as a contractor in several roles, including Developer, Technical Architect and a Technology Advisor.\n \nLouise Harris: \nSo, Louise, it sounds like we've been lucky enough to have you at GDS for a couple of years now, and Himal, we've recently lured you over from another part of government. What is it that appeals to you both about working at GDS?\n \nLouise Ryan: \nOh wow. Such, such a big question. There's so much to like about GDS and working in digital in government in general, really. I always like refer people to the GOV.UK Design Principles and the Service Standard. So if you take a look at that, it's all about doing things the right way, about doing things for everybody, having a multidisciplinary team focussing on what the actual problems are, not solutionising. Building services, not just websites, so we continuously improve things. All sorts of that stuff, but also the tech we use is really cool as well. So it's, it's pretty modern stuff: lots of Infrastructure as Code, Continuous Deployment, Continuous Delivery and lots of automated testing. Yeah, I mean, I could go on for a long, long time, but this is a, you know I think it's a brilliant place to work and I love it.\n \nLouise Harris: \nAnd Louise, just, just for our listeners who are maybe less familiar with Government as a Platform, or what we call GaaP, can you just run us through a bit what it’s all about?\n \nLouise Ryan: \nSo Government as a Platform [GaaP], is a suite of digital services designed to meet common needs which can be quickly integrated into-into other service teams services. This helps reduce duplication, variation and it-it enables other digital teams to build their digital solutions much quicker, much faster, much more efficiently.\n \nIn terms of what the various services do, Notify is, is an extremely busy service. It's used by, I think around 4,700 other services. That's around 1000 organisations across the public sector using it. So it's scaling at around 120 new services joining every month. So that is, that's pretty big. So in, in, in terms of the last year, they've seen a-a 25 fold increase in volume of messages. And so that was a massive scaling challenge for the team that they, they just really smashed out the park. They're mostly hosted on the PaaS, which is really cool, and it's kind of asynchronous architecture so there's a lot of queues helping us process messages. You know it enables us to scale and enables us to retry when things break. So it's,it's good architecture. \n \n[GOV.UK] Pay take payments, take card payments for your digital services. It also, you can also use Apple Pay and Google Pay to pay for stuff. I think one of the main selling points of Pay is how much we care and test about the, the journey, the paying experience for people who use assistive technologies. So we really put a lot of effort into making sure it works really well for everybody. That's built mostly on Fargate, and, and uses some you know, it's got to be PCI [Payment Card Industry] compliant, so it's a, it's a complex, necessarily complex architecture. It scales really well and it's been used by, I think, over 550 large services now, and it's processed over a billion pounds.\n \n[GOV.UK] Platform as a Service: you host your, you can use Platform as a Service to host your web apps in the cloud without relying on, without worrying about the infrastructure underneath. So you can build your app in Python, Ruby or Rust or pop it in a container and then push it up to PaaS. And there you go, you've got a running app in the cloud. Also provides a bunch of backend services you can use. So backend services means databases like PostgreSQL, things like ElasticSearch or queue services like simple queue service from AWS. That's, that's the scale of this is, is, is very impressive. It's being used by just over 121 organisations and between the two regions in London and Ireland that it's hosted in, it's hosts, it's running around 2,800 apps at the moment. And they're processing an amazing amount of incoming requests: so we've got an average of around 300 requests per second coming through those pipes. So that's quite cool.\n \nAnd then we've got the Design System and the Prototype Kit Team. The Design System look after GOV.UK frontend, which is that set of styles, patterns and components that other teams use to build their frontend. What's really important about those patterns and components is that they've been researched extensively and tested extensively across a vast array of digital devices and operating systems and with real people and with assistive devices. So we can be sure that they're, you know they're, they're working. So obviously we do that once so service teams around the country don't have to keep doing that work. It really is an open source project as well, the Design System. It actively seeks contributions from the design and frontend communities a-across, across government. And that's, that's really cool. And it's yeah, it's used quite. It's, GitHub tells me it's, it's in use by over 2,600 other repositories.\n \nLouise Harris: \nThat must be so cool to be involved in work that’s being forked off, and used in so many other contexts. Is it safe to say that there’s some stuff that you can get done at GDS that maybe you can’t get done elsewhere?\n \nLouise Ryan: \nYeah, I think it is. We are at the centre of government, being part Cabinet Office. If we're not going to do it in the centre, then it's not just gonna magically happen elsewhere in government. Those tools exist so other service teams can-can really benefit from having things done once really well in the centre so they don't have to keep reinventing that wheel. They can-they can just get started really quickly and benefit from all that work that we've done really well just once. \n \nLouise Harris:  \nAnd it's not, it's not just teams kind of in and around the UK government that are getting to benefit from that approach either right? Some of our code has also been forked by international governments to do their own thing too. What do you think are some of the sort of GDS led technology success stories out there? \n \nLouise Ryan: \nOh, wow. Yeah. So there's lots of examples of this happening. So take, for example, Notify. That's been forked and used by the Canadian government and the Australian government to create their own notification platforms. And, you know, t-t-that doesn't just-just happen and then stop. We continue to collaborate with those teams working on this platforms so we can all learn from each other. And it's not just about the tech either - that's really important thing. So obviously Notify have developed a whole bunch of operational practices and services around the service itself. So we share, we share those as well and you know, help people figure out what works, what doesn't.\n \nAnd it's not just Notify. So PaaS. PaaS works with, that's Platform as a Service, they work with their equivalents in-in Australia and, and the US government to share best practice. And then you've got the wonderful Design System that's been forked by a lot of countries. And not just other countries, but other authorities within-within the UK. So, for example, my own council, Wiltshire Council, they forked the Design System and used it to build their own website. But in terms of other countries. I think it's used in Australia, New Zealand and Canada, and the Netherlands. So, yeah, massive, massive success stories of-of re-use of our, of our hard work.\n \nLouise Harris: \nWow, so lots to be proud of. And Himal, I guess same question to you - what is it that drew you to GDS?\n \nHimal Mandalia:\nI think GDS is sort of interestingly positioned right at the centre and, and being sort of highly visible, like it can be an exemplar of what good, sort of long live teams, services looks like. So all of the things that are articulated in the Service Standard, in the Technology Code of Practice, you know, we-we work to those ourselves since we-since we developed them. But I think what we've quite clearly put out very recently in the GDS strategy for the next 3 years, the core 5 missions, particularly the ones around GDS being the place, essentially the shop that builds and runs the common components and platforms that the rest of government build services on top of. I think that is now clearer, clearer than it's ever been. And you know there's something that, for me anyway, when I was thinking about a bit of a career change last year, drew me and I thought: this is a really interesting time to come in and join. There's a-there's a real sort of transformation of energy in the air again. \n \nLouise Harris: \nSo it’s great for our teams to know that their work is having an impact not just here in the UK and for our users, but also around the world as well. And Himal, like you say to be part of that, what did you call it, transformation buzz? I think that kind of flies in the face of the idea that jobs in the civil service are sort of slow or old school right?\n \nDo-do you think there are other misconceptions about what a technology job in government might be like, versus what it’s actually like at GDS day to day?\n \nHimal Mandalia: \nI think what's interesting here is, you know we're about a decade into a transformation journey that's bringing in the sort of technology practices around Continuous Delivery, being Agile, having autonomous self organising teams and a lot of the-the technology driven processes that surround that in the ways of working. And I think it's easy for us to lose sight of the uneven distribution and maturity of this across government. So I think it's, I think it's interesting because government can't be seen as a, as a monolithic thing. I think if you're outside and you're thinking of you know, if you're, if you're a Developer or a Reliability Engineer or a Technical Architect and you think, you know you want to work in government, you want to work in the public sector - and that could be local authorities as well of course - it is, it is a very unevenly distributed landscape of maturity. I mean, I would say we're pretty much at the, at the higher end of the maturity curve at GDS here, of course, because what we've been doing for the last decade. And I think what's exciting for me as someone that's worn many hats and played different roles in this sort of journey is: it's, it-it can be, it can be rewarding to work somewhere where a lot of the basic capabilities, the fundamental enablers are already in place and you can deliver value and work with teams. If you consider GDS, then you would find something that's much more a-akin to a sort of modern sort of conventional tech company.\n \nLouise Harris: \nI think that digital maturity curve point is such a good one. Because yeah, with almost 10 years under our belt GDS has definitely been through a lot that foundational and capability building stuff that some other organisations might still be grappling with, and I think that gives us a kind of view on what their pain points are so we can shape products and platforms that are gonna meet their needs at different parts of the curve.\n \nAnd I think that actually leads us quite nicely to the next thing that I wanted to chat to you both about. \n \nSo our regular listeners will know that earlier in the year, we launched our new strategy and centred it around 5 key missions. If you missed it, check out our May episode of the Podcast where you can hear our Chief Exec, Tom Read, talk more about that. \n \nBut in essence I suppose, over the next few years, our focus boils down to this: helping to create services that just work for the user. So no matter how complex the underlying systems are or how much these people know about government, we’re going to make services that just work. \n \nSo mission 4 in our strategy that’s looking at how we can make sort of effortless for departments and agencies to digitise their services by looking at centrally-developed common components. \n \nLouise, maybe you can tell us a bit about what’s happening in that area?\n \nLouise Ryan: \nI mean to sum it up, you know, we've got a bunch of really cool services that are already providing value. So as a piece of work, that's ongoing to just make sure they keep delivering value and can scale with the increasing usage that they experience.\n \nWe're also you know, obviously building on top of that and looking what else we can do to meet user needs. One exciting part of that is the work we're doing in the collecting information from users team. So that team is well, I think it sums ups, sums up its work. It's...you know, we want every single form that's published on GOV.UK to be accessible. That's huge. A lot of the forms on GOV.UK at the moment are published in PDF or, or other document formats. They present challenges, especially to-to users who, who need to use assistive technologies such as screen readers or magnifiers. And actually completing PDF online is-is no easy task either. It's pretty difficult. Whereas completing an online form is a much better user experience and hopefully much more accessible. So it's, that is a, that is a massive problem space, and a really interesting one. And we're just entering an Alpha-Alpha phase with that team. So it's, yeah, so it's very exciting challenge we presented with ourselves in, in GaaP.\n \nLouise Harris: \nAnd I don't think we can really kind of understate the scale of that challenge, because I think everybody around GDS we treat PDF's a little bit like our, a 4 letter word. But the team blogged recently and I think equated that if, without doing this work, if we were just relying on the existing kind of form building systems that were out there, it would take government about 70 years just to convert the PDF's that already live on GOV.UK, which are obviously growing, if not every day, then certainly most weeks. So super important work. Was there anything that came out of the discovery that-that surprised you folks?\n \nLouise Ryan: \nI think-I think you've, you’ve hit the nail on the head. It's the scale of the challenge. And it certainly surprised me. But when you, when you think about it, it's, it's not that surprising, actually, because there's teams right around government that don't have the digital capability to do anything else. This is, you know PDF's and other, other document formats are the tool they have, so that's the tool they, they have to use. So, again, GaaP is uniquely placed in the centre of government to do something about that. And that's, that's hopefully what we'll be able to do in the coming years.\n \nLouise Harris: \nSo it sounds like through Government as a Platform right now, we are already kind of solving common problems at scale. But, but what about - and sorry to make you solutionise on the fly here Louise, because I know that everything we do is evidence based and user led - where do you see the next, beyond the collecting information from users work, do you see any themes emerging about where that next common problem is that GDS might want to solve?\n \nLouise Ryan: \nYeah, so we are doing some research on this, so, but I don't want to pre-empt that, but I'm, I can, you know, there's, there's stuff we already know that, that service teams have to just keep doing over and over again. There's you know, there's thin--complex problems that don't seem complex until you really dig into them. So things like a postcode lookup. Service teams have to keep doing that, is-is there a way we can, we can provide a solution for that in the centre?\n \nLouise Harris: \nAnd that's all such important stuff right if we, if we want to deliver the transformation at the scale that we, we all want to see.\n \nOne of our other central focuses is going to be this idea of joining up services so they solve whole user problems even if that means spanning multiple departments. Himal, I guess - as the platform for government services - GOV.UK is going to be pretty fundamental to how we get that done right?\n \nHimal Mandalia: \nYes, so it's interesting because people can get a little bit, a little bit confused about what we mean when we say GOV.UK. So if we think about it as sort of layers of the onion: the sort of widest layer you have, what is known as the GOV.UK proposition. So that, as a user, you know, you go somewhere, you see a website, you see something that's branded with the crown and the stylings around that: that's a GOV.UK site. But it could very easily be a transactional service you interact with for--to do ev-everything from paying your taxes to a prison visit to renew your driving licence. And those are all on the GOV.UK proposition. So they feel like a single website as you move across them. And we have mechanisms like the Service Standard. If you work to that, that means that you're going to end up with a pretty joined up journey.\n \nBut for me, the-the-the layer of GOV.UK that I work on and the technology I'm responsible for, that's the GOV.UK content. That’s-that's the main page that you come to when you go to www.GOV.UK. That is a large platform with hundreds of thousands of pages of content that we-we hold and a set of tools that we run for thousands of users across government to create, to offer that content, to edit it, to manage it, including our internal content teams here. And we also run technology, which, of course, delivers all those pages so they-re, they're available globally.\n \nLouise Harris: \nAnd right now, a lot of that content is quite static right? Because we need to publish it and serve it quickly and then hold it in the cache and serve it up again over and over.\n \nHimal Mandalia: \nYeah, exactly. GOV.UK delivers a lot of content right now, but it's usually...it's relatively static, it's relatively flat content, it's pages. And one of the things that we're exploring now is if you have an account, if we, based on consent, if we know some things about you - your approximate location or other attributes we have - we may be able to tailor that content. We may be able to personalise it, to put content in front of you that's relevant to what you're doing. Maybe even be proactive, send you personalised notifications with of course, a full consent model and opt in and easy opt out around that. \n \nBut in order to do that, in order to personalise the content or even have content chunked up so it can be contextual, so a different snippet is mixed in based on a tag or some piece of data that we're using to construct that, that, all of that will require a fundamental re-architecting of GOV.UK's applications. So the front end applications need to change dramatically in order to stitch together that content in real time. The way that content is stored, the way it's structured, the schemas that are used to determine how that content is broken down into small snippets, how it's tagged, the taxonomy - all of that needs a rethink and redesign. And the publishing tools themselves, the tools that are used by the service essentially that is used by the content creators, that experience they have in not only creating content, but the taxonomy they're applying to it, how they're tagging it - all of that needs a rethink and a redes-redesign as well.\n \nSo that sounds huge and it is. But it's not a sort of big bang, all at once programme of work. This is an incremental and iterative stream of work, like, like how we do everything, which is going to, which is going to be done bit by bit. The interesting challenges that we are talking about rebuilding the ship while there are people in it bit by bit. And this is very much that Ship of Theseus metaphor right? We're replacing the planks, and when we're done, it's going to be a very different looking ship. It's going to be a ship that does very different things. But we're not even completely clear exactly what it looks like, but if we really extend the metaphor, we do have a good idea of where we're going.\n \nLouise Harris: \nAnd that personalisation agenda that you talked about there Himal, it sounds to me like it's going to ma-make [laughs] the site work a lot harder. I mean, we're already processing thousands and thousands of kind of transactional services, but this sounds like a real shift. You talked about the GOV.UK Account functionality as well, which obviously we piloted last year and had, I think, about 50,000 people sign up for that as part of the Brexit Checker, Brexit Transition Checker. We’ve obviously been iterating that software ever since. Can you tell us a little bit about where we’re at now with Accounts?\n \nHimal Mandalia: \nSo what we've done to test the hypothesis with the Brexit Transition Checker and the-the prototype account functionality, which which has been amazing, which has been an amazing learning experience because we have had, as you, as you mentioned there, 50,000 people sign up, but because we're working off of an architecture and an infrastructure set up that doesn't support this yet, we have done those as, as a separate applications, which we've used, we've hosted in, in Platform as a Service, in PaaS actually, one of the products Louise mentioned and is responsible for which is, which is great, just to be able to use our own tools for things like this. \n \nBut in order to have that as part of GOV.UK's core architecture, to support more of that personalisation, that's what we do need to have that re-think, that re-design and that re-architecting of all of our frontend apps and our publishing tools and the content platform.\n \nSo I'm currently working on the future platform services and architecture strategy for GOV.UK. So all of the things I've just mentioned there are going to be sort of written up in plain language around what we're thinking of. And I-I view GOV.UK breaking out into a few really simple long term value propositions or services and platforms, and they are: presentation, or the frontend, what you experience as www.GOV.UK when you go there; the publishing service or tools that our thousands of users across government use; a content platform, that engine, that heart of content that does all the heavy lifting; and underneath all of that, the infrastructure platform that runs the applications, the databases, all of those things. And really looking to put an emphasis on the content platform, that engine of content and trying to move to a world where we can almost think of GOV.UK as a, as a sort of headless machine, that it does have a frontend, but really the most prominent part is the functionality that does all the lifting. Because in future there may be an app, there may be other ways, we may be syndicating content - these are all things we want to test. But having the flexibility and the ability to do that is, is vital because the way people, the way people interact with services online is quite different now to how it was a decade ago, and so we need to move on and have a much more Agile, much more flexible architecture that lets us meet users where they are rather than having a, just a website. You know we don't, we don't live in that era anymore.\n \nLouise Harris: \nSo sounds then like we want to shift to a, a bit more of a channel agnostic approach then. Louise, you’re a Technical Architect, what’s your take on Himal’s just said? \n \nLouise Ryan: \nYeah, it's-it's a bit daunting actually [laughs]. Himal won't mind me saying that. You've got, it's a, it's a big job to re-architect such a big and important platform as GOV.UK. It's, it's really exciting. And it, you know, it's, yeah, you won't be on your own Himal. You know, the rest of-of GDS is-is very interested in this work as well, and there's crossovers right? Government as a Platform is very interested in, in what's happening with GOV.UK Accounts, because we might be able to use those features in our services. So for example, [GOV.UK] Pay: when someone's paying for something, if they're signed into their account, maybe they can save that, that payment method if they want to. Yeah, just solutionising on the fly, because obviously we'd need to research that to see if it was a, a thing people would be interested in. But, but obviously we you know, we're keeping a very close eye on what, what Himal's up to and, and wanna be part of it where we can.\n \nHimal Mandalia: \nI-I 100% agree with that, Louise. I think the thing here is, I think the, I think what we're doing with our, with our Digital Identity programme, with the GOV.UK Accounts, it really is, it really is that golden thread. It is the thing that ties all of this together. It does, it does offer the cohesion between all of our products and services. So we blur the boundaries between them. And I think notifications, payments, the publishing, the content delivery, all of that, and then, and then you bring into that all of the services across government as well, they're all tied together through your account. So what you end up with ultimately is a completely seamless experience, a citizen shouldn't need to, shouldn't, you shouldn't, it shouldn't even occur to them that a separate group of people delivered this piece as opposed to another bit.\n \nLouise Harris: \nAs you say some kind of huge, huge programmes of work coming up, sounds like we're probably going to need a few-few additional crew. If-if people are interested in getting involved in this, where-where can they go to find out more?\n \nHimal Mandalia: \nSo if you search for GDS careers, you'll find our careers site. We have a, we have a campaign going to hire Developers right now, but more will be launching soon. I'm particularly keen on trying to see about bringing juniors in. We need, we need more, we need more juniors into to-to-to not only be working with our teams, but also to be engaging in things that we've done previously at GDS like firebreaks, where you get that little bit of free time to experiment and come up with things. And of course, there will be a range of more senior roles as well. They'll be, they'll be more roles going out across-across the board at all levels.\n \nLouise Harris:\nSo there’s lots of really great new job opportunities coming up across GDS. For people who might be interested in that, what would you say the culture is like in our teams?\n \nHimal Mandalia: \nI think having, having just come through a crisis, or crises, where we were highly visible and doing a lot of work to surface essential guidance around Coronavirus, we've had to organise ourselves around mission focussed teams, which has meant a-a lot of the work that we planned and even written about, I-I think I've, since starting you know, I've dug into some of the blog posts that we put out in 2016 and 17, amazing planning around publishing tools and platform that we were not able to pick up or continue because, because of emergency work, urgent priorities around Coronavirus and some of the work around Brexit as well, those are all things we can return to now. \n \nH aving gotten to know my technologists community over the last 5 months, I think there's a real appetite to return to some of those longer term value streams - so working on services, being in long live teams, and what I'd mentioned earlier around things like a publishing service and content platform. You know, really giving groups of people, not just Developers, but Designers and everyone involved in a multidisciplinary team, that agency and that long term ownership over a problem and o-o-over, over the improvement of something. So I think some of that excitement is coming back now. And so, yeah, it's, it's a great time to join. It's a very active community.\n \nLouise Ryan: \nI-I don’t think I’ve shouted from the rooftops enough about how important long-lived autonomous teams are. They really are the, the reason that Government as a Platform has been suc--as successful as it has. There, there's people that are really committed to these services, really understand the problem spaces inside and out and just, yeah, deliver amazing results and outcomes as, as a result. And yeah, this is, this is not just from a technical perspective that you know, we-we-we couldn't build the tech we build without the help of our, our user-centred design colleagues and product and delivery.\n \nWe are...the selling points from me I mentioned earlier is-is how we work in teams, as a unit, how we figure out with things that we-we should be working on, making sure they are the things of most value and really understanding the problem space and then developing the tech to solve those problems. And that, that, that way we work is to me as a technologist, is, is very compelling and, and reason alone to join but...Also we use some really modern tech - so our programming languages in GaaP are, are Python, Java, Node and then we've got some, some other programming language such as Go in the mix, but we build stuff on, on really modern technologies. So a lot of stuff on Amazon Web Services. As I said, we use modern practices like Continuous Integration, Continuous Delivery, we do a lot of automated testing so we can deploy with confidence multiple times a day to make sure, yeah, we're getting our stuff out there quickly and getting people to actually use it as fast as possible.\n \nAnd hopefully that's a, that's a compelling story about why GDS is a really good place to work. I didn't actually mention the culture in, in all of that. And I think that's what you actually asked me. But the-the agile culture here is-is to be open, to be transparent, to share what you're working on with others, and that can be through show and tells, through pairing, through having your code open in, out there on GitHub. I really, I really like the culture at GDS. It's a kind of, you know, when I was in the office, come up to my desk and ask me anything kind of thing. No question too silly. Yeah. I think it's a, it's a lovely place to work.\n \nHimal Mandalia: \nYeah, I think the only, I think the only thing I'd add and Louise said it all there really was: you know, if you a technologist that's passionate about open source development and the technologies that were mentioned there and you, if particularly if you're old enough, you have friends like me who are old enough to remember when open source was very much the underdog, and you know, we were, we were all sort of part of a rebel alliance trying to-to do a good thing. It's amazing that this is now converged with trying to do good for the public as well. So. I could, I couldn’t think of a better argument to sell it than, than that: you get to use cool tech, do open source stuff to do good for tech and do good for the public. I mean, what more do you want, really? And we pay pretty well as well.\n \nLouise Harris: \nThat's pretty cool, and if people want to find out about our code, which obviously we publish openly where we can, where can they find that?\n \nLouise Ryan: \nAll our code is published on GitHub. So you need to go to GitHub. And it's Alpha GOV.UK is our organisation. It's all in there. I can't remember how many repos that there are, but there's a lot [laughs].\n \nLouise Harris: \nOkay well if anybody’s got a quiet Saturday afternoon, and they fancy digging into literally thousands of repos, head over to our GitHub to do that. \n \nYeah so there you have it, an inside look into how technologists at GDS are doing the hard work to make it simple for users. Some seriously impressive and exciting stuff, and if you want to stay up to date with what's going on, please do follow us on the GDS blogs and check out our GitHub. A reminder that if you're a Developer, Site Reliability Engineer or a Technical Architect who fancies a new challenge as part of a great team doing work that impacts literally millions of people, you need to search GDS careers because we're hiring now. \n \nLouise, Himal, thank you so much for taking the time to come on and chat to me today. I don't know about anyone else, but you have been left with the impression of our technologists acting like a bevy of swans, calmly and gracefully gliding across the surface, totally belying all of the hard work and energy that's happening just underneath to make sure we're headed in the right direction. And thank you to you, our listeners. Remember, you can find all episodes of the Government Digital Service Podcast on Apple Music, Spotify and all major podcast platforms. And our transcripts are available on PodBean. \n \nGoodbye.\n \nLouise Ryan: \nThank you, bye.\n \nHimal Mandalia: \nThanks everyone." ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_329ye1a_1200x628.jpg?s=8a400b1f515bdd66575039c2951168b4&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-32-technologists-at-gds/" ]
  }
}
