{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "GDS Podcast #11: On clear writing | Government Digital Service Podcast" ],
    "summary" : [ "A year on from launching the GDS podcast, senior creative writers Angus Montgomery and Sarah Stewart talk about their jobs. The pair discuss their career paths and the role of writers in government and how clear writing can help people to do their jobs better.\nThe transcript for the episode follows:\n------------\nAngus Montgomery: Hello, and welcome to the latest episode of the Government Digital Service podcast. My name is Angus Montgomery and I’m a Senior Writer at GDS. And for this episode of the podcast, I’m joined by my colleague Sarah Stewart. \n \nSarah Stewart: Hello. I’m also a Senior Writer at GDS. \n \nAngus Montgomery: So our voices might sound quite familiar because both Sarah and I, with our colleague Laura, have been on all the episodes of the GDS podcasts that we’ve done so far and as part of those episodes, we’ve been interviewing people across GDS and across government about their work and talking about the things that they do to help transform government and to build digital services and to make things better for users. \n \nAnd, we realised that we’re nearly a year into this podcast now, I think this is our 11th episode, and we haven’t actually properly introduced ourselves and talk about what we do, and how our work contributes to digital transformation across government and helps everyone in GDS and across government do their jobs better. So that’s what we intend to do with this podcast.\n \nSarah Stewart: And we’re also going to be sharing our top tips for clear writing, which we’ve put together over the past 3 years of working at GDS, so we’ll be sharing those with you as well.\n \nAngus Montgomery: Yeah, so Sarah and I, just as a bit of background, we’re both Creative Writers at the Government Digital Service. We both joined on the same day. Can you remember what day that was? Testing you. \n \nSarah Stewart: It was May 23rd. \n \nAngus Montgomery: I thought it was the 22nd. \n \nSarah Stewart: Strong start. \n \nAngus Montgomery: Sarah’s memory is better than mine. May 23rd 2016. And we work as part of a team called the Creative Team in GDS. \n \nAnd we’re in a team that also has people like filmmakers, production experts, graphic designers, Graham Higgins, who’s also in the room with us, who is doing the production of this podcast and is one of our filmmakers, and audio production and all sorts of other amazing things as well.\n \nAnd our role, the role of our team, is to help everyone in GDS, from Director General down throughout the organisation of all parts talk about their work, communicate their work and explain what it’s doing to help government work better and to make things better for users.\n \nSarah Stewart: Don’t sell us short, Angus. We also write at a ministerial level as well. So it’s from Minister down.\n \nAngus Montgomery: So, yeah what we want to do with this podcast as Sarah has already talked about, is explain a bit about our jobs and what we’re here to do, talk a bit about writing and communication and why it’s important and to give our ten top tips, pieces of guidance, principles, whatever it is that you want to call them about how to write and communicate more clearly. \n \nSo that’s what we’re going to do. But before we kick that off...Sarah, can you tell me a little bit about what your background is and how you came to work at GDS?\n \nSarah Stewart: Well I don’t know how far we should go back - but at school, the only 2 things that I thought I was good at and enjoyed were English and rounders. And there’s not much you can do with rounders, so I pursued English. I read English at university, came down to London, did my postgrad down here. Became a journalist. Hated every second of it. I was a business journalist and it was a generally terrible experience for me. Although I did pick up some useful things, like always carry a notebook and pen with you, which I still do to this day. \n \nAngus Montgomery: How’s your shorthand?\n \nSarah Stewart: It is non-existent. And also about libel as well, that was an important lesson.\n \nAngus Montgomery: Oh yeah, that’s very important.\n \nSarah Stewart: And then I was lucky enough to get a job working at Shelter, which is a housing and homelessness charity and they also campaign for better housing rights and conditions. And I was a Content Writer and Producer there, so I launched their advice Youtube channel, I edited their advice on their website, I launched their advice sound clips, and I edited their blog as well, of case studies.\n \nAnd then after a couple of years, I found out about the job at GDS.\n \nAngus Montgomery: What attracted you to GDS?\n \nSarah Stewart: Funny story actually, I had never heard of GDS before applying. I was at Shelter and someone that I worked with left the job advert on my desk with a post-it that said ‘this is the kind of job you can go for in a few years time’ and I thought ‘Screw that, I'll apply for it now.’ \n \nIt wasn’t really my ambition to work in government, but it kind of worked out well. I really enjoy what we do now. But you did know about GDS before you joined.\n \nAngus Montgomery: I did. So my background was similar in the sense that I was a journalist, I hadn’t worked doing anything else actually, I’d been a journalist my entire career\n \nSarah Stewart: And you liked it?\n \nAngus Montgomery: Uh, yeah. I mean like...Liked is not a strong word.\n \nSarah Stewart:...liked it more than I did? Did you cry in the loos everyday like I did?\n \nAngus Montgomery: No, that’s really unpleasant and horrible. I’m sorry that you went through that. But there might have been some loo crying at certain stages. I think the thing about journalism, as you sort of implied, is that when it’s good, it’s really fun and it is a great industry to work in. \n \nAnd you can do lots of different things, and lots of exciting things and meet lots of interesting people. It is really really tough. And when it’s bad, it is very very unpleasant and a difficult environment to work in. \n \nSo I was working for a website called Design Week, which covers the UK design industry. Around the time I became editor was around the time that GDS was setting up and launching and getting a really big profile. And was winning awards like a D&AD black pencil and the design of the year awards, so obviously it was a really really big design story. And I got to know some of the design team in GDS, and I was you know obviously, while that was happening, an observer of what was happening, I was reading all the blog posts, I was looking at all the posters and all the other communication that it was putting out \n \nSarah Stewart: Oh my god, you’re really putting me to shame.\n \nAngus Montgomery: But GDS was a really big story, it looked really interesting to me, was hugely appealing in the sense that of, something similar to what you said, this was an organisation that was serving the whole nation. \n \nAnd an organisation that was very clearly there to do something good. It was there to help government work better for users and for everyone, for civil servants and everyone. Being involved in something like that was really really appealing, and remains really really appealing, it’s why I still come to work everyday.\n \nBefore we get onto the kind of, the writing aspect and the top tips, the kind of the educational part of this podcast, what is it that you enjoy most about working at GDS and what do you find most satisfying?\n \nSarah Stewart: That’s a good question. I’m lucky to say that they are quite a few things that I enjoy. I like the fact that when I write, and that can be if I’m drafting a speech or writing a presentation or helping someone edit a policy document or write a ministerial forward, that I’m actually doing something that’s important to the idea of democracy, because in order for people to make good decisions, they need to know what the facts are. And I like that I can ask the difficult questions that get to the facts, I like that I can challenge people and say ‘no, you need to include more detail’, I can say ‘you should leave this out because it’s maybe not the right time to come out and say this particular thing.’\n \nI love the feeling when someone, maybe this is a bit self-indulgent, but when someone is delivering a speech that I’ve written, it’s like the best feeling in the world, because I’m naturally introverted and I know that these words aren’t my words, but when a joke goes down really well and the audience laughs or when you, you know, when the key message has been hit and people understand it and an action is taken, that’s massively rewarding. \n \nBut there’s... I get so much pleasure from just the act of writing. I mean when I’m not doing it at GDS, I’m doing it in my spare time. There’s just something really satisfying, I guess like mathematicians, when they do a sum correctly or they workout a formula and it and it all works out wonderfully well, it’s writing a sentence that flows beautifully and is truthful and you know, moves people to do something or to consider something in a different way. \n \nSo I don’t think there’s really one part that I don’t enjoy. I mean I hate meetings, but doesn’t everyone? What, how about you?\n \nAngus Montgomery: I think something similar. Although I’m kind of less wedded in a weird way to the craft of writing. I mean writing, it’s not something that I don’t enjoy but I kind of, I don’t get a huge amount of pleasure in a sense from, like constructing a sentence or the kind of technical aspects of it. But the thing I enjoy most is, I really like the idea that writing is structured thinking. \n \nSo when you write something down, you need to be really clear and it needs to be really structured and it needs to make sense. And so the thing I get most satisfaction from is, when you’re working with someone to help them explain a difficult concept that can exist maybe only in their own head, and they’re explaining it in a way that they can’t fully articulate, you’re just about understanding it.  And there’s that breakthrough moment when you write something down and you show it to them and they go ‘yes, that’s exactly what I’m trying to say!’  \n \nSarah Stewart: Yeah.\n \nAngus Montgomery: ‘That makes total sense, that’s exactly what I’m trying to do’. That to me is the really satisfying part of this, is like getting. And I suppose corollary to that is the fact that we work with really intelligent, really nice people as well, but really super intelligent people that are really driven and really focussed on what they’re doing, and have these really complex things going on in their heads.\n \nAnd maybe because they are so close to that work, the aren’t always capable or don’t always find it easy to communicate as clearly as possible. And that’s really our role is to go in there and say, ‘right, let me inside your head, let me inside all those really deep technical details and All the different things that you’re thinking about. And I will help you communicate this clearly’. \n \nSarah Stewart: Yeah.\n \nAngus Montgomery: And like that to me is the really satisfying part, it’s like being the bridge between this really intelligent person who has a really complicated idea, and the person who needs to understand that.\n \nAt the risk of asking I suppose a cliched question, tell me about your day-to-day, and what it is that you actually do, and what it is that we do and what we write and produce?\n \nSarah Stewart: Yeah, so we write a whole host of things. So there’s obviously the kind of straightforward written content, so blog posts, press articles, op-eds. I tend to...\n \nAngus Montgomery: What’s an op-ed?\n \nSarah Stewart: Oh sorry. Good question. It’s, well actually I was, I…\n \nAngus Montgomery: I don’t know the answer to this actually, which is why I…\n \nSarah Stewart: It’s either…So there are some people who think it’s an opinion editorial. So someone just speaking about a subject that they know. Other people think that it means ‘opposite the editorial page’ But basically what we take it to mean, and what I’m doing I think, is writing an opinion piece so…\n \nAngus Montgomery: For a newspaper or magazine.\n \nSarah Stewart: Yeah for a newspaper or a magazine. And so I’ll be writing on behalf of somebody, I don’t think it’s any secret to say that you know in government, there are speech writers and there are other...people like us exist in order to kind of help Senior Civil Servants communicate. \n \nSo, I tend to specialise in speeches but we also write presentations for people across GDS, we might be writing forewords for strategy papers, we might be editing, you know, policy documents, but that’s a very small part of what we do I think. And we also write scripts for animations and films and do things like podcasts.\n \nAngus Montgomery: So we wanted to give you ten principles that help us communicate clearly, and that we think you might benefit from as well. And some of them are you know, things that might seem obvious and some of them may be are a bit more left field. But they are all things that we kind of, help us to our day-to-day jobs. \n \nSo without further ado, Sarah do you want to give us point one and tell us a little bit about it?\n \nSarah Stewart: OK so my first principle is: Establish ‘The Point’. Before you write anything, whether it’s a speech, a blog post, a presentation, a love letter – establish what the point of your writing is. And ‘The Point’ comprises two parts – and I’m thinking of trademarking this actually, it’s: What you want you want to say and why it needs to be said. We’ll come onto audience in just a second. \n \nSo once you’ve established what the point is, write it on a post-it note, stick it at the top of your doc. It will be your guiding star. It will keep you relevant, it will keep you focused and if you can’t figure out what the point is, don’t write. Don’t agree to do the speech. Don’t agree to do the presentation. The chances are you’ll come up with the point at a future date, but if you’re really struggling to establish what it is that you want to say and the reason for saying it, just don’t do it. You’ll waste people’s time and wasting people’s time is a sin. \n \nAngus Montgomery: Point three of the point, I think. You’ve got what you want to say and why you want to say it but also who you want to say it to.The audience, as you mentioned,  is an important thing. You have to assume that the thing you’re saying is interesting to someone or to a group of people, and then you have to work out who that group of people is. Knowing that will help you work out the best way of communicating your message. It might be that the thing you want to say or write is best done as a blog post, or it might best done as a film, or best done presentation or it might be better to draw it as a picture and create a poster of it. Knowing the what, the why and who you’re trying to tell it to, will help you shape your message and the way you’re communicating your message. \n \nMy first point so number 2 of our principles is, ‘write it like you’d say it’. So I mentioned earlier about a big part of our role, or the main part of our role is to help organisations, this organisation, communicate in a human voice.\n \nTo me a human voice is the voice that you would use to describe something to a friend when you’re you know, having lunch or at the pub or at the park or whatever. Like if this is that thing about like, if you’re trying to describe a really difficult technical concept, then think about how you would explain it to a friend or to your mum or to you know, son or daughter or whatever it might be.\n \nAnd then write down the way that you would do that. So it shouldn’t be really that much difference between the written word and the spoken word. Although obviously you’ll have far fewer sort of ‘ums’ and ‘ahs’ and all those sorts of things.\n \nBut like a human voice written on page should sound like speech to me. So when you read something, it should sound like someone is saying it to you, someone is speaking to you in the way that, in a sort of slightly informal, kind of suppose, kind of friendly tone of voice but in a way that’s understandable and relatable.\n \nAnd that really helps you to, I think, get away from what can be a quite, there can be a formality about the written word, and I think that this is again, why some people find writing quite a sort of scary prospect, is it can feel like you have to use the longest most complex, most impressive words possible. \n \nAnd actually you really don’t. You need to use the shortest, clearest, simplest words possible just as you would if you were trying to explain something verbally really clearly. So write it like you’d say it, and the way, a thing that can help you to do that is, as you’re writing something down, read it out.\n \nDoes it make sense if you say it out loud? Does it make sense if you say it in your head? Does that article that you’ve written sound like something you would naturally say? If it does, then you’re broadly along the right lines I think.\n \nSarah Stewart: That’s a good tip. And it neatly links it my next point, which is ‘don’t try and sound clever’.\n \nEssentially what you want to be is clear and concise and don’t over do it. Don’t try and impress anyone because you are probably doing something that is impressive. You probably have all the vocabulary you need to express it clearly. Leave it there. \n \nThis reminds me of a good quote by the investor Charlie Munger. He said ‘if you want to be thought of as a good guy, be a good guy.’ So if you want to come across as smart, then be smart and explain what you’re doing. But don’t go out there having an agenda that you have to come across as something. It’s inauthentic. \n \nYou see it, particularly in academic writing. People who are so in that world become - it’s almost impossible to cut through what they’re saying. For example, my friend sent me the abstract of his book and his opening sentence was 58 words long with no punctuation. I could individually pick out what every single word meant, I knew the meaning of each word but in the syntax, in that sentence, I had no idea what was going on. And I was trying to give positive feedback and I said look I’m really sorry, I don’t know what it is you’re trying to say and he said: ‘Oh, well, it’s written for academics’ - well, presumably at some point you want other people to read it! \n \nAngus Montgomery: Sometimes in this organisation as well, people say ‘oh it’s written for Senior Civil Servants’ or it’s written for a particular audience or it’s written someone whose a specialist, but they are people too. When you’re a senior civil servant, you don’t suddenly become this person who communicates in a really arcane fashion or understands things in a really complex fashion. You’re also a person who needs to understand things really, really quickly, so being able to write things down and explain things in a clear and accessible fashion is appropriate for any reader, regardless of who they are. \n \nSarah Stewart: Yeah, actually there’s a really good discussion if you want some further reading or further listening. It’s Stephen Pinker in conversation with Ian McEwan on academic writing and the importance of clear writing. So after you’ve listened to this podcast, do give it a watch it’s on YouTube. \n \nAngus Montgomery: Which leads nicely, these are segueing quite nicely together I think, to my point or my next point. Which is something that we say quite a lot at GDS, which is ‘show the thing’. And by that we mean if you’re talking about something or you’re trying to tell someone about a product or a service or a thing, just show it.\n \nExplain how it works, say what it is, don’t use metaphors, don’t try to dress it up, don’t try to make it sound like it’s doing things that it isn’t. Just explain what it does.\n \nBecause as you’ve just said, if the thing that you’ve built or the thing that you’re trying to describe is valuable and worth talking about, then all you need to do is explain it clearly and it will do the work for you. \n \nYou don’t need to dress it up, you don’t need to put marketing on it, you don’t need to you know make it sound like it’s the incredible next you know, use loads of adjectives like ‘stunning’ and ‘life changing’. You just need to show it and if it’s a worthwhile thing then the reader will understand that and accept that and will be on board with it.\n \nSo show the thing, talk about it as clearly as possible, say what it does, and that’s all you need to do. That’s basically it.\n \nSarah Stewart: I’ve come up with an original next principle, Angus. Burn! Which is about feedback and welcoming feedback and a sub point of this, is the message: you are not your writing. \n \nSo the other day, some kids came in for work experience. Can I call them kids? Some students came in for work experience and I spoke to them about my job and writing more generally. And a question they asked was ‘what do you do when someone gives you really bad feedback about your writing?’ I think the most important and first thing that you should learn and it’s the most difficult thing that writers have to come to terms with is: you are not your writing. \n \nYes, it has come out of your head and through your hands and is informed by the experiences you’ve had, but once it leaves you, it is a separate entity. And once you have that disconnect, that it is a separate entity, you stop being precious about it and you start thinking about the work and the work is the most important thing. \n \nSo, when someone says to you ‘this is a really confusing piece of writing’ or ‘this is a really confusing essay ‘ or ‘this is a muddled blog post’, they are not saying ‘you are a terrible person.’ They are not saying ‘you’re an imbecile’ or ‘you are a failure as a writer’. They are saying ‘this is muddled’ ‘this is confusing’. It doesn't feel good to be criticised or to have negative feedback, but it’s a gift. It’s an opportunity for you to...\n \nAngus Montgomery: Feedback is a gift\n \nSarah Stewart: It really is. I was thinking about the best advice I was ever given as a writer which was being told, when I was a journalist, which is probably why I hated it so much, that I was a rubbish writer. So I think I needed to hear that things weren’t very good or I would have been writing, you know, like a crazy woman for the rest of my life. You need feedback, you need to welcome that in. Because it’s always about the work, it’s never really about you, and it’s never even about you when you’re writing memoir or yoru autobiography, it’s still a separate thing.\n \nAngus Montgomery: That leads, leads very neatly into my next point.\n \nWhich is another GDSism, something that we say quite a lot at GDS which is, ‘the team is the editor’.\n \nAnd before I got into this, because it’s a common thing we say at GDS, I should probably give a shoutout to some of the original Creative Team and Creative Writers at GDS, who you know we’re standing on the shoulders of giants and all that stuff, a lot of certainly my ways of working and thinking have come from these people.\n \nSo people like Giles Turnbull, Ella Fitzsimmons, Matt Sheret, Amy McNichol and this is the thing I used to hear a lot from them, ‘the team is the editor’ and that means, to pick up on exactly your point, we’re not doing this writing on our own, like we are the writer kind of in charge ultimately of the document or the piece of writing that will go out but we’re working in collaboration with a lot of other people.\n \nSo we could be working in collaboration with the person who has developed the idea or product or service or whatever it is that we’re trying to communicate. We’ll be working with a comms specialist who will be thinking about what’s the best way to best place to publish this. \n \nYou might be working with someone who edits the blog. And we’re working with the rest of our team as well because we’re not working in isolation. Pretty much everything that I write, I share with you and I think vice versa. \n \nAnd you have to, you’re nothing without an editor. A writer is nothing without a good editor. No book that you have read and no newspaper article that you’ve read and no film that you’ve seen and no commercial you’ve seen on TV is just a result of a single writer...\n \nSarah Stewart: That’s so…\n \nAngus Montgomery: ...with their vision.\n \nSarah Stewart: Yeah, that’s so true. And I think that’s why people get so put off writing as well because they seem, people think of writers as, like, strange creatures inspired that they you know, get hit on the head by muse and are able to write perfect prose.\n \nBut it goes through loads and loads and loads of editing to get that kind of pure, perfect sentence. \n \nAngus Montgomery: So ‘the team is the editor’ and the editor is the unsung hero of writing as well. They are the person in the background that is making all these things work. The reason people give feedback isn’t because they want to undermine you or attack you, it’s because they want to make the work better. And you have to welcome that and find that as well. As a writer it’s really important not to isolate yourself and do it on your own, and plough away and...\n \nSarah Stewart: It is nerve-wracking to share your work and you do have to be aware of when, for example, say I’m writing a speech, it’s not unusual to have twenty people in the document all feeding in their ideas and you have to be able to distinguish: what is a ‘showstopper’ so a fact that needs to go in or something that has to come out because it’s incorrect, what’s personal opinion and what’s style. And if you have a really clear idea of that, there does come a point where you can say, ‘Actually, no, I’ve taken in everything I need to take in and I’m happy with the piece now.’\n \nJust to add to that, sharing with the team and the team is the editor, of all things I’ve written and shared with you or shared with the team, I’ve never had a case where it’s been made worse by a suggestion, the work has always improved.\n \nAngus Montgomery: If the person who is giving you feedback understands what this piece of writing is trying to do and that person is sort of vaguely competent, then they will give you useful constructive feedback. \n \nSarah Stewart: I feel like maybe we’re rambling on this or maybe I’m rambling on this, but In terms of feedback givers, it’s very easy to criticise someone. It’s very easy to say ‘this isn’t good’. It takes intelligence to say what’s not quite working about it. So when you are giving feedback to someone, really consider, first of all, of course, their feelings because you don’t want to come across as, well you don’t want to be an awful person, but what’s useful for them to know about this. And we’ve got some fantastic posters around the office on how to give feedback effectively. So just make sure that if you’re required to give feedback, you’re doing it in an intelligent, kind way.\n \nAngus Montgomery: In a constructive fashion.\n \nSarah Stewart: Yes, better. \n \nAngus Montgomery: and your next point?\n \nSarah Stewart:... is to ‘read’. Reading is as important as writing. If you want to be a really good writer, you have to read lots and you should read good things. You know like the classics like Nabokov, James Joyce and Jane Austen. Yes of course you should read them because they’re fantastic, and it’s a pleasure to read a good writer. \n \nBut also, just  don’t be too much of a snob about it.Read a Mills and Boon book, read Fifty Shades of Grey, and again no shade on E.L James because she’s a multi-millionaire doing what she loves.\n \nAngus Montgomery: It takes skill to write that stuff surely.\n \nSarah Stewart: Yeah. In particular I would say read poetry. Not only because I think it’s super cool, poetry can teach you a lot about conveying complex ideas in a very short space of time and you know, we’re you know kids of the digital age, we don’t have a very long attention span so understanding how to kind of compress ideas is very important.\n \nBut poetry can teach you a lot about the music of a sentence. And especially for speech writing, it’s particularly important. A poem can teach you about the sound of words, the meter, how a piece scans, it’s called scansion. So there’s no alchemy to writing really well, it is just about practicing writing and reading. \n \nAngus Montgomery: Any poem in particular or poet in particular?\n \nSarah Stewart: Well...good question. I would recommend the Confessional poets, so like Sylvia Plath. But actually, do you know what? Any American poet from the 1950s onwards because American poetry in particular, they have a way of, I say ‘they’ in a very general sense, I would recommend the Confessional School and the New York School in particular  – – as you’ve asked – because they just say it how it is. \n \nAnd also the Beat poets as well, although they can talk a lot in abstraction, you can learn a lot by their directness.\n \nAngus Montgomery: Yeah. \n \nSarah Stewart: So yeah. Ginsberg, Kerouac.\n \nAngus Montgomery: Yeah.\n \nSarah Stewart: Frank O'Hara.\n \nAngus Montgomery: Very minimal viable words. \n \nMy next principle, next tip, is quite a practical one. And it’s something that might not work for everyone, but I find really really helpful, which is to never start with a blank page.\n \nSo if you’re writing something, the scariest thing is when you kind of open up a Word doc or a Google doc or have a physical sheet of blank paper in front of you, and you’re like ‘oh my god, what do I do with this now?’ like ‘I need to turn this from this blank sheet into a speech or an article or a blog post or a presentation or whatever it might be. \n \nAnd that blankness is the most terrifying part of this and starting is the most terrifying part of any project and writing is no different. So the way that I deal with that is when I have a blank page in front of me, I immediately go to Google or other search engines are available obviously, and or previous pieces that I’ve done that are similar, copy paste and just throw as much text as I can on to that page, that even if it’s only tangentially similar, gives me something to work from.\n \nSo that I’m not starting from scratch, so that I have something to bounce ideas off of or something re-work or something that guides me in the right direction, and also takes away that fear of you know, just having a totally blank page in front of you.\n \nSarah Stewart: I do that all the time actually. If I’m writing a speech for example, I always write ‘good morning or good afternoon everyone’. And then if anyone asks me if I’ve made any progress, I can at least say I’ve made a start!\n \nAngus Montgomery: Yeah exactly. The vital start is there. \n \nSarah Stewart: Yeah. It’s psychologically important to have something down on paper. \n \nAngus Montgomery: Yeah. \n \nSarah Stewart: You’re right.\n \nAngus Montgomery: So I think it’s that, it’s that starting and then sort of flowing, flowing from there basically. \n \nSarah Stewart: Yeah.\n \nAngus Montgomery: And what’s your next principle?\n \nSarah Stewart: So my next principle I’ve entitled, ‘enough is enough’. So just don’t overdo it. Just write enough, and enough doesn’t mean writing an epic poem nor does it mean writing a haiku. Sorry, there are a lot of poetry allusions in this – but it means writing enough to get the job done. \n \nAnd the poet Frank O’Hara had a lovely quote about, you should read it, it’s called...it’s in a piece of writing that he called Personism: A Manifesto. And he describes writing and how effective writing is wearing a piece of clothing so it fits you perfectly, so it does exactly the job that it’s meant to do. \n \nAngus Montgomery: It’s showing the thing.\n \nSarah Stewart: And you might ‘show the thing’...it’s a very confusing analogy. \n \nAngus Montgomery: It’s a very confusing mixing, we’re mixing several metaphors here to prove a point.\n \nSarah Stewart: Yeah.\n \nAngus Montgomery: But yeah. And bringing me, without really a segue in this one, but bringing us nicely nevertheless to the final point which is, ‘stay human’.\n \nAnd this is not necessarily a writing point, this is something obviously that we should be all doing all the time in whatever work we do, but the reason I’m talking about it, and we’ve touched on this several times, writing isn’t something that we just do in isolation on our own \n \nWriting our, the writing that we do is helping one person, one human being, convey a message to another person, another human being or a group of them. And the people in that process are really really important, like the written word is important, but the people in that process are the most important parts.\n \nSo just when we’re dealing with people, we always try to be as nice and humble and listen as much as we can and advice and guide and all those sorts of things. But just try and do it nicely because it can be a stressful situation for people. \nSo thank you Sarah.\n \nSarah Stewart: Thank you Angus. This has been nice, hasn’t it?\n \nAngus Montgomery: This has been nice.\n \nSarah Stewart: So that brings us to the end of our 10 principles. This podcast will be embedded into a blog post, which will be published on the GDS blog. Please leave your comments for clear writing and any advice that you have for others.\n \nAngus Montgomery: Thank you for listening to the latest episode of the GDS podcast. We hope you enjoyed it and if you want to listen to previous episodes that we’ve done or what to subscribe for the future, then please just do to wherever it is that you download your podcasts from and hit the subscribe button.\n \nAnd we hope to have you as a listener again soon. \n \nSarah Stewart: Farewell. \n " ],
    "featured" : [ "https://d2bwo9zemjwxh5.cloudfront.net/ep-logo/pbblog3531320/Ep_118xoyf_1200x628.jpg?s=daa380f295fe2c2966f69016f3585c79&e=png" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PodBean Development" ]
      }
    } ],
    "url" : [ "https://governmentdigitalservice.podbean.com/e/government-digital-service-podcast-11-on-clear-writing/" ]
  }
}
