{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Ep. 16: Empathy-driven software development with Andrea Goulet by Always an Engineer " ],
    "summary" : [ "For today’s episode, Asim is joined by Andrea Goulet, who has spent more than 20 years in the tech industry. She joins Asim as she tells her journey in the tech industry and how the idea of empathy has helped her develop some soft skills that may be productive for software engineers in the field.\n[00:39] Introduction of Andrea\n[2:00] About Empathy\n[04:56] Andrea’s Journey in Software\n[07:47] Frameworks on Empathy\n[10:27] Applications of Framework to Engineers\n[14:45] Taking Actions with Empathy\n[20:10] Tangible Benefits of Empathy\n[26:21] Task and Relationship Conflicts\n[28:59] How to Reach Andrea\nDefining Empathy\nEmpathy is the moment an individual experiences when they have the power to make decisions and then act upon it. It is that moment when one’s thought process can read the feelings or foresee the consequences of the actions they are about to do. In the world of software and tech, empathy is not the main highlight to the work system, however, this underlying skill can be the butterfly effect that can change the course of productivity and outputs of software engineers.\nEssential Soft Skills\nEmpathy is a soft skill that can be harnessed as a metaphor to create a better working environment not just for yourself, but for your co-workers as well. Rooting back to the decision-making moments, there comes a time where you have to consider factors such as rational or logical thinking, setting up boundaries, and proper communications, these are the trigger points where empathy plays a big role in creating a good working environment. The soft skill has worked on many software developers in terms of better work productivity as well as healthier and professional working relationships with colleagues.\nHow to Connect with Andrea and Other References:\nAndrea’s Linkedin \nHeartware’s Website \nCorgibytes Website \nEmpathy in Tech" ],
    "featured" : [ "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode400/30209226/30209226-1674577437552-8d683e0843e09.jpg" ],
    "url" : [ "https://podcasters.spotify.com/pod/show/always-an-engineer/episodes/Ep--16-Empathy-driven-software-development-with-Andrea-Goulet-e1tumvr" ]
  }
}
