{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Five reasons why you should use Golang" ],
    "description" : [ {
      "html" : "<p>Joseph is a Computer Science graduate from the University of Sheffield. He first joined BJSS’ Leeds office for a placement year and returned after university as part of the Manchester Team. For the past year and a quarter he has been on the Bet365 project, writing Go based APIs as part of the responsible gambling team.</p> <p>Go has become one of the most sought-after programming languages amongst the worldwide developer community. But what is it exactly that is making Golang so appealing?</p> <p>Join BJSS Engineer Joseph Cheverton-Wynne as he uncovers the five reasons why experienced and junior developers should consider adding Go to their tech stack and shares his experience of using the programming language</p> <p>Please join us online on Tuesday 2nd November at 7 pm for what is sure to be an interesting and informative talk. We'll post the link for the talk on the day of the event. Please RSVP to make sure you get notified and hope you can join us.</p> ",
      "value" : "Joseph is a Computer Science graduate from the University of Sheffield. He first joined BJSS’ Leeds office for a placement year and returned after university as part of the Manchester Team. For the past year and a quarter he has been on the Bet365 project, writing Go based APIs as part of the responsible gambling team. Go has become one of the most sought-after programming languages amongst the worldwide developer community. But what is it exactly that is making Golang so appealing? Join BJSS Engineer Joseph Cheverton-Wynne as he uncovers the five reasons why experienced and junior developers should consider adding Go to their tech stack and shares his experience of using the programming language Please join us online on Tuesday 2nd November at 7 pm for what is sure to be an interesting and informative talk. We'll post the link for the talk on the day of the event. Please RSVP to make sure you get notified and hope you can join us."
    } ],
    "start" : [ "2021-11-02T19:00:00Z" ],
    "end" : [ "2021-11-02T20:00:00Z" ],
    "url" : [ "https://www.meetup.com/digitallincoln/events/281382077/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-10-12T18:13:43Z" ],
    "updated" : [ "2021-10-12T18:18:40Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Digital Lincoln" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/6/3/c/9/600_469585545.jpeg" ],
        "url" : [ "https://www.meetup.com/digitallincoln" ]
      },
      "value" : "Digital Lincoln"
    } ]
  }
}
