{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "[Online] Matteo Emili - Why Pipelines as Code is *the* way forward" ],
    "description" : [ {
      "html" : "<p>We're delighted to announce that this month's speaker is the fabulous Maira Wenzel, Program manager for .NET at Microsoft. Join us on Monday 29nd February from 18:30GMT! Sponsored by PJG Creations Ltd, Tech Nottingham, JetBrains and STKRS.</p> <p>-------------<br/>The Talk<br/>-------------</p> <p>Matteo Emili - Why Pipelines as Code is *the* way forward:</p> <p>We started with CI, then we introduced Configuration Management, evolved towards Infrastructure as Code – but we still lag behind on pipelines, we are too reliant on the tools we use and we don’t really apply the best practices of the industry.</p> <p>Is it difficult to move to Pipelines as Code? What should I do to start the journey? If I am already there, what can I do to make it scale at an organisational level?</p> <p>These questions (and many more!) will find answers in this session, shedding light on how and why we should move to Pipelines as Code and the benefits that come out of this migration.</p> <p>-------------------<br/>About Matteo<br/>-------------------</p> <p>Matteo Emili is a Microsoft MVP since 2010. He is passionate about technology, but it is not his only interest – what really makes him tick is how technology acts as a tool to solve a complex business problem, ultimately bringing benefits to the company.</p> <p>Regular speaker at conferences and meetups, he enjoys sharing back with the worldwide technical communities – especially about ALM, Agile and DevOps.</p> <p>He currently works at Avanade UK as a Manager for Software Engineering.</p> <p>Blog: <a href=\"https://mattvsts.github.io\" class=\"linkified\">https://mattvsts.github.io</a><br/>Twitter: <a href=\"https://twitter.com/MattVSTS\" class=\"linkified\">https://twitter.com/MattVSTS</a></p> ",
      "value" : "We're delighted to announce that this month's speaker is the fabulous Maira Wenzel, Program manager for .NET at Microsoft. Join us on Monday 29nd February from 18:30GMT! Sponsored by PJG Creations Ltd, Tech Nottingham, JetBrains and STKRS. ------------- The Talk ------------- Matteo Emili - Why Pipelines as Code is *the* way forward: We started with CI, then we introduced Configuration Management, evolved towards Infrastructure as Code – but we still lag behind on pipelines, we are too reliant on the tools we use and we don’t really apply the best practices of the industry. Is it difficult to move to Pipelines as Code? What should I do to start the journey? If I am already there, what can I do to make it scale at an organisational level? These questions (and many more!) will find answers in this session, shedding light on how and why we should move to Pipelines as Code and the benefits that come out of this migration. ------------------- About Matteo ------------------- Matteo Emili is a Microsoft MVP since 2010. He is passionate about technology, but it is not his only interest – what really makes him tick is how technology acts as a tool to solve a complex business problem, ultimately bringing benefits to the company. Regular speaker at conferences and meetups, he enjoys sharing back with the worldwide technical communities – especially about ALM, Agile and DevOps. He currently works at Avanade UK as a Manager for Software Engineering. Blog: https://mattvsts.github.io Twitter: https://twitter.com/MattVSTS"
    } ],
    "start" : [ "2021-03-29T17:30:00Z" ],
    "end" : [ "2021-03-29T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/dotnetnotts/events/276911331/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-03-13T17:57:06Z" ],
    "updated" : [ "2021-03-13T17:59:09Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ ".NET Notts" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/7/2/9/a/600_492269338.jpeg" ],
        "url" : [ "https://www.meetup.com/dotnetnotts" ]
      },
      "value" : ".NET Notts"
    } ]
  }
}
