{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Techfast's Christmas Breakfast Buffet! 🎄☕" ],
    "description" : [ {
      "html" : "<p>This talk will be online only via Zoom. Anyone who sets themselves to \"attending\" will get details of how to dial in closer to the time. Any questions please get in touch.</p> <p>We're pushing back our usual monthly routine to create something truly magical, the NottsTechfast Christmas Buffet! It's our festive spin on \"lightning talks\" with a delicious smorgasbord of speakers from throughout the year!</p> <p>We'll be announcing which tasty morsels will joining us on the run up and there will be prizes! So watch this space....</p> <p>About the Talks -</p> <p>TBC but expect some diverse topics like:<br/>Architecture<br/>IoT<br/>Agiles<br/>Design Thinking<br/>Wellbeing</p> <p>About the Speakers -</p> <p>TBC</p> ",
      "value" : "This talk will be online only via Zoom. Anyone who sets themselves to \"attending\" will get details of how to dial in closer to the time. Any questions please get in touch. We're pushing back our usual monthly routine to create something truly magical, the NottsTechfast Christmas Buffet! It's our festive spin on \"lightning talks\" with a delicious smorgasbord of speakers from throughout the year! We'll be announcing which tasty morsels will joining us on the run up and there will be prizes! So watch this space.... About the Talks - TBC but expect some diverse topics like: Architecture IoT Agiles Design Thinking Wellbeing About the Speakers - TBC"
    } ],
    "start" : [ "2020-12-10T08:00:00Z" ],
    "end" : [ "2020-12-10T09:00:00Z" ],
    "url" : [ "https://www.meetup.com/Notts-Techfast/events/274709451/" ],
    "location" : [ "Online" ],
    "published" : [ "2020-11-20T10:05:33Z" ],
    "updated" : [ "2020-11-20T10:05:33Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Notts Techfast" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/a/5/5/e/600_493602334.jpeg" ],
        "url" : [ "https://www.meetup.com/Notts-Techfast" ]
      },
      "value" : "Notts Techfast"
    } ]
  }
}
