{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "[Online] Dr Mike Pound - Cracking the Enigma Machine" ],
    "description" : [ {
      "html" : "<p>Sponsored by PJG Creations Ltd, Tech Nottingham, Stkrs &amp; JetBrains.</p> <p>About the Event:</p> <p>We'll be kicking off at 18:30BST for an open networking chat on Zoom, before kicking our talks off at 19:00.</p> <p>Do feel free to head over to <a href=\"https://zoom.us\" class=\"linkified\">https://zoom.us</a> &amp; create yourself an account as well as downloading the client to your favourite machine!</p> <p>We'll also be streaming the Meetup on YouTube.</p> <p>We'll tweet out the link as soon as we know what it is!</p> <p>If you struggle at all, then get in touch ASAP so we can help!</p> <p>What we'll be doing:</p> <p>Dr Mike Pound - Cracking the Enigma Machine:</p> <p>Enigma is known as the highly complex WWII cipher, but how does it hold up in 2021?</p> <p>Dr Mike Pound demonstrates how we can use modern computing techniques to help crack the Enigma, but it's not as easy as you'd think!</p> <p>Our speaker:</p> <p>Dr Mike Pound:</p> <p>Dr Mike Pound is a computer scientist whose research focuses on the development of novel computer vision techniques.</p> <p>He works with bioscientists to apply these computer vision techniques to plant phenotyping, providing accurate measurement of 2D and 3D shape information of plants.</p> <p>The bioscientists can use this information to explain the underlying mechanisms for how plants grow.</p> <p>Mike has developed tools that allow biologists to measure plant root systems, these have been adopted by researchers all over the world.</p> <p>Mike is known for his work in the areas of bioimage analysis, computer vision, image recognition, computer security, and for his appearances on the video series Computerphile.</p> <p>You can reach him at:</p> <p>Twitter - <a href=\"https://twitter.com/_mikepound\" class=\"linkified\">https://twitter.com/_mikepound</a><br/>LinkedIn - <a href=\"https://www.linkedin.com/in/michael-pound-b1b3a5121\" class=\"linkified\">https://www.linkedin.com/in/michael-pound-b1b3a5121</a></p> <p>Swag:</p> <p>We'll be giving away a JetBrains license to one lucky attendee!</p> ",
      "value" : "Sponsored by PJG Creations Ltd, Tech Nottingham, Stkrs & JetBrains. About the Event: We'll be kicking off at 18:30BST for an open networking chat on Zoom, before kicking our talks off at 19:00. Do feel free to head over to https://zoom.us & create yourself an account as well as downloading the client to your favourite machine! We'll also be streaming the Meetup on YouTube. We'll tweet out the link as soon as we know what it is! If you struggle at all, then get in touch ASAP so we can help! What we'll be doing: Dr Mike Pound - Cracking the Enigma Machine: Enigma is known as the highly complex WWII cipher, but how does it hold up in 2021? Dr Mike Pound demonstrates how we can use modern computing techniques to help crack the Enigma, but it's not as easy as you'd think! Our speaker: Dr Mike Pound: Dr Mike Pound is a computer scientist whose research focuses on the development of novel computer vision techniques. He works with bioscientists to apply these computer vision techniques to plant phenotyping, providing accurate measurement of 2D and 3D shape information of plants. The bioscientists can use this information to explain the underlying mechanisms for how plants grow. Mike has developed tools that allow biologists to measure plant root systems, these have been adopted by researchers all over the world. Mike is known for his work in the areas of bioimage analysis, computer vision, image recognition, computer security, and for his appearances on the video series Computerphile. You can reach him at: Twitter - https://twitter.com/_mikepound LinkedIn - https://www.linkedin.com/in/michael-pound-b1b3a5121 Swag: We'll be giving away a JetBrains license to one lucky attendee!"
    } ],
    "start" : [ "2021-06-17T17:30:00Z" ],
    "end" : [ "2021-06-17T19:30:00Z" ],
    "url" : [ "https://www.meetup.com/Nottingham-IoT-Meetup/events/278579493" ],
    "location" : [ "Online" ],
    "published" : [ "2021-06-02T20:35:52Z" ],
    "updated" : [ "2021-06-02T20:35:52Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Nottingham IoT (Internet of Things)" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/a/9/5/8/600_481783352.jpeg" ],
        "url" : [ "https://www.meetup.com/Nottingham-IoT-Meetup" ]
      },
      "value" : "Nottingham IoT (Internet of Things)"
    } ]
  }
}
