{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "How to make digital technology more sustainable" ],
    "description" : [ {
      "html" : "<p>Did you know that the internet is thought to produce about the same carbon emissions as the aviation industry’s fuel consumption? And if the internet was a country it would be the sixth biggest polluter in the world. It's shocking, isn’t it!? The cloud isn’t as fluffy and harmless as you might think...<br/>Digital technology provides wonderful opportunities to reach and engage others, often in ways that aren’t possible using offline methods. But digital does have a significant environmental cost, which many in the tech industry aren’t conscious of.<br/>In this talk,by Hannah Smith (@hanopcan) we’ll discuss how digital technologies cause pollution and how technologists can reduce the environmental impact of the tech they build, manage and use.</p> ",
      "value" : "Did you know that the internet is thought to produce about the same carbon emissions as the aviation industry’s fuel consumption? And if the internet was a country it would be the sixth biggest polluter in the world. It's shocking, isn’t it!? The cloud isn’t as fluffy and harmless as you might think... Digital technology provides wonderful opportunities to reach and engage others, often in ways that aren’t possible using offline methods. But digital does have a significant environmental cost, which many in the tech industry aren’t conscious of. In this talk,by Hannah Smith (@hanopcan) we’ll discuss how digital technologies cause pollution and how technologists can reduce the environmental impact of the tech they build, manage and use."
    } ],
    "start" : [ "2022-01-13T18:30:00Z" ],
    "end" : [ "2022-01-13T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/PHPMiNDS-in-Nottingham/events/283053826/" ],
    "location" : [ "Online" ],
    "published" : [ "2022-01-04T18:42:49Z" ],
    "updated" : [ "2022-01-05T18:51:19Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "PHPMiNDS" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/9/7/e/f/600_443318895.jpeg" ],
        "url" : [ "https://www.meetup.com/PHPMiNDS-in-Nottingham" ]
      },
      "value" : "PHPMiNDS"
    } ]
  }
}
