{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Tech Nottingham August 2021 - Saving The World One Techy At A Time" ],
    "description" : [ {
      "html" : "<p>This month we welcome the wonderful Natalia Waniczek to Tech Nottingham.</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>Join us on Zoom. The joining link will be published on the night of the event.</p> <p>-----------------------</p> <p>***Saving The World One Techy At A Time***<br/>by Natalia Waniczek</p> <p>In this talk we’ll discuss climate change, how technology is escalating it, and how we as individuals can kick off big systemic change.</p> <p>We have so much to be grateful for. The world around us is beautiful, and power is in our hands to make sure that future generations will have as much, if not more, to be grateful for.</p> <p>Unfortunately, the tech sector produces about 830 million tonnes of carbon dioxide annually, which is about 2% of the global CO2 emissions, the same amount as aviation. According to the UN we only have 10 years left to prevent irreversible damage from climate change.</p> <p>You will walk out of this talk having learned what the current state of tech's impact on climate change is, and a number of steps we can take to reduce our carbon footprint, and prevent this from escalating further.</p> <p>**About Natalia**</p> <p>Natalia is a front end developer at The Developer Society, working with nonprofits, NGOs and groups with a progressive mission to help make the world we live in a better place. With a passion for the environment, she's taken up an Environmental Science degree and is not afraid to voice her opinions and advocate against climate change. If she's not coding or trying to fix the world, she's either exploring Cornwall with her whippet Dobby, climbing rocks, or trying to outlift everyone in the gym.</p> <p>**Win Stuff at Tech Nottingham!**</p> <p>We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it!</p> <p>Join our Slack group: <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One, Cronofy, MHR</p> <p>Full event details here: <a href=\"https://www.technottingham.com/events/tech-nottingham-august-2021\" class=\"linkified\">https://www.technottingham.com/events/tech-nottingham-august-2021</a></p> ",
      "value" : "This month we welcome the wonderful Natalia Waniczek to Tech Nottingham. Plus we'll be having fun, playing some games and giving away swag and prizes. Join us on Zoom. The joining link will be published on the night of the event. ----------------------- ***Saving The World One Techy At A Time*** by Natalia Waniczek In this talk we’ll discuss climate change, how technology is escalating it, and how we as individuals can kick off big systemic change. We have so much to be grateful for. The world around us is beautiful, and power is in our hands to make sure that future generations will have as much, if not more, to be grateful for. Unfortunately, the tech sector produces about 830 million tonnes of carbon dioxide annually, which is about 2% of the global CO2 emissions, the same amount as aviation. According to the UN we only have 10 years left to prevent irreversible damage from climate change. You will walk out of this talk having learned what the current state of tech's impact on climate change is, and a number of steps we can take to reduce our carbon footprint, and prevent this from escalating further. **About Natalia** Natalia is a front end developer at The Developer Society, working with nonprofits, NGOs and groups with a progressive mission to help make the world we live in a better place. With a passion for the environment, she's taken up an Environmental Science degree and is not afraid to voice her opinions and advocate against climate change. If she's not coding or trying to fix the world, she's either exploring Cornwall with her whippet Dobby, climbing rocks, or trying to outlift everyone in the gym. **Win Stuff at Tech Nottingham!** We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event. **Join in with the Nottingham Tech Community online** The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it! Join our Slack group: http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Cronofy, MHR Full event details here: https://www.technottingham.com/events/tech-nottingham-august-2021"
    } ],
    "start" : [ "2021-08-09T17:30:00Z" ],
    "end" : [ "2021-08-09T19:30:00Z" ],
    "url" : [ "https://www.meetup.com/Tech-Nottingham/events/279628678/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-07-22T07:41:48Z" ],
    "updated" : [ "2021-07-22T07:42:23Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Tech Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/c/e/3/c/600_480952796.jpeg" ],
        "url" : [ "https://www.meetup.com/Tech-Nottingham" ]
      },
      "value" : "Tech Nottingham"
    } ]
  }
}
