{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "NottTechParty - The Nottingham Tech Community Christmas Party 2020" ],
    "description" : [ {
      "html" : "<p>**One Spectacular Christmas Party To Celebrate Nottingham's Wonderful Tech Community**<br/>Wednesday 9th December 6.30pm</p> <p>2020 has of course been a challenging year for all of us and they have been times when community is more important than ever. This year we've seen the Nottingham Tech Community grow, adapt and support one another and the wider city to deal with the challenges we've all faced.</p> <p>This community and your contribution to it make Nottingham an even better place to live and work in technology.</p> <p>We can't meet in person this year so we are coming together online to celebrate the community and throwing another awesome Christmas party.</p> <p>**WiFi Wars**<br/>For this Christmas party we're working with WifiWars to present a live comedy game show where you play along, hosted by comedian and regular videogames commentator Steve McNeil (Team Captain on Dara O Briain's Go 8 Bit, host/regular on Challenge TV's Videogame Nation)!</p> <p>We'll also be hosting a range of social games and a most-festive-Zoom-feed competition.</p> <p>We'll be giving away a range of prizes at the Christmas Party this year including our star prize - a Nintendo Switch Lite!</p> <p>Tickets cost £10 each and the price of your ticket includes full access to the games and a chance to win amazing prizes.</p> <p>***First tickets released on Friday 27th November at midday!***</p> <p>TICKETS: <a href=\"https://nott.tech/xmas20\" class=\"linkified\">https://nott.tech/xmas20</a></p> <p>-----</p> <p>Win A Nintendo Switch Lite At Tech Nottingham!</p> <p>We’ll be giving away some awesome prizes to our lucky attendees, including a Nintendo Switch Lite!</p> <p>-----</p> <p>Thanks to our sponsors:<br/>Capital One, Commify, Cronofy, JH, MHR</p> <p>Full event details here: <a href=\"https://nott.tech/xmas20\" class=\"linkified\">https://nott.tech/xmas20</a></p> ",
      "value" : "**One Spectacular Christmas Party To Celebrate Nottingham's Wonderful Tech Community** Wednesday 9th December 6.30pm 2020 has of course been a challenging year for all of us and they have been times when community is more important than ever. This year we've seen the Nottingham Tech Community grow, adapt and support one another and the wider city to deal with the challenges we've all faced. This community and your contribution to it make Nottingham an even better place to live and work in technology. We can't meet in person this year so we are coming together online to celebrate the community and throwing another awesome Christmas party. **WiFi Wars** For this Christmas party we're working with WifiWars to present a live comedy game show where you play along, hosted by comedian and regular videogames commentator Steve McNeil (Team Captain on Dara O Briain's Go 8 Bit, host/regular on Challenge TV's Videogame Nation)! We'll also be hosting a range of social games and a most-festive-Zoom-feed competition. We'll be giving away a range of prizes at the Christmas Party this year including our star prize - a Nintendo Switch Lite! Tickets cost £10 each and the price of your ticket includes full access to the games and a chance to win amazing prizes. ***First tickets released on Friday 27th November at midday!*** TICKETS: https://nott.tech/xmas20 ----- Win A Nintendo Switch Lite At Tech Nottingham! We’ll be giving away some awesome prizes to our lucky attendees, including a Nintendo Switch Lite! ----- Thanks to our sponsors: Capital One, Commify, Cronofy, JH, MHR Full event details here: https://nott.tech/xmas20"
    } ],
    "start" : [ "2020-12-09T18:30:00Z" ],
    "end" : [ "2020-12-09T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/Tech-Nottingham/events/274763219/" ],
    "location" : [ "Online" ],
    "published" : [ "2020-11-23T09:36:01Z" ],
    "updated" : [ "2020-11-23T09:57:15Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Tech Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/c/e/3/c/600_480952796.jpeg" ],
        "url" : [ "https://www.meetup.com/Tech-Nottingham" ]
      },
      "value" : "Tech Nottingham"
    } ]
  }
}
