{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Tech Nottingham October 2021 - Lightning Talks!" ],
    "description" : [ {
      "html" : "<p>This month we hand control over to … you! The audience takes over in our ever-popular lightning talks event.</p> <p>Join us on Zoom. The joining link will be published on the night of the event.</p> <p>-----------------------</p> <p>***Lightning Talks***</p> <p>A lightning talk is a short talk, under five minutes on whatever subject you wish to speak about (Code of Conduct permitting!). At the start of the session the audience has time to write their talk title on a virtual post-it and those talks make up our evening. If there are too many talks to fit in to the evening, we'll vote on our favourites.</p> <p>For the audience it's a rapid-fire session where you'll learn loads and gain unique insight into the thoughts, ideas and passions of your peers.</p> <p>For speakers it's a unique opportunity to speak your mind, try out a talk idea and boost your confidence in front of a friendly crowd. Since the talks are short, the pressure to prep and polish is low and you can focus on key ideas you want to share.</p> <p>See our website for all the details <a href=\"https://nott.tech/tn-oct-2021\" class=\"linkified\">https://nott.tech/tn-oct-2021</a></p> <p>**Win Stuff at Tech Nottingham!**</p> <p>We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it!</p> <p>Join our Slack group: <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One, Cronofy, MHR</p> <p>Full event details here: <a href=\"https://www.technottingham.com/events/tech-nottingham-october-2021\" class=\"linkified\">https://www.technottingham.com/events/tech-nottingham-october-2021</a></p> ",
      "value" : "This month we hand control over to … you! The audience takes over in our ever-popular lightning talks event. Join us on Zoom. The joining link will be published on the night of the event. ----------------------- ***Lightning Talks*** A lightning talk is a short talk, under five minutes on whatever subject you wish to speak about (Code of Conduct permitting!). At the start of the session the audience has time to write their talk title on a virtual post-it and those talks make up our evening. If there are too many talks to fit in to the evening, we'll vote on our favourites. For the audience it's a rapid-fire session where you'll learn loads and gain unique insight into the thoughts, ideas and passions of your peers. For speakers it's a unique opportunity to speak your mind, try out a talk idea and boost your confidence in front of a friendly crowd. Since the talks are short, the pressure to prep and polish is low and you can focus on key ideas you want to share. See our website for all the details https://nott.tech/tn-oct-2021 **Win Stuff at Tech Nottingham!** We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event. **Join in with the Nottingham Tech Community online** The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it! Join our Slack group: http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Cronofy, MHR Full event details here: https://www.technottingham.com/events/tech-nottingham-october-2021"
    } ],
    "start" : [ "2021-10-11T17:30:00Z" ],
    "end" : [ "2021-10-11T19:30:00Z" ],
    "url" : [ "https://www.meetup.com/Tech-Nottingham/events/280965433/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-09-23T15:02:12Z" ],
    "updated" : [ "2021-09-23T15:58:21Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Tech Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/c/e/3/c/600_480952796.jpeg" ],
        "url" : [ "https://www.meetup.com/Tech-Nottingham" ]
      },
      "value" : "Tech Nottingham"
    } ]
  }
}
