{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Tech Nottingham May 10th - Peaks and Valleys: Navigating growth" ],
    "description" : [ {
      "html" : "<p>This month we welcome fantastic speakers Riz and Daryl to Tech Nottingham</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>Join us on Zoom. Joining link will be published on the night.</p> <p>***Peaks and Valleys: Navigating growth***<br/>by Rizwana Khan and Daryl Cecile</p> <p>Founding a small start-up unexpectedly, was the start of our journey of navigating growth. As first-time founders, we found ourselves needing to balance improvisation and long-term strategy whilst also wearing a multitude of hats, jumping over financial hurdles, and keeping our momentum.<br/>By the end of this coming-of-age talk, we hope to share our experiences of creating a community-backed project—especially for those who find themselves in similar, unexpected spots—as well as our hopes for the future of the tech industry in Nottingham and beyond.</p> <p>**About Rizwana and Daryl**</p> <p>Rizwana Akmal Khan and Daryl Cecile are co-founders of ProjectFunction, a start-up set up in 2018, which aims to educate and encourage under-represented and marginalised people to get involved in the tech industry.</p> <p>Rizwana is a designer-developer, poet, podcaster, and occasional-speaker. As a third-culture adult, she has grown up valuing diverse work environments and will always stand in support of spaces where people who may be seen as outsiders are given centre stage.</p> <p>Daryl is a developer and educator, committed to opening up the tech industry to a more diverse group of people; instilling a philosophy of discovery and collaboration into those taking their first steps into the industry, especially providing support to those who are marginalised and overlooked.</p> <p>**Win Stuff at Tech Nottingham!**</p> <p>We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it!</p> <p>Join our Slack group: <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One, Cronofy, MHR</p> <p>Full event details here: <a href=\"https://www.technottingham.com/events/tech-nottingham-may-2021\" class=\"linkified\">https://www.technottingham.com/events/tech-nottingham-may-2021</a></p> ",
      "value" : "This month we welcome fantastic speakers Riz and Daryl to Tech Nottingham Plus we'll be having fun, playing some games and giving away swag and prizes. Join us on Zoom. Joining link will be published on the night. ***Peaks and Valleys: Navigating growth*** by Rizwana Khan and Daryl Cecile Founding a small start-up unexpectedly, was the start of our journey of navigating growth. As first-time founders, we found ourselves needing to balance improvisation and long-term strategy whilst also wearing a multitude of hats, jumping over financial hurdles, and keeping our momentum. By the end of this coming-of-age talk, we hope to share our experiences of creating a community-backed project—especially for those who find themselves in similar, unexpected spots—as well as our hopes for the future of the tech industry in Nottingham and beyond. **About Rizwana and Daryl** Rizwana Akmal Khan and Daryl Cecile are co-founders of ProjectFunction, a start-up set up in 2018, which aims to educate and encourage under-represented and marginalised people to get involved in the tech industry. Rizwana is a designer-developer, poet, podcaster, and occasional-speaker. As a third-culture adult, she has grown up valuing diverse work environments and will always stand in support of spaces where people who may be seen as outsiders are given centre stage. Daryl is a developer and educator, committed to opening up the tech industry to a more diverse group of people; instilling a philosophy of discovery and collaboration into those taking their first steps into the industry, especially providing support to those who are marginalised and overlooked. **Win Stuff at Tech Nottingham!** We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event. **Join in with the Nottingham Tech Community online** The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it! Join our Slack group: http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Cronofy, MHR Full event details here: https://www.technottingham.com/events/tech-nottingham-may-2021"
    } ],
    "start" : [ "2021-05-10T17:30:00Z" ],
    "end" : [ "2021-05-10T19:30:00Z" ],
    "url" : [ "https://www.meetup.com/Tech-Nottingham/events/277647592/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-04-18T17:07:43Z" ],
    "updated" : [ "2021-04-22T07:13:29Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Tech Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/c/e/3/c/600_480952796.jpeg" ],
        "url" : [ "https://www.meetup.com/Tech-Nottingham" ]
      },
      "value" : "Tech Nottingham"
    } ]
  }
}
