{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Tech Nottingham December 2021 - Nott Tech Christmas Party!" ],
    "description" : [ {
      "html" : "<p>**Seasons Celebrations**</p> <p>We’re coming together ONLINE to celebrate the community and this year we’re very excited to be working with our favorite meetups! You can expect quizzes, games, prizes and of course lots of fun and festive cheer.</p> <p>Teams of four will be playing for a chance of winning the top prize, you can join as a ready made team or sign up on the night and we’ll team you up. Expect games that are more luck than skill and puns that have more cheese than a boxing day buffet.</p> <p>As usual, Christmas jumpers/hats/outfits encouraged!</p> <p>For all the details, see our website: <a href=\"https://nott.tech/xmas21\" class=\"linkified\">https://nott.tech/xmas21</a></p> <p>**Win Stuff at Tech Nottingham**</p> <p>We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it!</p> <p>Join our Slack group: <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**</p> <p>Capital One, Cronofy and MHR</p> <p>Full event details here: <a href=\"https://nott.tech/xmas-21\" class=\"linkified\">https://nott.tech/xmas-21</a></p> ",
      "value" : "**Seasons Celebrations** We’re coming together ONLINE to celebrate the community and this year we’re very excited to be working with our favorite meetups! You can expect quizzes, games, prizes and of course lots of fun and festive cheer. Teams of four will be playing for a chance of winning the top prize, you can join as a ready made team or sign up on the night and we’ll team you up. Expect games that are more luck than skill and puns that have more cheese than a boxing day buffet. As usual, Christmas jumpers/hats/outfits encouraged! For all the details, see our website: https://nott.tech/xmas21 **Win Stuff at Tech Nottingham** We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event. **Join in with the Nottingham Tech Community online** The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it! Join our Slack group: http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Cronofy and MHR Full event details here: https://nott.tech/xmas-21"
    } ],
    "start" : [ "2021-12-06T18:30:00Z" ],
    "end" : [ "2021-12-06T21:00:00Z" ],
    "url" : [ "https://www.meetup.com/Tech-Nottingham/events/282103654/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-11-15T18:14:28Z" ],
    "updated" : [ "2021-11-15T20:15:39Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Tech Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/c/e/3/c/600_480952796.jpeg" ],
        "url" : [ "https://www.meetup.com/Tech-Nottingham" ]
      },
      "value" : "Tech Nottingham"
    } ]
  }
}
