{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Women in Tech 4th March - Lightning Talks!" ],
    "description" : [ {
      "html" : "<p>This month the audience rises up and takes control with Lightning Talks!</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>New to Online WiT? Read about what to expect here:<br/><a href=\"https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event\" class=\"linkified\">https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event</a></p> <p>***Lightning Talks: The Audience Takes Over!***</p> <p>This is the event where you take control - we'll be running lightning talks and anyone (women and gender minorities preferred) can speak!</p> <p>**What is a Lightning Talk?**</p> <p>A lightning talk is a short talk, under five minutes on whatever subject you wish to speak about (Code of Conduct permitting!). At the start of the session the audience has time to come up, write their talk title on a post-it and stick it to the board and those talks make up our evening. If there are too many talks to fit in to the evening, we'll vote on our favourites.</p> <p>For the audience it's a rapid-fire session where you'll learn loads and gain unique insight into the thoughts, ideas and passions of your peers.</p> <p>For speakers it's a unique opportunity to speak your mind, try out a talk idea and boost your confidence in front of a friendly crowd. Since the talks are short, the pressure to prep and polish is low and you can focus on key ideas you want to share.<br/>Great lightning talks we've seen:</p> <p>* Lightbulbs and being lazy</p> <p>* How to wing a presentation</p> <p>* When I learned to stop</p> <p>For inspiration, you can see some examples in this blog post (<a href=\"https://link.medium.com/saPHrF5F8T\" class=\"linkified\">https://link.medium.com/saPHrF5F8T</a>) about a previous Lightning Talks session at WiT Notts and this blog post (<a href=\"https://www.technottingham.com/news/2017/10/13/tech-nottingham-was-struck-by-lightning-and-it-was-awesome\" class=\"linkified\">https://www.technottingham.com/news/2017/10/13/tech-nottingham-was-struck-by-lightning-and-it-was-awesome</a>) about a previous Lightning Talks session at Tech Nottingham.</p> <p>**Slides?**</p> <p>You may prepare a few slides but it's totally optional. if you do, be prepared to share your screen when it’s your go.</p> <p>**Helpful Resources**</p> <p>We’ve collated various resources to help you on your speaking journey, from finding that initial idea, to planning and finally delivering your talk.<br/><a href=\"https://www.technottingham.com/speaking-resources\" class=\"linkified\">https://www.technottingham.com/speaking-resources</a></p> <p>**Win Free Stuff At WiT Notts!**</p> <p>We love giving away cool stuff! All you need to do is turn up and get involved 🙌</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it!</p> <p>Join our Slack group: <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One, Commify, MHR</p> <p>**Full event details**<br/><a href=\"https://www.technottingham.com/events/wit-march-2021\" class=\"linkified\">https://www.technottingham.com/events/wit-march-2021</a></p> ",
      "value" : "This month the audience rises up and takes control with Lightning Talks! Plus we'll be having fun, playing some games and giving away swag and prizes. New to Online WiT? Read about what to expect here: https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event ***Lightning Talks: The Audience Takes Over!*** This is the event where you take control - we'll be running lightning talks and anyone (women and gender minorities preferred) can speak! **What is a Lightning Talk?** A lightning talk is a short talk, under five minutes on whatever subject you wish to speak about (Code of Conduct permitting!). At the start of the session the audience has time to come up, write their talk title on a post-it and stick it to the board and those talks make up our evening. If there are too many talks to fit in to the evening, we'll vote on our favourites. For the audience it's a rapid-fire session where you'll learn loads and gain unique insight into the thoughts, ideas and passions of your peers. For speakers it's a unique opportunity to speak your mind, try out a talk idea and boost your confidence in front of a friendly crowd. Since the talks are short, the pressure to prep and polish is low and you can focus on key ideas you want to share. Great lightning talks we've seen: * Lightbulbs and being lazy * How to wing a presentation * When I learned to stop For inspiration, you can see some examples in this blog post (https://link.medium.com/saPHrF5F8T) about a previous Lightning Talks session at WiT Notts and this blog post (https://www.technottingham.com/news/2017/10/13/tech-nottingham-was-struck-by-lightning-and-it-was-awesome) about a previous Lightning Talks session at Tech Nottingham. **Slides?** You may prepare a few slides but it's totally optional. if you do, be prepared to share your screen when it’s your go. **Helpful Resources** We’ve collated various resources to help you on your speaking journey, from finding that initial idea, to planning and finally delivering your talk. https://www.technottingham.com/speaking-resources **Win Free Stuff At WiT Notts!** We love giving away cool stuff! All you need to do is turn up and get involved 🙌 **Join in with the Nottingham Tech Community online** The Tech Nottingham Slack group is a bustling chat community of Nottingham tech folk sharing ideas, jokes, stories and helping one another. We'd love for you to join in and be a part of it! Join our Slack group: http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Commify, MHR **Full event details** https://www.technottingham.com/events/wit-march-2021"
    } ],
    "start" : [ "2021-03-04T18:30:00Z" ],
    "end" : [ "2021-03-04T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham/events/276401970/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-02-16T18:06:42Z" ],
    "updated" : [ "2021-02-16T18:12:08Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Women In Tech, Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/4/b/d/7/600_464899415.jpeg" ],
        "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham" ]
      },
      "value" : "Women In Tech, Nottingham"
    } ]
  }
}
