{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Women in Tech 4th February - This is why the world isn't made for women" ],
    "description" : [ {
      "html" : "<p>This month we welcome the fantastic Saumya Surendran to speak at Women in Tech Nottingham</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>New to Online WiT? Read about what to expect here:<br/><a href=\"https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event\" class=\"linkified\">https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event</a></p> <p>***This is why the world isn't made for women like you and I***<br/>by Saumya Surendran</p> <p>Saumya will talk about how the technological world isn't made for women especially BIPOC women. This is why it is crucial for women to get into tech so that there is representation in the field. For example, car testing is not made for women in mind and it caters for the average Caucasian man. This can lead to many accidents. This is the same for medical testing. As women it is important for us to demand representation and join the technological world to create this representation. There can be no innovation without diversity. I want this talk to encourage women to pursue tech so that they can make sure that the world is made for them.</p> <p>**About Saumya**</p> <p>Saumya is a MSc Entrepreneurship, Innovation and Management student who has a keen interest in Technology. She does not have a coding background and wasn't the smartest during A Levels. This led her to think that she should settle for less and hope that she marries someone who earns more. She convinced herself that the patriarchal role of women is something she had to fulfil. However, as she grew older she realised that it’s never too late to pursue your dreams and anyone can become a leader when they put their mind to it. She is now pursuing her MSc and hopes that she can get into the world of Technology once she graduates.</p> <p>**Win Free Stuff At WiT Notts!**<br/>We love giving away cool stuff! Find out how to win - details coming soon.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One and Commify</p> ",
      "value" : "This month we welcome the fantastic Saumya Surendran to speak at Women in Tech Nottingham Plus we'll be having fun, playing some games and giving away swag and prizes. New to Online WiT? Read about what to expect here: https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event ***This is why the world isn't made for women like you and I*** by Saumya Surendran Saumya will talk about how the technological world isn't made for women especially BIPOC women. This is why it is crucial for women to get into tech so that there is representation in the field. For example, car testing is not made for women in mind and it caters for the average Caucasian man. This can lead to many accidents. This is the same for medical testing. As women it is important for us to demand representation and join the technological world to create this representation. There can be no innovation without diversity. I want this talk to encourage women to pursue tech so that they can make sure that the world is made for them. **About Saumya** Saumya is a MSc Entrepreneurship, Innovation and Management student who has a keen interest in Technology. She does not have a coding background and wasn't the smartest during A Levels. This led her to think that she should settle for less and hope that she marries someone who earns more. She convinced herself that the patriarchal role of women is something she had to fulfil. However, as she grew older she realised that it’s never too late to pursue your dreams and anyone can become a leader when they put their mind to it. She is now pursuing her MSc and hopes that she can get into the world of Technology once she graduates. **Win Free Stuff At WiT Notts!** We love giving away cool stuff! Find out how to win - details coming soon. **Join in with the Nottingham Tech Community online** The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! http://www.technottingham.com/slack **Thanks to our sponsors** Capital One and Commify"
    } ],
    "start" : [ "2021-02-04T18:30:00Z" ],
    "end" : [ "2021-02-04T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham/events/275502179/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-01-02T16:53:27Z" ],
    "updated" : [ "2021-01-02T16:54:17Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Women In Tech, Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/4/b/d/7/600_464899415.jpeg" ],
        "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham" ]
      },
      "value" : "Women In Tech, Nottingham"
    } ]
  }
}
