{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Women in Tech 7th October - Resilience at work" ],
    "description" : [ {
      "html" : "<p>This month we welcome the incredible Jaz Broughton to speak at Women in Tech Nottingham.</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>The event is remote via Zoom, the link to join will be provided on the day of the event.</p> <p>New to Online WiT? Read about what to expect here:<br/><a href=\"https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event\" class=\"linkified\">https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event</a></p> <p>------------------------</p> <p>***Resilience At Work***<br/>by Jaz Broughton</p> <p>Many of us think resilience is being untouchable; but it's far from that. Modern careers are always evolving in part through our own decisions but in other ways the decisions of others. Our ability to truly be flexible and adaptable is constantly being tested so resilience is our only defence. In this workshop we will explore our individual attitudes to change, our mindset in turbulence and a toolkit for building resilience to make it easier to recover from any plot twist.</p> <p>**About Jaz**</p> <p>Meet Jaz Broughton, a certified coach, tech community manager and ambitious careers expert, and lover of tea and R&amp;B. Jaz is on a mission to create phenomenal careers without limits and burnout so they can avoid the Sunday-night dread and dream big instead.</p> <p>Instead of waiting for someone to make space for her dreams she created them, armed with business cards aged 14 she embraced the very ambition that continues to be her catalyst today. With over 10 years experience empowering folks to make change in their career, she brings candor and clarity to her clients so they-too can embrace their ambition and become the person they've always been.</p> <p>Featured in and partnering with BBC's Radio 1, Reed Recruitment, Monzo Bank, Air b&amp;b, Tortoise Media &amp; more. Jaz' signature straight-talking style is both powerful and authentic, leaving people both inspired and equipped to get back in the driving seat of their careers. Her community love Jaz because of her practical approach, result-oriented training, and commitment to transform 10,000 careers by 2024.</p> <p>**Win Free Stuff At WiT Notts!**<br/>We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One, Commify, London Stock Exchange Group and MHR</p> <p>**For all the details, check our website**<br/><a href=\"https://www.technottingham.com/events/wit-october-2021\" class=\"linkified\">https://www.technottingham.com/events/wit-october-2021</a></p> ",
      "value" : "This month we welcome the incredible Jaz Broughton to speak at Women in Tech Nottingham. Plus we'll be having fun, playing some games and giving away swag and prizes. The event is remote via Zoom, the link to join will be provided on the day of the event. New to Online WiT? Read about what to expect here: https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event ------------------------ ***Resilience At Work*** by Jaz Broughton Many of us think resilience is being untouchable; but it's far from that. Modern careers are always evolving in part through our own decisions but in other ways the decisions of others. Our ability to truly be flexible and adaptable is constantly being tested so resilience is our only defence. In this workshop we will explore our individual attitudes to change, our mindset in turbulence and a toolkit for building resilience to make it easier to recover from any plot twist. **About Jaz** Meet Jaz Broughton, a certified coach, tech community manager and ambitious careers expert, and lover of tea and R&B. Jaz is on a mission to create phenomenal careers without limits and burnout so they can avoid the Sunday-night dread and dream big instead. Instead of waiting for someone to make space for her dreams she created them, armed with business cards aged 14 she embraced the very ambition that continues to be her catalyst today. With over 10 years experience empowering folks to make change in their career, she brings candor and clarity to her clients so they-too can embrace their ambition and become the person they've always been. Featured in and partnering with BBC's Radio 1, Reed Recruitment, Monzo Bank, Air b&b, Tortoise Media & more. Jaz' signature straight-talking style is both powerful and authentic, leaving people both inspired and equipped to get back in the driving seat of their careers. Her community love Jaz because of her practical approach, result-oriented training, and commitment to transform 10,000 careers by 2024. **Win Free Stuff At WiT Notts!** We’ll be giving away some awesome prizes to our lucky attendees. Details on how to win will be shared during the event. **Join in with the Nottingham Tech Community online** The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! http://www.technottingham.com/slack **Thanks to our sponsors** Capital One, Commify, London Stock Exchange Group and MHR **For all the details, check our website** https://www.technottingham.com/events/wit-october-2021"
    } ],
    "start" : [ "2021-10-07T17:30:00Z" ],
    "end" : [ "2021-10-07T19:30:00Z" ],
    "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham/events/280959839/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-09-23T07:56:43Z" ],
    "updated" : [ "2021-09-23T07:57:24Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Women In Tech, Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/4/b/d/7/600_464899415.jpeg" ],
        "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham" ]
      },
      "value" : "Women In Tech, Nottingham"
    } ]
  }
}
