{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "Women in Tech 7th January - Web Accessibility and Social Justice" ],
    "description" : [ {
      "html" : "<p>This month we welcome the fantastic Olu Niyiawo to speak at Women in Tech Nottingham</p> <p>Plus we'll be having fun, playing some games and giving away swag and prizes.</p> <p>New to Online WiT? Read about what to expect here:<br/><a href=\"https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event\" class=\"linkified\">https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event</a></p> <p>***The internet is broken: Web Accessibility and Social Justice***<br/>by Olu Niyiawo</p> <p>Accessible web practices - meaning here ways of building the web that allow those with impairments and disabilities to use it - might not seem like the coolest way to bring your activism to the internet, but it’s vital to having a web that works for us all.</p> <p>In this talk, we'll learn how transphobia, sexism, racism, ableism, homophobia and other types of discrimination are echoed and intersect on the web, locking some of the most vulnerable people out of essential services, fun activities and vital information, and what you can do to help make the web a more accessible place for all.</p> <p>**About Olu**</p> <p>Olu is a frontend developer at the Financial Times who adores Javascript-based technologies, semantic HTML, CSS, accessible websites, writing/speaking/listening/reading, bubble tea, Bee and Puppycat, lists, plantain, planning/scheming, unnecessary amounts of punctuation, run-on sentences, and personal organisation/growth/finance/development.</p> <p>They’re currently learning all about rust and distributed systems (ipfs, dat).<br/>They’re a writer, web artist, an emoji enthusiast, and a lifelong learner. They’re currently learning to sew, and to play ukulele and keyboard.</p> <p>Olu has been in love with the internet ever since they installed dial-up on the family computer, back when Virgin Media was NTL and it timed out every 15 minutes! They believe that the internet is something that should be available and accessible to every and anyone who wants to use it. It has changed their life in innumerable ways.<br/>They’ve given talks at Afrotech Fest and Non-Binary in Tech, about web accessibility and community.</p> <p>**Win Free Stuff At WiT Notts!**<br/>We love giving away cool stuff! Find out how to win - details coming soon.</p> <p>**Join in with the Nottingham Tech Community online**</p> <p>The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! <a href=\"http://www.technottingham.com/slack\" class=\"linkified\">http://www.technottingham.com/slack</a></p> <p>**Thanks to our sponsors**<br/>Capital One and Commify</p> ",
      "value" : "This month we welcome the fantastic Olu Niyiawo to speak at Women in Tech Nottingham Plus we'll be having fun, playing some games and giving away swag and prizes. New to Online WiT? Read about what to expect here: https://www.technottingham.com/news/2020/5/6/attending-an-online-tech-nottingham-event ***The internet is broken: Web Accessibility and Social Justice*** by Olu Niyiawo Accessible web practices - meaning here ways of building the web that allow those with impairments and disabilities to use it - might not seem like the coolest way to bring your activism to the internet, but it’s vital to having a web that works for us all. In this talk, we'll learn how transphobia, sexism, racism, ableism, homophobia and other types of discrimination are echoed and intersect on the web, locking some of the most vulnerable people out of essential services, fun activities and vital information, and what you can do to help make the web a more accessible place for all. **About Olu** Olu is a frontend developer at the Financial Times who adores Javascript-based technologies, semantic HTML, CSS, accessible websites, writing/speaking/listening/reading, bubble tea, Bee and Puppycat, lists, plantain, planning/scheming, unnecessary amounts of punctuation, run-on sentences, and personal organisation/growth/finance/development. They’re currently learning all about rust and distributed systems (ipfs, dat). They’re a writer, web artist, an emoji enthusiast, and a lifelong learner. They’re currently learning to sew, and to play ukulele and keyboard. Olu has been in love with the internet ever since they installed dial-up on the family computer, back when Virgin Media was NTL and it timed out every 15 minutes! They believe that the internet is something that should be available and accessible to every and anyone who wants to use it. It has changed their life in innumerable ways. They’ve given talks at Afrotech Fest and Non-Binary in Tech, about web accessibility and community. **Win Free Stuff At WiT Notts!** We love giving away cool stuff! Find out how to win - details coming soon. **Join in with the Nottingham Tech Community online** The conversation continues online in the Tech Nottingham Slack group, which is a bustling, friendly online community with a channel for (almost) everything you can think of from #pets-corner to #devcorner, #podcasts to #design and everything in between. We'd love to see you there! http://www.technottingham.com/slack **Thanks to our sponsors** Capital One and Commify"
    } ],
    "start" : [ "2021-01-07T18:30:00Z" ],
    "end" : [ "2021-01-07T20:30:00Z" ],
    "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham/events/275502128/" ],
    "location" : [ "Online" ],
    "published" : [ "2021-01-02T16:49:17Z" ],
    "updated" : [ "2021-01-02T16:50:47Z" ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Women In Tech, Nottingham" ],
        "photo" : [ "https://secure.meetupstatic.com/photos/event/4/b/d/7/600_464899415.jpeg" ],
        "url" : [ "https://www.meetup.com/Women-In-Tech-Nottingham" ]
      },
      "value" : "Women In Tech, Nottingham"
    } ]
  }
}
