{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Your attention span is being robbed!" ],
    "url" : [ "https://unstructed.tech/2022/09/07/your-attention-span-is-being-robbed/" ],
    "published" : [ "2022-09-07T23:15:25+02:00" ],
    "updated" : [ "2022-09-07T23:15:26+02:00" ],
    "content" : [ {
      "html" : "<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img width=\"640\" height=\"427\" src=\"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20640%20427'%3E%3C/svg%3E\" data-src=\"https://unstructed.tech/wp-content/uploads/2022/09/image.png\" alt=\"\" class=\"wp-image-3913 lazy\" data-srcset=\"https://unstructed.tech/wp-content/uploads/2022/09/image.png 640w, https://unstructed.tech/wp-content/uploads/2022/09/image-300x200.png 300w\" data-sizes=\"(max-width: 640px) 100vw, 640px\"><figcaption>Remains of your attention span. Photo by <a href=\"https://unsplash.com/photos/Oq4dyPV5Vus\" target=\"_blank\" rel=\"noreferrer noopener\">Pablo Martinez</a> on <a href=\"https://unsplash.com/@pablomp\" target=\"_blank\" rel=\"noreferrer noopener\">Unsplash</a></figcaption></figure></div>\n\n\n<p>This is exactly why you can&#x2019;t focus on reading anything longer than a mobile page length these days. Not even a blog post, let alone a book!</p>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">Your attention span is being robbed! You are being robbed of the ability to acquire useful info. You are being ROBBED of the experience of learning stuff!</p>\n\n\n\n<p>Sounds scary, right? It should! Because, you know, it is!</p>\n\n\n\n<p>The sad truth is that it&#x2019;s not just YOU. It&#x2019;s actually MYSELF as well. All that is being written is from first-hand experience.</p>\n\n\n\n<h2>Amusing Ourselves to Death</h2>\n\n\n\n<p>If you haven&#x2019;t heard about it before, <a href=\"https://www.amazon.com/Amusing-Ourselves-Death-Discourse-Business/dp/014303653X\" target=\"_blank\" rel=\"noreferrer noopener\"><em>Amusing Ourselves to Death: Public Discourse in the Age of Show Business</em></a> is an amazing book by Neil Postman. It was written back in the 80s but everything that he claims is still relevant today!</p>\n\n\n\n<p>Namely, he argues that introduction of TV as a medium has changed EVERYTHING. It destroyed people&#x2019;s attention span and narrowed it to mere 30 seconds (which seems to be the length of average TV commercial back in the day).</p>\n\n\n\n<p>What&#x2019;s more, he proceeds to make a case that this has affected EVERY single area of our lives!</p>\n\n\n\n<p>The sole purpose of TV, as he says, is NOT to spread information, but to ENTERTAIN, AMUSE and induce the feeling of pleasantness.</p>\n\n\n\n<p>And that would be great if it remained isolated to TV shows and Movies. Instead, he proceeds, this infected and spread to everything &#x2013; News, Religion, Education, etc.</p>\n\n\n\n<p>I won&#x2019;t go into too much depth of it because I&#x2019;d really advise you to read the book. His reasoning is &#x2013; everything that is being shown on TV is built around entertainment and short attention span. And, as such, <strong>you expect to be amused in every single area of your life.</strong></p>\n\n\n\n<h2>The slow &amp; painful death of written word</h2>\n\n\n\n<p>Look, I&#x2019;d really think it was myself only. Hell, I&#x2019;d even consider ascribing it to undiagnosed ADHD.</p>\n\n\n\n<p>But no. It&#x2019;s not just myself. It seems to be everyone (except YOU, of course!).</p>\n\n\n\n<p>The perfect example was when I wrote an article that, when embedded on Slack, said &#x201C;7 mins read&#x201D;. Quite a short one, no?</p>\n\n\n\n<p>Damn! A good friend of mine literally snapped at that moment.</p>\n\n\n\n<p>&#x201C;What the fuck man! Why the fuck are you writing such long shit? Do you really think I have 7 minutes to read a blog post? Damn!&#x201D;.</p>\n\n\n\n<p>To his defense, he was a father of a baby at the time and I can kind of understand it now.</p>\n\n\n\n<p>But turns out it&#x2019;s not just HIM. Many people proceeded to argue something along the same lines &#x2013; whenever you see a &#x201C;long&#x201D; blog post, you&#x2019;d usually avoid it; or read in-between the lines.</p>\n\n\n\n<p>You know what? It made me think. And then I realized that even MYSELF, the author of a 7-mins-long-article actually avoid reading anything that is longer than &#x2026; 1min? </p>\n\n\n\n<p>RIP written word. You will be missed.</p>\n\n\n\n<h2>The slow &amp; painful death of a Book</h2>\n\n\n\n<p>Honestly, if we can&#x2019;t focus on a short blog post, why&#x2019;d anyone in their right mindset think that books would be any different?</p>\n\n\n\n<p>Books are MADE TO BE LONG! Their chapters are LONG. Detaily!</p>\n\n\n\n<p>One of the longest I encountered so far was Stephen King&#x2019;s <em>The Stand</em>. Kindle reports it at 50+ hours of read time. My friend would have burned me alive if I mentioned this one.</p>\n\n\n\n<p>Books are on their death sentence, counting their last days before being executed.</p>\n\n\n\n<p>Which brings me to a rather interesting topic. A book, that is. <a href=\"https://www.amazon.com/Fahrenheit-451-Ray-Bradbury/dp/1451673310\" target=\"_blank\" rel=\"noreferrer noopener\">Fahrenheit 451</a>. A classic, some would say.</p>\n\n\n\n<p>I didn&#x2019;t like it that much, but it really has an interesting plot; an argument if you will.</p>\n\n\n\n<p>Allegedly, 451 Fahrenheit is a temperature at which the book burns. It&#x2019;s made up of course, but it&#x2019;s an interesting idea.</p>\n\n\n\n<p>Namely, the plot is about a dystopian society where books are banned and burned. They are banned and burned because they are deemed to be detrimental for the society, and, as such, have to be demolished in the worst way possible (i.e. by being put on fire).</p>\n\n\n\n<p>Interesting thing about genre dealing with these topics (1984 being a similar example) is that it&#x2019;s all about government destroying everything that would allow society to EDUCATE and THINK. By limiting the wisdom, and by propagating &#x201C;the right way&#x201D;, society is put under control of totalitarian dictatorship.</p>\n\n\n\n<p>Sounds scary. And that&#x2019;s because IT IS scary!</p>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">Books are supposed to be source of INFORMATION. A source of WISDOM. They are LONG because they are supposed to express the author&#x2019;s point if view. Their thinking process!</p>\n\n\n\n<p>They are NOT made to be amusing, but to be EDUCATIONAL. INFORMATIONAL. Eye-opening.</p>\n\n\n\n<p>And yet, we burn them without government asking us to do so.</p>\n\n\n\n<p>RIP written word. RIP books.</p>\n\n\n\n<h2>The slow &amp; painful death of Relationships</h2>\n\n\n\n<p>You thought it&#x2019;s just about words, right? Haha!</p>\n\n\n\n<p>You are being taught that EVERYTHING has to amuse you. Even your partner!</p>\n\n\n\n<p>Don&#x2019;t believe me? Just scroll through Instagram with <a href=\"https://www.instagram.com/explore/tags/relationshipgoals/\" target=\"_blank\" rel=\"noreferrer noopener\">#relationshipgoals</a> hashtag. See for yourself.</p>\n\n\n\n<p>Your partner, your friends and hell &#x2013; everyone around you is supposed to amuse you. And if they don&#x2019;t &#x2013; scroll them off!</p>\n\n\n\n<p>Speaking of scrolling &#x2026;</p>\n\n\n\n<h2>Infinite Scroll as a Slot-machine lever</h2>\n\n\n\n<p>You ever played slot machines? Or a roulette? Hell, have you ever GAMBLED?</p>\n\n\n\n<p>If you did &#x2013; you&#x2019;d know what I&#x2019;m talking about. If not &#x2013; well, you surely know people with gambling addiction.</p>\n\n\n\n<p>Gambling is addictive because it&#x2019;s FUN. Exciting. It makes you DREAM. It makes you WISH. It gives you HOPE and UNCERTAINTY. It&#x2019;s a freaking cocktail that rapes your brain into producing all kinds of chemical compounds that make you mad, sad, glad, tad, &#x2026; It&#x2019;s AMUSING!</p>\n\n\n\n<p>And on top of that &#x2013; <strong><em>it has incredibly short feedback cycle!</em></strong></p>\n\n\n\n<p>Every spin of roulette or a slot machine takes from 5 to 15 secs max! Just enough time to build-up the excitement and then drown in happiness or furry. Rinse&amp;repeat forever.</p>\n\n\n\n<p>Honestly speaking &#x2013; it&#x2019;s engineering, psychology and business at it&#x2019;s freaking best!</p>\n\n\n\n<p>You know who else figured this out? People who invented Infinite Scroll!</p>\n\n\n\n<p>It&#x2019;s that damn feature that never existed before which lets you keep scrolling FOREVER. There&#x2019;s no END OF PAGE. You can keep scrolling those images or videos forever and ever. And you always get served new and exciting content. It&#x2019;s a damn slot machine lever!</p>\n\n\n\n<p><em>(Interestingly enough, Aza Raskin inventor of Infinite Scroll <a href=\"https://twitter.com/aza/status/1138268959982022656?lang=en\" target=\"_blank\" rel=\"noreferrer noopener\">apologized for creating it in the first place)</a></em>.</p>\n\n\n\n<h2>What TikTok, Snapchat, Instagram, etc. got right</h2>\n\n\n\n<p>They figured out that in order to keep you amused, they have to provide you with a lever with extremely short feedback cycle. That plus infinite amount of carefully curated content being fed to you from the dungeons of recommendation engine machinery, working 24/7 to filter out anything but content that gets other people&#x2019;s attention.</p>\n\n\n\n<p>Not everyone got it right, though. LinkedIn&#x2019;s web app on mobile phones got it completely wrong. No matter how much you keep reloading it serves you shit-content.</p>\n\n\n\n<h2>Congratulations! Your attention span is between 1 and 3 seconds now!</h2>\n\n\n\n<p>The typical time-frame that TikTok, Snapchat and others have to amuse you. If it&#x2019;s not entertaining within first couple of seconds &#x2013; you scroll away (thanks to the dark magic of infinite-scroll!).</p>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">Congrats! You became a carbon-based medium for filtering out shit-content and feeding the recommendation engine that refuels both you and others looking for amusement!</p>\n\n\n\n<p>After all, maybe Douglas Adams had a point when he argued that planet Earth was made so that people could be a part of a huge machinery searching for an answer? The only part that he got wrong is that we are not searching for answer but feeding that gigantic Recommendation Engine. Feeding that huge slot machine that we anticipate will give us a jackpot every time now.</p>\n\n\n\n<p>Except that jackpot never comes. And we keep pulling that lever.</p>\n\n\n\n<h2>How to fight back?</h2>\n\n\n\n<p>Honestly? I have no idea.</p>\n\n\n\n<p>I mean, you probably can&#x2019;t even sit on a beach without having your brain remind you that, you know, this needs SHARING. </p>\n\n\n\n<p>Even though the beach is considered the temple of ultimate zen, calm and meditation. You. Have. To. Share. Your attention span is simply too short to actually enjoy that beach!</p>\n\n\n\n<p>Hell, I MYSELF am guilty as charged! I&#x2019;m addicted to Reddit, LinkedIn and, occasionally &#x2013; Instagram.</p>\n\n\n\n<p>Maybe something that I&#x2019;ve learned in therapy COULD be entertained as a possibility. It&#x2019;s a technique that I don&#x2019;t even know HOW it&#x2019;s called but it boils down to dedicating 45mins to grievance. As in &#x2013; you dedicate 45mins per day when you can focus on grieving (e.g. over a failed relationship) and at any other time of the day you have to delay doing it until your 45-mins-of-grief time comes.</p>\n\n\n\n<p>No idea if it COULD work, but it&#x2019;s a possibility that I&#x2019;m entertaining at the moment.</p>\n\n\n\n<p>If you have ideas to share or techniques that you follow in order to strike back &#x2013; please do let me know!</p>\n\n\n\n<p>If not &#x2013; well, maybe the written word has actually LOST this war?</p>\n\n\n\n<div class=\"wp-container-2 wp-block-group has-background\" style=\"background-color:#f8f8f8\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-container-1 wp-block-group\"><div class=\"wp-block-group__inner-container\">\n<h2>Other stuff you might like:</h2>\n\n\n\n<ul><li><a href=\"https://unstructed.tech/2022/06/23/investing-in-memories/\">Investing in memories</a></li><li><a href=\"https://unstructed.tech/2021/04/09/how-i-learned-to-read-and-read-30-books-in-a-year/\">How I Learned To Read (and read 30 books in a year)</a></li><li><a href=\"https://unstructed.tech/2021/10/14/rereading-the-same-book/\">Rereading the Same Book</a></li></ul>\n\n\n\n<p>If you want to stay up to date about what&#x2019;s happening on this blog, you may befriend me on&#xA0;<a href=\"https://www.linkedin.com/in/mihailojoksimovic/\" target=\"_blank\" rel=\"noreferrer noopener\">LinkedIn</a>, follow my posts on&#xA0;<a href=\"https://www.instagram.com/unstructedblog/\" target=\"_blank\" rel=\"noreferrer noopener\">Instagram</a>&#xA0;and&#xA0;<a href=\"https://twitter.com/GlavniProgramer\" target=\"_blank\" rel=\"noreferrer noopener\">Twitter</a>, or subscribe to <a href=\"https://unstructed.tech/feed/\" target=\"_blank\" rel=\"noreferrer noopener\">RSS feed</a>.</p>\n</div></div>\n</div></div>\n\n\n\n<p></p>",
      "value" : "Remains of your attention span. Photo by Pablo Martinez on Unsplash\nThis is exactly why you can’t focus on reading anything longer than a mobile page length these days. Not even a blog post, let alone a book!\nYour attention span is being robbed! You are being robbed of the ability to acquire useful info. You are being ROBBED of the experience of learning stuff!\nSounds scary, right? It should! Because, you know, it is!\nThe sad truth is that it’s not just YOU. It’s actually MYSELF as well. All that is being written is from first-hand experience. Amusing Ourselves to Death\nIf you haven’t heard about it before, Amusing Ourselves to Death: Public Discourse in the Age of Show Business is an amazing book by Neil Postman. It was written back in the 80s but everything that he claims is still relevant today!\nNamely, he argues that introduction of TV as a medium has changed EVERYTHING. It destroyed people’s attention span and narrowed it to mere 30 seconds (which seems to be the length of average TV commercial back in the day).\nWhat’s more, he proceeds to make a case that this has affected EVERY single area of our lives!\nThe sole purpose of TV, as he says, is NOT to spread information, but to ENTERTAIN, AMUSE and induce the feeling of pleasantness.\nAnd that would be great if it remained isolated to TV shows and Movies. Instead, he proceeds, this infected and spread to everything – News, Religion, Education, etc.\nI won’t go into too much depth of it because I’d really advise you to read the book. His reasoning is – everything that is being shown on TV is built around entertainment and short attention span. And, as such, you expect to be amused in every single area of your life. The slow & painful death of written word\nLook, I’d really think it was myself only. Hell, I’d even consider ascribing it to undiagnosed ADHD.\nBut no. It’s not just myself. It seems to be everyone (except YOU, of course!).\nThe perfect example was when I wrote an article that, when embedded on Slack, said “7 mins read”. Quite a short one, no?\nDamn! A good friend of mine literally snapped at that moment.\n“What the fuck man! Why the fuck are you writing such long shit? Do you really think I have 7 minutes to read a blog post? Damn!”.\nTo his defense, he was a father of a baby at the time and I can kind of understand it now.\nBut turns out it’s not just HIM. Many people proceeded to argue something along the same lines – whenever you see a “long” blog post, you’d usually avoid it; or read in-between the lines.\nYou know what? It made me think. And then I realized that even MYSELF, the author of a 7-mins-long-article actually avoid reading anything that is longer than … 1min?\nRIP written word. You will be missed. The slow & painful death of a Book\nHonestly, if we can’t focus on a short blog post, why’d anyone in their right mindset think that books would be any different?\nBooks are MADE TO BE LONG! Their chapters are LONG. Detaily!\nOne of the longest I encountered so far was Stephen King’s The Stand. Kindle reports it at 50+ hours of read time. My friend would have burned me alive if I mentioned this one.\nBooks are on their death sentence, counting their last days before being executed.\nWhich brings me to a rather interesting topic. A book, that is. Fahrenheit 451. A classic, some would say.\nI didn’t like it that much, but it really has an interesting plot; an argument if you will.\nAllegedly, 451 Fahrenheit is a temperature at which the book burns. It’s made up of course, but it’s an interesting idea.\nNamely, the plot is about a dystopian society where books are banned and burned. They are banned and burned because they are deemed to be detrimental for the society, and, as such, have to be demolished in the worst way possible (i.e. by being put on fire).\nInteresting thing about genre dealing with these topics (1984 being a similar example) is that it’s all about government destroying everything that would allow society to EDUCATE and THINK. By limiting the wisdom, and by propagating “the right way”, society is put under control of totalitarian dictatorship.\nSounds scary. And that’s because IT IS scary!\nBooks are supposed to be source of INFORMATION. A source of WISDOM. They are LONG because they are supposed to express the author’s point if view. Their thinking process!\nThey are NOT made to be amusing, but to be EDUCATIONAL. INFORMATIONAL. Eye-opening.\nAnd yet, we burn them without government asking us to do so.\nRIP written word. RIP books. The slow & painful death of Relationships\nYou thought it’s just about words, right? Haha!\nYou are being taught that EVERYTHING has to amuse you. Even your partner!\nDon’t believe me? Just scroll through Instagram with #relationshipgoals hashtag. See for yourself.\nYour partner, your friends and hell – everyone around you is supposed to amuse you. And if they don’t – scroll them off!\nSpeaking of scrolling … Infinite Scroll as a Slot-machine lever\nYou ever played slot machines? Or a roulette? Hell, have you ever GAMBLED?\nIf you did – you’d know what I’m talking about. If not – well, you surely know people with gambling addiction.\nGambling is addictive because it’s FUN. Exciting. It makes you DREAM. It makes you WISH. It gives you HOPE and UNCERTAINTY. It’s a freaking cocktail that rapes your brain into producing all kinds of chemical compounds that make you mad, sad, glad, tad, … It’s AMUSING!\nAnd on top of that – it has incredibly short feedback cycle!\nEvery spin of roulette or a slot machine takes from 5 to 15 secs max! Just enough time to build-up the excitement and then drown in happiness or furry. Rinse&repeat forever.\nHonestly speaking – it’s engineering, psychology and business at it’s freaking best!\nYou know who else figured this out? People who invented Infinite Scroll!\nIt’s that damn feature that never existed before which lets you keep scrolling FOREVER. There’s no END OF PAGE. You can keep scrolling those images or videos forever and ever. And you always get served new and exciting content. It’s a damn slot machine lever!\n(Interestingly enough, Aza Raskin inventor of Infinite Scroll apologized for creating it in the first place). What TikTok, Snapchat, Instagram, etc. got right\nThey figured out that in order to keep you amused, they have to provide you with a lever with extremely short feedback cycle. That plus infinite amount of carefully curated content being fed to you from the dungeons of recommendation engine machinery, working 24/7 to filter out anything but content that gets other people’s attention.\nNot everyone got it right, though. LinkedIn’s web app on mobile phones got it completely wrong. No matter how much you keep reloading it serves you shit-content. Congratulations! Your attention span is between 1 and 3 seconds now!\nThe typical time-frame that TikTok, Snapchat and others have to amuse you. If it’s not entertaining within first couple of seconds – you scroll away (thanks to the dark magic of infinite-scroll!).\nCongrats! You became a carbon-based medium for filtering out shit-content and feeding the recommendation engine that refuels both you and others looking for amusement!\nAfter all, maybe Douglas Adams had a point when he argued that planet Earth was made so that people could be a part of a huge machinery searching for an answer? The only part that he got wrong is that we are not searching for answer but feeding that gigantic Recommendation Engine. Feeding that huge slot machine that we anticipate will give us a jackpot every time now.\nExcept that jackpot never comes. And we keep pulling that lever. How to fight back?\nHonestly? I have no idea.\nI mean, you probably can’t even sit on a beach without having your brain remind you that, you know, this needs SHARING.\nEven though the beach is considered the temple of ultimate zen, calm and meditation. You. Have. To. Share. Your attention span is simply too short to actually enjoy that beach!\nHell, I MYSELF am guilty as charged! I’m addicted to Reddit, LinkedIn and, occasionally – Instagram.\nMaybe something that I’ve learned in therapy COULD be entertained as a possibility. It’s a technique that I don’t even know HOW it’s called but it boils down to dedicating 45mins to grievance. As in – you dedicate 45mins per day when you can focus on grieving (e.g. over a failed relationship) and at any other time of the day you have to delay doing it until your 45-mins-of-grief time comes.\nNo idea if it COULD work, but it’s a possibility that I’m entertaining at the moment.\nIf you have ideas to share or techniques that you follow in order to strike back – please do let me know!\nIf not – well, maybe the written word has actually LOST this war? Other stuff you might like: Investing in memoriesHow I Learned To Read (and read 30 books in a year)Rereading the Same Book\nIf you want to stay up to date about what’s happening on this blog, you may befriend me on LinkedIn, follow my posts on Instagram and Twitter, or subscribe to RSS feed.",
      "lang" : "en-US"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Mihailo Joksimovic" ],
        "url" : [ "https://unstructed.tech/author/unstructed/" ]
      },
      "lang" : "en-US",
      "value" : "Mihailo Joksimovic"
    } ]
  },
  "lang" : "en-US"
}
