{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Jean :donor: (@bohemianchic@infosec.exchange)" ],
    "summary" : [ "I've been asked to comment on what I think the biggest tech trend in 2024 will be?\n\nShort answer: Slavery\n\nand let me tell you why. Data is the lifeblood that allows any machine learning model to perform its task. It’s not magic. It’s not the so-called “AI” being intelligent or intuitive. It’s statistics. And as the tech sector delves into rapid developments of specialised LLMs that they can further commoditise, they will require vast amounts of diverse data to train—leading to what some have called as data hunting.\n\nAnd unfortunately, all of us who have posted even a single piece of content online are all part of this—whether we like it or not. We are now part of a universal digital sweatshop that transcends international borders. Our labour is ignored and uncompensated based on the capitalist belief that since we shared content freely, companies have the right to monetise it whenever they want. Time and time again, as we have seen in recent news, companies have collected our data without explicit consent. And when they do ask for ‘consent’, they give us word salad in the user agreements or just ask us to opt our way out of the inferno that they manufactured. The aggressive collection of data paves the way for a future where a few corporations will have disproportionate control over vast datasets, which they can exploit for unwarranted targeted advertising, surveillance and practices that would reinforce biases or unfairly influence individual choices and behaviours.\n\nAnd let’s not forget the second step in the process where people (they call as taskers), mostly from the Global South, are hired for 2 USD a day to classify images, videos and texts so that your LLMs will not spew out gibberish. This is the reality behind your glamorous “AI” models. While “AI” companies in the developed world reap huge profits, the groundwork is outsourced to workers in Bangladesh, Kenya, the Philippines and India. But it is fine, isn’t it? As long as we don’t see them. Out of sight, out of mind." ],
    "url" : [ "https://infosec.exchange/@bohemianchic/111016268784105439" ]
  }
}
