{
  "properties" : {
    "author" : [ {
      "properties" : {
        "location" : [ {
          "properties" : {
            "name" : [ "New York, USA" ]
          },
          "type" : [ "h-card", "p-location" ]
        } ],
        "name" : [ "Ashley M. Gjøvik" ],
        "nickname" : [ "ashleygjovik" ],
        "numeric-id" : [ "1374435454343254017" ],
        "photo" : [ "https://pbs.twimg.com/profile_images/1643983198731505666/HpL6tjb1.jpg" ],
        "published" : [ "2021-03-23T18:58:46+00:00" ],
        "uid" : [ "tag:twitter.com:ashleygjovik" ],
        "url" : [ "https://twitter.com/ashleygjovik", "http://ashleygjovik.com" ]
      },
      "type" : [ "h-card" ]
    } ],
    "content" : [ {
      "html" : "<div style=\"white-space: pre\">BlueSky Terms of Service gives Jack a 'perpetual' &amp; 'irrevocable' license to all your content (posts, name, likeness, pics)\n\nBlueSky can delete your account for any reason, but may refuse to delete it if you ask\n\nYou can't screenshot BlueSky\n\nAll disputes = individual arbitration</div>",
      "value" : "BlueSky Terms of Service gives Jack a 'perpetual' & 'irrevocable' license to all your content (posts, name, likeness, pics)\n\nBlueSky can delete your account for any reason, but may refuse to delete it if you ask\n\nYou can't screenshot BlueSky\n\nAll disputes = individual arbitration"
    } ],
    "photo" : [ {
      "alt" : "Rights in User Content Granted by You to Us. By making any User Content available through the Services, you hereby grant to Bluesky and its subsidiaries, affiliates, licensee, successors, and assigns (the “Bluesky Parties”) an irrevocable, non-exclusive, perpetual, transferable, worldwide, royalty-free license, with the right to sublicense (through multiple tiers of sub-licensing), to use, copy, modify, adapt, crop, edit, creative derivative works, distribute, publicly display, publicly perform and otherwise exploit in any media now known or hereafter devised, your User Content, in whole or in part, in connection with (i) providing the Services and Content to you and to others; (ii) promote and market Bluesky and our Services, including without limitation through Bluesky’s owned, operated, and/or branded social media channels. For example, Bluesky may create compilations of Content made available by Account holders (including your User Content), and/or use User Content or such compilat",
      "value" : "https://pbs.twimg.com/media/Fuv3J2DWcA8YJS_.png"
    }, {
      "alt" : "General Prohibitions and Bluesky’s Enforcement Rights. You agree not to do any of the following:\nPost, upload, publish, submit or transmit any content that: (i) infringes, misappropriates or violates a third party’s patent, copyright, trademark, trade secret, moral rights or other intellectual property rights, or rights of publicity or privacy; or (ii) violates any applicable law or regulation or would give rise to civil liability;\nUse, display, mirror or frame the Services, Bluesky’s name, any Bluesky trademark, logo or other proprietary information, without Bluesky’s express written consent;\nAccess, tamper with, or use non-public areas of the Services;\nAttempt to probe, scan or test the vulnerability of any Bluesky system or network or breach any security or authentication measures without reporting such vulnerability or breach to support@bsky.app, except as part of community testing initiatives authorized by Bluesky;",
      "value" : "https://pbs.twimg.com/media/Fuv2gUaWIAAaqIh.png"
    }, {
      "alt" : "Termination. We may terminate or suspend, in whole or in part, your access to and use of the Services, including suspending access to or terminating your account, at our sole discretion, at any time and without notice to you. You may request deletion of your account, which we will consider on a case-by-case basis, by emailing support@bsky.app. Upon any termination, discontinuation or cancellation of the Services or your account, the following Sections will survive: 2, 7(a), 7(b), 7(d), 7(e), 7(f), 8, 10, 13, 14, 15, 16, 17, 18 and 19.\nWarranty Disclaimers. THE SERVICES ARE PROVIDED “AS IS,” WITHOUT WARRANTY OF ANY KIND. WITHOUT LIMITING THE FOREGOING, WE EXPLICITLY DISCLAIM ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT AND NON-INFRINGEMENT, AND ANY WARRANTIES ARISING OUT OF COURSE OF DEALING OR USAGE OF TRADE. WE MAKE NO WARRANTY THAT THE SERVICES WILL MEET YOUR REQUIREMENTS OR BE AVAILABLE ON AN UNINTERRUPTED, SECURE, OR ERROR-FREE BASIS.",
      "value" : "https://pbs.twimg.com/media/Fuv221GWcAwT_lY.png"
    }, {
      "alt" : "Dispute Resolution.\nMandatory Arbitration of Disputes. We each agree that any dispute, claim or controversy arising out of or relating to these Terms or the breach, termination, enforcement, interpretation or validity thereof or the use of the Services (collectively, “Disputes”) will be resolved solely by binding, individual arbitration and not in a class, representative or consolidated action or proceeding . You and Bluesky agree that the U.S. Federal Arbitration Act governs the interpretation and enforcement of these Terms, and that you and Bluesky are each waiving the right to a trial by jury or to participate in a class action. This arbitration provision shall survive termination of these Terms.",
      "value" : "https://pbs.twimg.com/media/Fuv3CMuWcAMjc6q.png"
    } ],
    "published" : [ "2023-04-27T20:34:15+00:00" ],
    "uid" : [ "tag:twitter.com:1651686218319425570" ],
    "url" : [ "https://twitter.com/ashleygjovik/status/1651686218319425570" ]
  },
  "type" : [ "h-entry" ]
}
