{
  "properties" : {
    "author" : [ {
      "properties" : {
        "location" : [ {
          "properties" : {
            "name" : [ "San Francisco / Sea Ranch" ]
          },
          "type" : [ "h-card", "p-location" ]
        } ],
        "name" : [ "John Voss" ],
        "nickname" : [ "heyjovo" ],
        "numeric-id" : [ "115837697" ],
        "photo" : [ "https://pbs.twimg.com/profile_images/1432173267561762820/u0r085xh.jpg" ],
        "published" : [ "2010-02-20T04:06:05+00:00" ],
        "uid" : [ "tag:twitter.com:heyjovo" ],
        "url" : [ "https://twitter.com/heyjovo", "http://www.jovo.design" ]
      },
      "type" : [ "h-card" ]
    } ],
    "content" : [ "Pride is canceled. Everyone go home and think about how we got here." ],
    "photo" : [ {
      "alt" : "Screencap:\n\nSerif is a community of LGBTQ+ creators & leaders assembling spaces for us, by us.\n\nDance floors and dating apps dominate the history of queer spaces. Within these physical and digital containers, we're often reduced to short-lived entanglements and impulsive swipes. While these spaces have been integral to our collective solidarity, we're ready for the next phase of LGBTQ+ community.\nWe need spaces where we can cultivate a depth of relationship that transcends orientation, age, race, gender, and industry. We need physical and digital places that support whole-person growth while preserving our identity for future generations.\nThrough web3 and the extraordinary powers of our community, we can turn this dream into a reality.\nWelcome to Serif.",
      "value" : "https://pbs.twimg.com/media/FTTa0K2UUAAwhZf.jpg"
    }, {
      "alt" : "Why web3\nImagine if Alan Turing's queerness was never erased from his contributions to computer science and the outcome of World War II.\nImagine if all of The Houses could reap the benefits from the appropriation of Voguing. Imagine if - instead of corporations - we could own the power of Pride.\nWe don't need to imagine any further: all of this is possible in web3. The LGBTQ+ economy comprises 10% of global consumer spending; Crypto is a $10 trillion-dollar industry actively reshaping our\nrelationship to culture.\nWhat else would be possible if web3 was even just a little bit more queer?\nThis is our chance to find out. To guarantee the legacy of LGBTQ+ culture and be recognized for our economic impact, it's crucial that we leverage web3.",
      "value" : "https://pbs.twimg.com/media/FTTa0K0UEAIjLI3.jpg"
    } ],
    "published" : [ "2022-05-21T18:54:10+00:00" ],
    "uid" : [ "tag:twitter.com:1528086768800608256" ],
    "url" : [ "https://twitter.com/heyjovo/status/1528086768800608256" ]
  },
  "type" : [ "h-entry" ]
}
