{
  "properties" : {
    "author" : [ {
      "properties" : {
        "location" : [ {
          "properties" : {
            "name" : [ "The Outlands" ]
          },
          "type" : [ "h-card", "p-location" ]
        } ],
        "name" : [ "Apex Legends" ],
        "nickname" : [ "PlayApex" ],
        "numeric-id" : [ "1048018930785083392" ],
        "photo" : [ "https://pbs.twimg.com/profile_images/1222942571376209920/raMKhiHq.jpg" ],
        "published" : [ "2018-10-05T01:15:59+00:00" ],
        "uid" : [ "tag:twitter.com:PlayApex" ],
        "url" : [ "https://twitter.com/PlayApex", "http://playapex.com" ]
      },
      "type" : [ "h-card" ]
    } ],
    "content" : [ "A girl's best friend" ],
    "photo" : [ {
      "alt" : "A comic issue focusing on Loba. It takes place on April 9, 2726 - Psamathe\n\nPage 1 shows a soiree taking place at the Chenosky Auction House. Jaime and Loba are working together, blending with the crowd. Loba slips away, heading into a heavily secured vault, looking for something in particular. Instead, something else catches her eye by surprise",
      "value" : "https://pbs.twimg.com/media/FbbW6c4UIAAqb0x.jpg"
    }, {
      "alt" : "Page 2 begins with a flashback of Loba's parents dancing as her mother holds a fan, which we now see in a case in front of her. Jaime wonders what its taking her so long. Loba gets to work trying to free the fan from its case with a laser only to have her hand caught in a trap as she reaches inside.",
      "value" : "https://pbs.twimg.com/media/FbbXHxeVsAEGZvE.jpg"
    }, {
      "alt" : "Page 3 starts with a panicked Jaime outside of the auction house as guards pass him by. Back inside, however, Loba works calmly to free herself. Guards finally make their way to her, crashing into the room and fanning out as their lead makes his way up to Loba and is promptly met with a headbutt to the face.",
      "value" : "https://pbs.twimg.com/media/FbbXMrsUYAEc5Xv.jpg"
    }, {
      "alt" : "Page 4 has Loba leaping into cover with ease, fighting back as the guards run out of bullets. She makes quick work of several goons, but their leader persists, until he's met a sudden blow to the head from an additional player--Jaime. Loba makes her way over to the case to retrieve the fan and the two calmly make their way to the exit.\n\n\"To be continued\"",
      "value" : "https://pbs.twimg.com/media/FbbXUWLUUAAgfNy.jpg"
    } ],
    "published" : [ "2022-08-30T18:01:42+00:00" ],
    "uid" : [ "tag:twitter.com:1564674739989123072" ],
    "url" : [ "https://twitter.com/PlayApex/status/1564674739989123072" ]
  },
  "type" : [ "h-entry" ]
}
