{
  "properties" : {
    "author" : [ {
      "properties" : {
        "location" : [ {
          "properties" : {
            "name" : [ "Derby, England" ]
          },
          "type" : [ "h-card", "p-location" ]
        } ],
        "name" : [ "Rob Whitaker" ],
        "nickname" : [ "RobRWAPP" ],
        "numeric-id" : [ "21470415" ],
        "photo" : [ "https://pbs.twimg.com/profile_images/1268088757640671234/_4GnBzQR.jpg" ],
        "published" : [ "2009-02-21T07:51:37+00:00" ],
        "uid" : [ "tag:twitter.com:RobRWAPP" ],
        "url" : [ "https://twitter.com/RobRWAPP", "https://www.apress.com/gp/book/9781484258132" ]
      },
      "type" : [ "h-card" ]
    } ],
    "content" : [ "Had an incredible day 🥰" ],
    "photo" : [ {
      "alt" : "Profile of a man in blue trousers and a grey T-shirt with black hair and beard. Feeding small fish to penguins. The 4 penguins are lined up with their wings outstretched in anticipation. The penguin at the front of the line is reaching up to the man for the fish. A metal bucket of fish sits atop a bright orange penguin nest box.",
      "value" : "https://pbs.twimg.com/media/FVO3nrCX0AEuBW0.jpg"
    }, {
      "alt" : "Man in blue shirt and a grey T-shirt with black hair and beard. Feeding leaves from a branch to a tapir. The tapir is reaching up with its flexible nose to reach the leaves on the branch the man is holding.",
      "value" : "https://pbs.twimg.com/media/FVO3nrAX0AU-qrF.jpg"
    }, {
      "alt" : "Man in blue trousers and a grey T-shirt with a blue over shirt with black hair and beard. The man is kissing a Dik-dik. A very small deer. The Dik-dik is standing on hind legs and is stretching to kiss the man. The Dik-dik is grey towards the rump becoming tan towards the front. It has very fragile looking front legs reaching to the man’s chest. It has a spiky hair-do and exceptionally cute, tiny, spiky antlers.",
      "value" : "https://pbs.twimg.com/media/FVO3nq_XEAMOd1t.jpg"
    }, {
      "alt" : "Man in blue trousers, a grey T-shirt  and blue over shirt with black hair and beard. A black lemur sits awkwardly on the man’s left shoulder. It is facing the ground. The man is looking towards the lemur. The man’s left hand is outstretched in front of him handing a small piece of sweet potato in a flat hand covered in a blue latex glove. A pair of grey lemurs are sitting on a rope swing and one lemur has grabbed the sweet potato. The second lemur is behind the first, holding the man’s hand while staring at the sweet potato the other lemur is holding.",
      "value" : "https://pbs.twimg.com/media/FVO3nrvWIAMI_uV.jpg"
    } ],
    "published" : [ "2022-06-14T18:13:23+00:00" ],
    "uid" : [ "tag:twitter.com:1536773811122601987" ],
    "url" : [ "https://twitter.com/RobRWAPP/status/1536773811122601987" ]
  },
  "type" : [ "h-entry" ]
}
