{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "IndieWeb Proof-of-Concept" ],
    "category" : [ "Projects", "#projects", "#indieweb", "#serverless", "#micropub" ],
    "url" : [ "https://crowdersoup.com/posts/projects/indieweb/indieweb-proof-of-concept/" ],
    "published" : [ "2022-06-03 08:10" ],
    "content" : [ {
      "html" : "<p>The past few days I&#x2019;ve been working on a proof-of-concept for this blog. It&#x2019;s\npart of the roadmap I included in <a href=\"https://crowdersoup.com/posts/site-updates/new-theme-back-to-basics/\">the post</a> about this sites new theme.\nI already took care of <a href=\"https://crowdersoup.com/posts/site-updates/simple-css-classless-framework/\">basic styling</a> (and code block styles) by using\nSimple.css. I also marked up all the posts on this site as an <code>article</code>\n(<code>h-entry</code>).</p>\n\n<p>That means sending / receiving webmentions and adding micropub support is up\nnext. But in order to do those things I needed to figure out <em>how</em>. This site\nis a static one. It&#x2019;s content lives in <a href=\"https://github.com/CrowderSoup/crowdersoup.com\">a GitHub repo</a>. It is built and\ndeployed any time I commit to the <code>main</code> branch. So how will I post to my site\n(or allow webmentions)?</p>\n\n<h3 id=\"the-idea\">The Idea</h3>\n\n<p>My plan is fairly straightforward:</p>\n\n<ul>\n<li>Serverless functions (in <a href=\"https://vercel.com\">Vercel</a>, where this site is hosted) act as the\nmicropub / webmention endpoints</li>\n<li>Those endpoints write a file to the GitHub repo where the site is hosted (in\na branch)</li>\n<li>The branch is merged to <code>main</code> after review, causing it to be published on my\nsite</li>\n</ul>\n\n<h3 id=\"the-proof\">The Proof</h3>\n\n<p>I created <a href=\"https://github.com/CrowderSoup/indieweb-proof-of-concept\">a new website</a> that is roughly the same as this one. It&#x2019;s built\nfrom a GitHub repo, hosted in Vercel, uses Hugo, even the same theme. I added\nan endpoint using serverless functions and tested it to see if I could do the\nabove.</p>\n\n<p>It turns out I totally can! My endpoint approximates some of the <a href=\"https://www.w3.org/TR/micropub\">Micropub\nspec</a>. It accepts a request, builds a post, and creates it as a new file on\nmy site. It honestly felt like magic the first time it worked!</p>\n\n<h3 id=\"the-implementation\">The Implementation</h3>\n\n<p>The implementation won&#x2019;t be that far off from the concept. I&#x2019;ll of course have\nto fully implement the Micropub spec (and webmention). Realistically the only\nkinds of posts I&#x2019;ll make using the micropub endpoint are <code>notes</code>, <code>photo</code>,\n<code>like</code>, <code>reply</code>, etc. Things that would live under <code>/micro</code>, not <code>/posts</code>.</p>\n\n<p>I&#x2019;m going to make each of these follow this scheme:\n<code>/micro/&lt;kind&gt;/&lt;date&gt;/&lt;slug&gt;</code>, and the actual content will live in an\n<code>index.md</code> file in a folder with that path. I had thought about just doing\n<code>&lt;slug&gt;.md</code>, however using a folder with an <code>index.md</code> file gives me the\nability to put webmentions associated with a post in a <code>webmentions</code> folder\nunder the post. That then will allow me to iterate over them in the template\nfor display without much effort.</p>\n\n<h3 id=\"summary\">Summary</h3>\n\n<p>I&#x2019;m super excited about the result of this proof-of-concept. It means I can\ncontinue to move forward with implementing IndieWeb principals on this site in\na way that makes sense to me. Hopefully it&#x2019;ll be in a way that makes sense to\nothers as well.</p>\n\n<p>You will notice though, that I didn&#x2019;t touch on <strong>sending</strong> webmentions. That&#x2019;s\nbecause that&#x2019;s another project altogether that I need to tackle. I&#x2019;ll have\nanother proof-of-concept coming up around <em>that</em> project soon!</p>\n\n<!-- LINKS -->",
      "value" : "The past few days I’ve been working on a proof-of-concept for this blog. It’s part of the roadmap I included in the post about this sites new theme. I already took care of basic styling (and code block styles) by using Simple.css. I also marked up all the posts on this site as an article (h-entry).\nThat means sending / receiving webmentions and adding micropub support is up next. But in order to do those things I needed to figure out how. This site is a static one. It’s content lives in a GitHub repo. It is built and deployed any time I commit to the main branch. So how will I post to my site (or allow webmentions)? The Idea\nMy plan is fairly straightforward: Serverless functions (in Vercel, where this site is hosted) act as the micropub / webmention endpoints Those endpoints write a file to the GitHub repo where the site is hosted (in a branch) The branch is merged to main after review, causing it to be published on my site The Proof\nI created a new website that is roughly the same as this one. It’s built from a GitHub repo, hosted in Vercel, uses Hugo, even the same theme. I added an endpoint using serverless functions and tested it to see if I could do the above.\nIt turns out I totally can! My endpoint approximates some of the Micropub spec. It accepts a request, builds a post, and creates it as a new file on my site. It honestly felt like magic the first time it worked! The Implementation\nThe implementation won’t be that far off from the concept. I’ll of course have to fully implement the Micropub spec (and webmention). Realistically the only kinds of posts I’ll make using the micropub endpoint are notes, photo, like, reply, etc. Things that would live under /micro, not /posts.\nI’m going to make each of these follow this scheme: /micro/<kind>/<date>/<slug>, and the actual content will live in an index.md file in a folder with that path. I had thought about just doing <slug>.md, however using a folder with an index.md file gives me the ability to put webmentions associated with a post in a webmentions folder under the post. That then will allow me to iterate over them in the template for display without much effort. Summary\nI’m super excited about the result of this proof-of-concept. It means I can continue to move forward with implementing IndieWeb principals on this site in a way that makes sense to me. Hopefully it’ll be in a way that makes sense to others as well.\nYou will notice though, that I didn’t touch on sending webmentions. That’s because that’s another project altogether that I need to tackle. I’ll have another proof-of-concept coming up around that project soon!",
      "lang" : "en"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Aaron Crowder" ],
        "url" : [ "https://crowdersoup.com" ]
      },
      "lang" : "en",
      "value" : "Aaron Crowder"
    } ]
  },
  "lang" : "en"
}
