{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Ep 5 - Talking Openly About Pay! by Tech Team Weekly" ],
    "summary" : [ "This week, our main story is the debate over whether companies (and employees) should be happy to disclose salaries, in an attempt to drive pay equality, a chat made somewhat harder by Neil's repeated inability to pronounce the word \"equality\". We get deep into discussion about our experiences with knowing (or not knowing) how our colleagues are paid, companies and countries who we've seen get the balance right, and the challenges of introducing salary negotiations in the job-hunting process.\nBut there's more! We'll also be talking about a secret new privacy-shattering setting in Chrome which is enabled by default, and bemoaning the lack of accessibility options in some modern games (and championing others which lead the way). You'll also hear what we've all been up to this week, including a top quality J-Lo story from Sanj, unexpectedly relevant election news from Neil, and Gwen basically doing everything under the sun. Plus there's an awful lot of Diablo II discussion for a podcast which isn't from the year 2000.\nTIMESTAMPS:\n00:00 Start  \n02:02 The Stand-Up  \n14:43 Social Engineering  \n21:46 This Week's Epic  \n44:00 News Bytes  \n52:22 Competition Time  \n53:09 The Wash-Up\nLINKS DISCUSSED THIS WEEK:\nIncident.io\nMinistry of Testing: Test.Bash() 2021\nYouTube: Neil's Continuous Quality with Postman session\nJamie Tanna: Providing a Public Salary History page\nGOV.UK: Equality Act 2010\nBlind social network\nYouTube: Kevin Goldsmith: How does Salary Work? (LeadDev 2019)\nThe Verge: Apple keeps shutting down employee-run survyes on pay equity - and labour lawyers say it's illegal\nThe Register: Google emits Chrome 94 with 'Idle Detection' API to detect user inactivity amid opposition\nIGN: Deathloop's Lack of Accessibility Options Is Disappointing Players\nTweet thread from Courtney Craven (Can I Play That) outlining Deathloop's issues" ],
    "featured" : [ "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode400/17534718/17534718-1632587936389-b1695c229d725.jpg" ],
    "url" : [ "https://anchor.fm/tech-team-weekly/episodes/Ep-5---Talking-Openly-About-Pay-e17slhk" ]
  }
}
