{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Ep 13 - Thriving in The Great Resignation! by Tech Team Weekly" ],
    "summary" : [ "We've spoken in recent episodes about the volatility of the current job market, and how \"The Great Resignation\" is offering great opportunities for those who choose to change companies. But what about those who choose to stay? This week, we talk about the challenges of remaining motivated and thriving when those around you are moving on. \nNext week, we're doing an epic All Stand-Up episode, where we'll be focusing entirely on what's going on in our working lives - and we'd love to hear from you! Drop us a message/DM on Twitter, or leave us a voice message - we'll try to incorporate as many into our episode as possible!\nTIMESTAMPS:\n00:00 Start\n02:33 The Stand-Up\n10:29 Social Engineering\n16:17 This Week's Epic\n33:50 News Bytes\n37:30 The Wash-Up\nLINKS DISCUSSED THIS WEEK: \nMinistry of Testing Cambridge: How Testers Can Shape The Next Normal\nGizmodo: Star Trek: Discovery Is Lost to Most of the World Days Before Its Season 4 Premiere\n9to5Google: You can now pre-order the 2nd-gen Pixel Stand from Google, ships next month\nBBC Sport: English cricket 'institutionally' racist - Rafiq\nFawcett Society: The Fawcett Society announces date of Equal Pay Day 2021\nBBC News: The day Iceland's women went on strike\nThe Guardian: Genshin Impact players say Chinese game censors \"Taiwan\" and \"Hong Kong\" chat\nYouTube: \"Let's Go Brandon\" video\nNew York Post: Peloton accused of banning anti-Biden \"Let’s Go Brandon\" on platform\nEuroNews: Portugal makes it illegal for your boss to text you after work in 'game changer' remote work law\nAmazon: Michael C. Feathers - Working Effectively with Legacy Code\nMartin Fowler: The strangler pattern\nArria careers page (or reach out to Maribel Ayala on LinkedIn)\nThe Guardian: Staying power! How to thrive in the great resignation if you don’t want to quit\nThe Register: Thousands of Firefox users accidentally commit login cookies on GitHub\n9to5Mac: Apple secretly buying ads for their apps, say big developers – and they aren’t happy about it\nArsTechnica: Apple will finally let devs tell users about non-App Store purchase options\nWikipedia: Epic Games v Apple" ],
    "featured" : [ "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode400/17534718/17534718-1637419877004-bb1260c188eed.jpg" ],
    "url" : [ "https://anchor.fm/tech-team-weekly/episodes/Ep-13---Thriving-in-The-Great-Resignation-e1aimpu" ]
  }
}
