{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Ep 6 - Buy Now, Pay Later! by Tech Team Weekly" ],
    "summary" : [ "Faced with a tight deadline, the team finally manage to deliver an episode of about the desired length! This week, Gwen, Neil and Sanj are looking at the explosion of new digital players in the 'Buy Now Pay Later' market, looking at the ethics of building features which can generate profit from the vulnerable, and asking whether employers are doing enough to encourage discussions about prudent financial behaviour. There's also discussion about loot boxes and other forms of gambling, during which Gwen gets mad at a fake casino.\nThere's still enough time for all three hosts to pick scarily similar stories in News Bytes - if you're interested in overpaying for novelty tech, this week is the episode for you (apart from Sanj's story, which could get you arrested if you're a careless Australian).\nTIMESTAMPS:\n00:00 Start  \n00:56 The Stand-Up  \n06:10 Social Engineering  \n09:54 This Week's Epic  \n25:13 News Bytes  \n34:12 The Wash Up\nLINKS MENTIONED THIS WEEK:\nYouTube: #LeadDev - Marco Rogers - Creating a career ladder for engineers\nYouTube: Postman - The Busy Developer's Guide to Testing (21st October livestream)\nCNBC: British fintechs are jumping into the booming buy now, pay later market\nMastercard: Mastercard reinvents installments to give consumers more payment choices wherever they shop\nMoney Saving Expert: First-ever financial education textbook lands in schools\nPolygon: EA calls its loot boxes \"surprise mechanics\", says they’re used ethically \nCitizens Advice Bureau\nStepChange debt charity\nThe Guardian: An0m - the inside story of the most daring surveillance sting in history\nStack Overflow: No joke - you can buy our copy/paste keyboard right now\nDigital Undivided: supporting Black and Latinx women entrepreneurs\nThe Independent: Amazon's new Astro robot is a \"privacy nightmare\"\nTwitter: @DimaKrotov - the stranded Roomba" ],
    "featured" : [ "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_episode400/17534718/17534718-1633088081362-74660ad46b8a3.jpg" ],
    "url" : [ "https://anchor.fm/tech-team-weekly/episodes/Ep-6---Buy-Now--Pay-Later-e185hpn" ]
  }
}
