{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Fri. 05/03 - Facebook Coin Is Coming For Credit Cards by Techmeme Ride Home" ],
    "summary" : [ "This Facebook cryptocurrency is real, people, Microsoft has a blockchain product as well, Verizon is looking to unload Tumblr, Softbank is considering an IPO for the vision fund and, of course, the weekend longreads suggestions.\nSponsors:\n\n PixelUnion.net\n Instacart. Promocode RIDE at checkout.\n\nLinks:\n\n  Facebook Building Cryptocurrency-Based Payments System (WSJ)\n  Project Libra: Facebook to launch stablecoin-based payments network (The Block)\n  Report: Facebook looking to disrupt credit cards with cryptocurrency (ArsTechnica)\n  Microsoft adds more AI, mixed-reality, IoT services to its Azure line-up (ZDNet)\n  Microsoft launches a fully managed blockchain service (TechCrunch)\n  Verizon Looks to Unload Tumblr Blogging Site (WSJ)\n  SoftBank Considers IPO for $100 Billion Vision Fund (WSJ)\n  Sonic’s live-action design upset the entire internet, so the studio is changing it (The Verge)\n\nThe Weekend Longreads Suggestions:\n\n  The making of Amazon Prime, the internet’s most successful and devastating membership program (ReCode)\n  The search for the kryptonite that can stop CRISPR (MIT Technology Review)\n  The Most Valuable Company (for Now) Is Having a Nadellaissance (Bloomberg Businessweek)\n  Software, the Tough Tomato Principle, and the Great Weirdening of the World (Florent Crivello)\n  The productivity pit: how Slack is ruining work (ReCode)\n  Exclusive: The Saga Of 'Star Citizen,' A Video Game That Raised $300 Million—But May Never Be Ready To Play (Forbes)\n\nSupport the show! Lose the ads! Subscribe to the premium feed RIGHT HERE in your podcast app with 3 taps!" ],
    "featured" : [ "https://d3t3ozftmdmh3i.cloudfront.net/staging/podcast_uploaded_nologo400/455429/455429-1545064226947-ca7112fdadb1.jpg" ],
    "url" : [ "https://anchor.fm/techmeme-ride-home/episodes/Fri--0503---Facebook-Coin-Is-Coming-For-Credit-Cards-e3u3a9" ]
  }
}
