{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Why I Retired My Webmention Server" ],
    "category" : [ "webdesign", "webmentions", "indieweb" ],
    "url" : [ "https://brainbaking.com/post/2023/05/why-i-retired-my-webmention-server/" ],
    "uid" : [ "https://brainbaking.com/post/2023/05/why-i-retired-my-webmention-server/" ],
    "published" : [ "2023-05-08" ],
    "content" : [ {
      "html" : "<p>After two years of building and running my own fully featured Webmention server, I think it’s time to shut it down. I’ve been thinking about doing so for a few months, and <a href=\"https://tenforward.social/@eli_oat/110284832577889707\">Eli’s comment</a> has finally pushed me to take a closer look whether or not it’s worth it:</p>\n<blockquote>\n<p>I think I’m ready to wholly remove all indieweb functionality from my website. The only Webmentions I receive at this point are spam from a Russian poker website that likes to link to 1 random blogpost of mine that has nothing to do with gambling, or gaming.</p>\n</blockquote>\n<p>Before I get to the <em>why</em>, I want to take a moment to congratulate the IndieWeb community on their efforts to bring back a personal World Wide Web, a place where people come first and own their domains, a place where things are happily shared instead of stolen, a place where cool things inspire others to tinker. I’ve been a fan of the concept ever since I stumbled upon it, although the implementation of their ideas isn’t always ideal (see <a href=\"https://brainbaking.com/post/2021/03/the-indieweb-mixed-bag/\">the IndieWeb mixed bag</a>). My <a href=\"https://brainbaking.com/post/2021/05/beyond-webmention-io/\">own Webmention implementation</a> is freely available and fully implements the protocol, verified by unit tests, so knock yourself out if you decide to ignore the premise of this post.</p>\n<h2 id=\"why-webmentions-can-be-a-drag\">Why Webmentions can be a drag</h2>\n<p>Maintaining <em>anything</em> can be a drag, honestly. But let’s focus on a generic self-hosted Webmention server instead.</p>\n<h3 id=\"1-spam\">1. Spam</h3>\n<p>As Eli mentioned, and quite self-explanatory. I spent days coding in guard clauses—see <a href=\"https://brainbaking.com/post/2022/04/fighting-webmention-and-pingback-spam/\">fighting Webmention and Pingback spam</a>—but in the end, that doesn’t fix the underlying issue: not everyone on the internetz behaves the way they should, and in the end, whether you like it or not, you’re still either deleting spam in your inbox or spending time sifting through domain (dis)allow lists. It’s a never-ending story. My disallow list was larger than my allow list. AI-generated Wordpress sites pop up everywhere, “mentioning” your stuff to get a piece of your clicks.</p>\n<p>I’d rather spend my Sunday doing something else.</p>\n<h3 id=\"2-maintenance\">2. Maintenance</h3>\n<p>This includes database maintenance—compression, upgrades, yaddayadda—and server maintenance—<code>sudo systemctl restart gojamming</code> yaddayadda.</p>\n<p>I’d rather spend my Sunday doing something else.</p>\n<h3 id=\"3-very-few-mentions-are-worth-mentioning\">3. Very few mentions are worth mentioning</h3>\n<p>That’s right; about <code>75%</code> of the mentions I do receive are completely useless “like” messages. Microformats supports multiple “types” of mentions, whether it’s a comment on your article, an RSVP, or just a very social media-like “like” with an empty body. I had to write a few lines of code to filter out that stuff. If you don’t believe me, visit a random Webmention-enabled site and scroll down to the “comments” until you see a lot of Twitter-infested avatars or hearts without any text.</p>\n<h3 id=\"4-microformats-is-far-from-perfect\">4. Microformats is far from perfect</h3>\n<p>A Webmention parses HTML to scan for the author, aforementioned mention type, and contents. The problem is that some people send mentions as type “like” with an empty body, and some as type “mention” with body text “like”. Then your parser fails to detect a <code>h-author</code> or someone placed one of those bogus classes on the wrong <code>&lt;div/&gt;</code>. Every little design mistake someone makes on their site results in a fucked up mention. You did take all those stupid cases into account while building your server, did you?</p>\n<h3 id=\"5-most-mentions-come-from-bridgy\">5. Most mentions come from Bridgy</h3>\n<p><a href=\"https://brid.gy/\">Bridgy</a> is a free service that allows you to connect social media accounts to your Webmention server (probably using another hosted service, <a href=\"https://webmention.io/\">Webmention.io</a>), meaning for instance tweets of people mentioning or replying to your link via Twitter suddenly appear as a mention on your site.  Great stuff, right? Except those people have no idea their avatar and text is being yanked. I’ve questioned these practices before and it’s clear that they’re built without thinking too hard about privacy.</p>\n<p>As a result, I had to anonymize everything coming from Bridgy myself. Yet another unnecessary <code>if {}</code> clause, yay. By the way, using a hosted Webmention server kind of defeats the purpose of the whole IndieWeb “own your data” mantra!</p>\n<h3 id=\"6-very-few-mentions-are-received-at-all\">6. Very few mentions are received at all</h3>\n<p>In the past month, I think I received exactly two mentions: both originating from <code>jefklakscodex.com</code>, my other blog. Me, myself, and I! I did/do receive the occasional mention, but I’m acquainted with most of these authors and we also exchange pleasantries using email, a protocol I deem much more appropriate for the occasional digital message or two.</p>\n<p>I’ve been on the fence several times, and the <code>/notes</code> section was solely there to provide a mention starting point for other sites, but I’d rather just send out emails: contrary to the Webmentioned notes, they usually net interesting conversations.</p>\n<h3 id=\"7-my-own-server-is-far-from-perfect\">7. My own server is far from perfect</h3>\n<p>When <a href=\"https://brainbaking.com/post/2023/01/i-published-a-blogpost-and-then-deleted-it/\">I published a blogpost and then deleted it</a> in January, I accidentally triggered mentions to be resent for <em>every single post</em> on Brain Baking due to how my server uses the RSS feed and timestamps to determine which article to process. Whoops. Even though that’s fixed now, I’m sure the server is still a potential danger to both others (sorry about the spam!) and my own server (please don’t hack me).</p>\n<h3 id=\"8-it-complicates-my-website\">8. It complicates my website</h3>\n<p>As mentioned, before you can enable Webmentions, you need to be “<a href=\"https://indieweb.org/Getting_Started\">IndieWeb-complaint</a>” by sprinkling CSS pseudotags to label content and help Microformat parsers correctly identify your data. If your HTML structure isn’t up to snuff it could require reshuffling things back and forth, as a <code>p-author</code> tag should be within a <code>h-entry</code>. After hours of cursing I just ended up pasting <code>h-entry</code> on the root <code>&lt;html/&gt;</code> element. For now, I’ll leave the tags as is.</p>\n<p>I eventually threw out <a href=\"https://brainbaking.com/post/2021/04/using-hugo-to-launch-a-gemini-capsule/\">Gemini compatibility</a> precisely because of that: yet another thing that needlessly complicates matters.</p>\n<hr>\n<p>To have comments or not to have comments—that’s the question. I’ve seen similar a evolution on other blogs. As for me, I’d rather spend my Sunday doing something else. Wait, I already said that, didn’t I? I’m at a point in life where I need to optimize my time spent with anything, and again, If I have to choose between spending time coding in yet another edge case or just writing and replying to a lovely email from a reader, I’d prefer the latter, even though I highly enjoyed building the Go server, and when things start itching again, I’ll probably build another IndieWeb tool in the future. And no, that problem isn’t fixed by outsourcing your mentions, it just triggers other more questionable problems.</p>\n<p>If you’d like to comment and/or reach out, I’d be happy to receive, read, and respond to your email. The “reply via email” button is still there in the RSS feed. Cheers!</p>\n<p><em>(No mentions were sent during the publishing of this post)</em></p>\n\n\n\t\t    \n  \t\t\t<p xmlns:xlink=\"http://www.w3.org/1999/xlink\">\n\t\t       <svg class=\"icon icon-text\" width=\"24\" height=\"24\">\n\t\t            <title>tags icon</title>\n\t\t            <use xmlns:xlink=\"http://www.w3.org/1999/xlink\" xlink:href=\"#tag\"></use>\n\t\t        </svg>\n\t\t\t    <span class=\"list-tags\">\n\t\t\t        \n\t\t\t            <a href=\"https://brainbaking.com/tags/webmentions\" title=\"Tag: webmentions\"><kbd class=\"item-tag p-category\">webmentions</kbd></a>\n\t\t\t        \n\t\t\t            <a href=\"https://brainbaking.com/tags/indieweb\" title=\"Tag: indieweb\"><kbd class=\"item-tag p-category\">indieweb</kbd></a>\n\t\t\t        \n\t\t\t    </span>\n\t\t\t</p>",
      "value" : "After two years of building and running my own fully featured Webmention server, I think it’s time to shut it down. I’ve been thinking about doing so for a few months, and Eli’s comment has finally pushed me to take a closer look whether or not it’s worth it:\nI think I’m ready to wholly remove all indieweb functionality from my website. The only Webmentions I receive at this point are spam from a Russian poker website that likes to link to 1 random blogpost of mine that has nothing to do with gambling, or gaming.\nBefore I get to the why, I want to take a moment to congratulate the IndieWeb community on their efforts to bring back a personal World Wide Web, a place where people come first and own their domains, a place where things are happily shared instead of stolen, a place where cool things inspire others to tinker. I’ve been a fan of the concept ever since I stumbled upon it, although the implementation of their ideas isn’t always ideal (see the IndieWeb mixed bag). My own Webmention implementation is freely available and fully implements the protocol, verified by unit tests, so knock yourself out if you decide to ignore the premise of this post. Why Webmentions can be a drag\nMaintaining anything can be a drag, honestly. But let’s focus on a generic self-hosted Webmention server instead. 1. Spam\nAs Eli mentioned, and quite self-explanatory. I spent days coding in guard clauses—see fighting Webmention and Pingback spam—but in the end, that doesn’t fix the underlying issue: not everyone on the internetz behaves the way they should, and in the end, whether you like it or not, you’re still either deleting spam in your inbox or spending time sifting through domain (dis)allow lists. It’s a never-ending story. My disallow list was larger than my allow list. AI-generated Wordpress sites pop up everywhere, “mentioning” your stuff to get a piece of your clicks.\nI’d rather spend my Sunday doing something else. 2. Maintenance\nThis includes database maintenance—compression, upgrades, yaddayadda—and server maintenance—sudo systemctl restart gojamming yaddayadda.\nI’d rather spend my Sunday doing something else. 3. Very few mentions are worth mentioning\nThat’s right; about 75% of the mentions I do receive are completely useless “like” messages. Microformats supports multiple “types” of mentions, whether it’s a comment on your article, an RSVP, or just a very social media-like “like” with an empty body. I had to write a few lines of code to filter out that stuff. If you don’t believe me, visit a random Webmention-enabled site and scroll down to the “comments” until you see a lot of Twitter-infested avatars or hearts without any text. 4. Microformats is far from perfect\nA Webmention parses HTML to scan for the author, aforementioned mention type, and contents. The problem is that some people send mentions as type “like” with an empty body, and some as type “mention” with body text “like”. Then your parser fails to detect a h-author or someone placed one of those bogus classes on the wrong <div/>. Every little design mistake someone makes on their site results in a fucked up mention. You did take all those stupid cases into account while building your server, did you? 5. Most mentions come from Bridgy\nBridgy is a free service that allows you to connect social media accounts to your Webmention server (probably using another hosted service, Webmention.io), meaning for instance tweets of people mentioning or replying to your link via Twitter suddenly appear as a mention on your site. Great stuff, right? Except those people have no idea their avatar and text is being yanked. I’ve questioned these practices before and it’s clear that they’re built without thinking too hard about privacy.\nAs a result, I had to anonymize everything coming from Bridgy myself. Yet another unnecessary if {} clause, yay. By the way, using a hosted Webmention server kind of defeats the purpose of the whole IndieWeb “own your data” mantra! 6. Very few mentions are received at all\nIn the past month, I think I received exactly two mentions: both originating from jefklakscodex.com, my other blog. Me, myself, and I! I did/do receive the occasional mention, but I’m acquainted with most of these authors and we also exchange pleasantries using email, a protocol I deem much more appropriate for the occasional digital message or two.\nI’ve been on the fence several times, and the /notes section was solely there to provide a mention starting point for other sites, but I’d rather just send out emails: contrary to the Webmentioned notes, they usually net interesting conversations. 7. My own server is far from perfect\nWhen I published a blogpost and then deleted it in January, I accidentally triggered mentions to be resent for every single post on Brain Baking due to how my server uses the RSS feed and timestamps to determine which article to process. Whoops. Even though that’s fixed now, I’m sure the server is still a potential danger to both others (sorry about the spam!) and my own server (please don’t hack me). 8. It complicates my website\nAs mentioned, before you can enable Webmentions, you need to be “IndieWeb-complaint” by sprinkling CSS pseudotags to label content and help Microformat parsers correctly identify your data. If your HTML structure isn’t up to snuff it could require reshuffling things back and forth, as a p-author tag should be within a h-entry. After hours of cursing I just ended up pasting h-entry on the root <html/> element. For now, I’ll leave the tags as is.\nI eventually threw out Gemini compatibility precisely because of that: yet another thing that needlessly complicates matters.\nTo have comments or not to have comments—that’s the question. I’ve seen similar a evolution on other blogs. As for me, I’d rather spend my Sunday doing something else. Wait, I already said that, didn’t I? I’m at a point in life where I need to optimize my time spent with anything, and again, If I have to choose between spending time coding in yet another edge case or just writing and replying to a lovely email from a reader, I’d prefer the latter, even though I highly enjoyed building the Go server, and when things start itching again, I’ll probably build another IndieWeb tool in the future. And no, that problem isn’t fixed by outsourcing your mentions, it just triggers other more questionable problems.\nIf you’d like to comment and/or reach out, I’d be happy to receive, read, and respond to your email. The “reply via email” button is still there in the RSS feed. Cheers!\n(No mentions were sent during the publishing of this post)\ntags icon webmentions indieweb",
      "lang" : "en-us"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "note" : [ "I'm Wouter Groeneveld, a Brain Baker, and I love the smell of freshly baked thoughts (and bread) in the morning. I sometimes convince others to bake their brain (and bread) too." ],
        "name" : [ "Wouter Groeneveld" ],
        "url" : [ "https://brainbaking.com/" ],
        "photo" : [ {
          "value" : "https://brainbaking.com/img/avatar.jpg",
          "alt" : "A photo of Me!"
        } ]
      },
      "lang" : "en-us",
      "value" : "Wouter Groeneveld"
    } ]
  },
  "lang" : "en-us"
}
