{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "So... How Much Do You Earn?" ],
    "category" : [ "braindump" ],
    "url" : [ "https://brainbaking.com/post/2022/08/how-much-do-you-earn/" ],
    "uid" : [ "https://brainbaking.com/post/2022/08/how-much-do-you-earn/" ],
    "published" : [ "2022-08-22" ],
    "content" : [ {
      "html" : "<p>We humans tend not to share everything. Among the best kept&#x2014;and probably most lied on&#x2014;secrets is our salary, yet we still have the irresistible urge to brag and to compare. I was all the more surprised to stumble upon blogger and software engineer <a href=\"https://www.jvt.me/salary/\">Jamie Tanna&#x2019;s public salary history</a> page that lists yearly salary amounts together with the companies he worked for and optional bonuses.</p>\n<p>Jamie lives in the UK and worked for companies in London and Nottingham. It&#x2019;s important to take this into consideration when looking at a table like that because getting paid <code>&#xA3;70k</code> sounds like an awful lot for just five years of experience&#x2014;and it probably is&#x2014;compared to average software engineering wages here in Belgium. Jamie&#x2019;s reason for putting this in the open is, as he explains on his blog:</p>\n<blockquote>\n<p>[&#x2026;] you sometimes also need to understand what others are being paid, so you can understand more appropriately how much more you need to ask for.</p>\n</blockquote>\n<p>We do have a &#x201C;salary compass&#x201D; for this, <a href=\"https://www.jobat.be/nl/salariskompas/\">like the one from JobAt</a>, that spits out an average gross monthly salary depending on your statute, educational attainments, years of work experiences, function level (whatever that means), and function category (e.g. &#x201C;ICT&#x201D;, &#x201C;Medical&#x201D;, &#x201C;Research&#x201D;, &#x2026;). These numbers are based on data from advertisements and used to be semi-accurate, but now seem to be woefully undershoot salary results. Again, this data isn&#x2019;t based on <em>real salary</em> information, but merely on what ads expect. In a way, what Jamie is trying to do is much more accurate. Given people don&#x2019;t lie. Which they do.</p>\n<p>Ex-Google engineer Jeff Kaufman is also <a href=\"https://www.jefftk.com/p/spending-update-2022\">surprisingly open about his earnings and spendings</a> on his personal blog. Jeff does this to be transparent about <a href=\"https://www.jefftk.com/donations\">yearly donations</a> and talks about an &#x201C;earning to give&#x201D; concept. When he worked for Google, he earned <code>$782k</code> yearly (<em>Yoink!</em>) and donated no less than <code>51%</code> of it. These Silicon Valley-steeped numbers are mind boggling to me (for instance, monthly daycare spendings are <code>$5.5k</code>), but it&#x2019;s admirable to read that Jeff gave up his well-paid Google job to go work for an ethical company that hopefully helps saving our environment. On <a href=\"https://www.givingwhatwecan.org/\">givingwhatwecan.org</a>, you can read up on how to maximize your charitable impact.</p>\n<p>While Jamie&#x2019;s purpose was for others to better understand how much they need to ask for, I think that can only be true if you&#x2019;re living and working in (1) the same sector, obviously, and (2) the same physical area. Jamie&#x2019;s last job is remote, he now works for Deliveroo, which comes with even more staggering numbers. I wonder whether or not those are effectively comparable, and how they&#x2019;re being taxed depending on where you live.</p>\n<p>As for myself, since I work for a university, my wage is non-negotiable and I see that as a blessing. No more whining about company cars (&#x201C;but my colleague has an <code>y</code> and I only have an <code>x</code>, can I at least get those extras?\") because we get none. No more whining about raises (&#x201C;but my colleague didn&#x2019;t work as well as I did lately, why don&#x2019;t I get this?\"). On the other hand, the hierarchical layers are still very much there. Wages for academic staff <a href=\"https://admin.kuleuven.be/personeel/wedde/wedde_AP.html\">are put online by KU Leuven</a>, if you know which salary matrix (&#x201C;Barema&#x201D;) to pull up, you can simply see how much I earn and I will earn in x years.</p>\n<p>When I do manage to get that PhD (hopefully within a year from now) and still find myself working for KU Leuven, I move to another matrix, and suddenly earn <code>&#x20AC;1000</code> more each month, (mostly) without changing job contents. To me, that&#x2019;s also kind of baffling. In industry, nobody cares about your degree, as long as you can show you&#x2019;ve got the required skills. In academia, if you have another piece of paper, you get paid more. Whether or not you&#x2019;re competent doesn&#x2019;t matter. One could argue that getting the PhD means you&#x2019;ve proven you&#x2019;re competent, but I&#x2019;m not so sure.</p>\n<p>In governmental and academic positions, the only way to get a serious raise is to move from matrix to matrix. On the other hand, minor raises are pretty much a given: there&#x2019;s no &#x201C;OKP&#x201D;, there&#x2019;s no monthly or yearly meeting with your manager, and chances of getting fired are <em>very</em> slim. If you do decide to go for another matrix, there&#x2019;s a huge defense and complicated set of paperwork steps involved, which will take months.</p>\n<p>When people ask me how much I earn, I&#x2019;m still reluctant to answer. I now earn a much higher number compared to working in industry as a software engineer, but that&#x2019;s a gross number that has the disadvantage of much higher taxes. People also forget that at least in Belgium, working in IT comes with a free company car with unlimited fuel, meal vouchers, and other various cost reductions. When I made the switch to academia, I earned about <code>&#x20AC;400</code> more, but in the end, my net salary was about <code>&#x20AC;20</code> less. The car we had to buy ourselves costs about <code>&#x20AC;380</code> monthly all-in.</p>\n<p>In the end, I think that simply comparing numbers is futile, but it&#x2019;s still very interesting to see what others are earning and doing with their money.</p>",
      "value" : "We humans tend not to share everything. Among the best kept—and probably most lied on—secrets is our salary, yet we still have the irresistible urge to brag and to compare. I was all the more surprised to stumble upon blogger and software engineer Jamie Tanna’s public salary history page that lists yearly salary amounts together with the companies he worked for and optional bonuses.\nJamie lives in the UK and worked for companies in London and Nottingham. It’s important to take this into consideration when looking at a table like that because getting paid £70k sounds like an awful lot for just five years of experience—and it probably is—compared to average software engineering wages here in Belgium. Jamie’s reason for putting this in the open is, as he explains on his blog:\n[…] you sometimes also need to understand what others are being paid, so you can understand more appropriately how much more you need to ask for.\nWe do have a “salary compass” for this, like the one from JobAt, that spits out an average gross monthly salary depending on your statute, educational attainments, years of work experiences, function level (whatever that means), and function category (e.g. “ICT”, “Medical”, “Research”, …). These numbers are based on data from advertisements and used to be semi-accurate, but now seem to be woefully undershoot salary results. Again, this data isn’t based on real salary information, but merely on what ads expect. In a way, what Jamie is trying to do is much more accurate. Given people don’t lie. Which they do.\nEx-Google engineer Jeff Kaufman is also surprisingly open about his earnings and spendings on his personal blog. Jeff does this to be transparent about yearly donations and talks about an “earning to give” concept. When he worked for Google, he earned $782k yearly (Yoink!) and donated no less than 51% of it. These Silicon Valley-steeped numbers are mind boggling to me (for instance, monthly daycare spendings are $5.5k), but it’s admirable to read that Jeff gave up his well-paid Google job to go work for an ethical company that hopefully helps saving our environment. On givingwhatwecan.org, you can read up on how to maximize your charitable impact.\nWhile Jamie’s purpose was for others to better understand how much they need to ask for, I think that can only be true if you’re living and working in (1) the same sector, obviously, and (2) the same physical area. Jamie’s last job is remote, he now works for Deliveroo, which comes with even more staggering numbers. I wonder whether or not those are effectively comparable, and how they’re being taxed depending on where you live.\nAs for myself, since I work for a university, my wage is non-negotiable and I see that as a blessing. No more whining about company cars (“but my colleague has an y and I only have an x, can I at least get those extras?\") because we get none. No more whining about raises (“but my colleague didn’t work as well as I did lately, why don’t I get this?\"). On the other hand, the hierarchical layers are still very much there. Wages for academic staff are put online by KU Leuven, if you know which salary matrix (“Barema”) to pull up, you can simply see how much I earn and I will earn in x years.\nWhen I do manage to get that PhD (hopefully within a year from now) and still find myself working for KU Leuven, I move to another matrix, and suddenly earn €1000 more each month, (mostly) without changing job contents. To me, that’s also kind of baffling. In industry, nobody cares about your degree, as long as you can show you’ve got the required skills. In academia, if you have another piece of paper, you get paid more. Whether or not you’re competent doesn’t matter. One could argue that getting the PhD means you’ve proven you’re competent, but I’m not so sure.\nIn governmental and academic positions, the only way to get a serious raise is to move from matrix to matrix. On the other hand, minor raises are pretty much a given: there’s no “OKP”, there’s no monthly or yearly meeting with your manager, and chances of getting fired are very slim. If you do decide to go for another matrix, there’s a huge defense and complicated set of paperwork steps involved, which will take months.\nWhen people ask me how much I earn, I’m still reluctant to answer. I now earn a much higher number compared to working in industry as a software engineer, but that’s a gross number that has the disadvantage of much higher taxes. People also forget that at least in Belgium, working in IT comes with a free company car with unlimited fuel, meal vouchers, and other various cost reductions. When I made the switch to academia, I earned about €400 more, but in the end, my net salary was about €20 less. The car we had to buy ourselves costs about €380 monthly all-in.\nIn the end, I think that simply comparing numbers is futile, but it’s still very interesting to see what others are earning and doing with their money.",
      "lang" : "en-us"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "note" : [ "I'm Wouter Groeneveld, a level 36 Brain Baker, and I love the smell of freshly baked thoughts (and bread) in the morning. I sometimes convince others to bake their brain (and bread) too." ],
        "name" : [ "Wouter Groeneveld" ],
        "url" : [ "https://brainbaking.com/" ],
        "photo" : [ "https://brainbaking.com/img/avatar.jpg" ]
      },
      "lang" : "en-us",
      "value" : "Wouter Groeneveld"
    } ]
  },
  "lang" : "en-us"
}
