{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "Cool Things People Do With Their Blogs" ],
    "category" : [ "webdesign", "blogging" ],
    "url" : [ "https://brainbaking.com/post/2022/04/cool-things-people-do-with-their-blogs/" ],
    "uid" : [ "https://brainbaking.com/post/2022/04/cool-things-people-do-with-their-blogs/" ],
    "published" : [ "2022-04-27" ],
    "content" : [ {
      "html" : "<p>Small and independent blogs are always full of surprises. The more blogs I stumble upon, the more genuinely surprised I am by the things people do with their blogs. It seemed like a good idea to summarize highlights here. I hope it might inspire non-bloggers to blog and bloggers to tinker more with their site&#x2014;because obviously the tinkering never ends!</p>\n<p>I randomly selected blogs for each <em>thing</em>. There are ample other sites that use that particular feature, but I had to start somewhere. Some blogs appear muiltple times, probably making them even funkier! This list is incomplete, I&#x2019;ll try to periodically update it as I encounter more cool stuff. Enjoy!</p>\n<h3 id=\"content-related\">Content related</h3>\n<ul>\n<li>Publish reviews of books/music/&#x2026; in a cool sortable grid: <a href=\"https://chrisburnell.com/music/\">Chris Burnell&#x2019;s Music</a></li>\n<li>Hack together your own <code>last.fm</code> to scrobble music to your own site: <a href=\"https://jan.boddez.net/articles/owning-my-scrobbles\">Jan Boddez' Owning My Scrobbles</a></li>\n<li>Sync your laptop battery, local weather, and current location with your site: <a href=\"https://aaronparecki.com/\">Aaron Parecki&#x2019;s homepage</a></li>\n<li>Publicly display global website statistics: <a href=\"https://www.lkhrs.com/stats/\">Luke Harris' stats page</a></li>\n<li>More stats: game playtime, AWStats server data: <a href=\"https://roytang.net/page/stats/awstats/\">Roy Tang&#x2019;s stats</a></li>\n<li>Create and regularly update a &#x201C;uses&#x201D; page: <a href=\"https://rusingh.com/uses/\">Ru Singh' uses page</a></li>\n<li>Create and regularly update a &#x201C;now&#x201D; page: <a href=\"https://sive.rs/nowff\">Derek Sivers' the /now page movement</a></li>\n<li>Auto-import game metadata from How Long To Beat and others: <a href=\"https://jefklakscodex.com/games/\">Jefklak&#x2019;s Codex games page</a></li>\n<li>Use your own site to publish checkins instead of Foursquare: <a href=\"https://hacdias.com/checkins\">Henrique Dias' checkins</a></li>\n<li>Regularly publish week reviews or link bundles: <a href=\"https://www.stefanimhoff.de/links/bundle-15/\">Stefan Imhoff&#x2019;s Link Bundle #15</a></li>\n<li>Have an &#x201C;on this day&#x201D; page that displays posts from previous years: <a href=\"https://diggingthedigital.com/onthisday/\">Frank Meeuwsen&#x2019;s on this day archive</a></li>\n<li>Group multiple posts into series: <a href=\"https://fasterthanli.me/series\">Amos' long-form series</a></li>\n<li>Group multiple posts into research questions: <a href=\"https://www.quartey.com/questions\">Emmanuel Quartey&#x2019;s questions section</a></li>\n<li>Syndicate the HTTP blog to a Gemini capsule: <a href=\"https://brainbaking.com/post/2021/04/using-hugo-to-launch-a-gemini-capsule/\">Brain Baking Gemini</a> (defunct)</li>\n</ul>\n<h3 id=\"design-related\">Design related</h3>\n<ul>\n<li>Create an official coat of arms as the logo of your site: <a href=\"https://satyrs.eu/heraldry/\">Marijn Florence&#x2019;s heraldry adventure</a></li>\n<li>Design your site around ever-evolving note-taking systems: <a href=\"https://notes.andymatuschak.org/Evergreen_notes\">Andy Matuschak&#x2019;s Evergreen Notes</a></li>\n<li>An audible frequency graph that determines posting activity: <a href=\"https://chrisburnell.com/archive/\">Chris Burnells' All posts archive</a></li>\n<li>Write a custom static blog engine from scratch, because we can: <a href=\"https://jlelse.blog/\">Jan-Lukas Else&#x2019;s blog</a></li>\n<li>Implement a simple client-site search using lunr.js: <a href=\"https://brainbaking.com/archives/\">Brain Baking archives</a></li>\n<li>Show articles from others blogs you read below your own articles: <a href=\"https://drewdevault.com/2022/04/15/Status-update-April-2022.html\">an article from Drew DeVault</a></li>\n<li>Use a public inbox as a commenting system: <a href=\"https://drewdevault.com/2022/04/15/Status-update-April-2022.html\">an article from Drew DeVault</a></li>\n<li>Implement reaction buttons for each post: <a href=\"https://jlelse.blog/posts/goblog-reactions\">Jan-Lukas Else&#x2019;s thoughts on reactions</a></li>\n</ul>\n<h3 id=\"indieweb-related\">IndieWeb related</h3>\n<ul>\n<li>Have a guestbook page where people can send Webmentions to to sign it: <a href=\"https://ohhelloana.blog/guestbook/\">Ana Rodrigues' guestbook</a></li>\n<li>Collaborative pixel-art that gets saved every five minutes: <a href=\"https://aaronparecki.com/2018/01/21/11/pixel-art\">Aaron Parecki&#x2019;s IndieWebCamp Pixel Art</a></li>\n<li>Publish replies to others' sites using Webmentions: <a href=\"https://jamesg.blog/replies/\">James' Coffee Blog, Replies</a></li>\n<li>Post Tweets on your own site first, then syndicate to Twitter: <a href=\"https://seblog.nl/\">Sebastiaan Andeweg&#x2019;s tweets</a></li>\n<li>Summarize all IndieWeb-based RSVP events in a calendar: <a href=\"https://www.jvt.me/rsvps/\">Jamie Tanna&#x2019;s RSVPs</a></li>\n<li>Work together on MicroPub/Sub as a new social reading protocol: <a href=\"https://doubleloop.net/\">Neal Mather&#x2019;s blog</a></li>\n<li>Join the IndieWeb ring to promote own and others' sites: <a href=\"https://zerokspot.com/\">Horst Gutmann&#x2019;s blog</a></li>\n<li>Buuild a custom Webmention receiver/sender: <a href=\"https://indieweb.org/Webmention#IndieWeb_Examples\">IndieWeb examples</a></li>\n</ul>\n<h3 id=\"rss-related\">RSS related</h3>\n<ul>\n<li>Provide multiple RSS feeds for notes, articles, etc: <a href=\"https://www.zylstra.org/blog/feeds/\">Ton Zijlstra&#x2019;s feeds</a></li>\n<li>Automatic publishing of favorites from an RSS reader: <a href=\"https://ruk.ca/favourites\">Peter Rukavina&#x2019;s favorites</a></li>\n<li>Styled OPML Blogrolls that can be imported into your reader: <a href=\"https://rubenerd.com/omake.opml\">Ruben Schade&#x2019;s Omake OPML</a></li>\n<li>Styled RSS feeds to better explain what a web feed is: <a href=\"http://interconnected.org/home/feed\">Matt Webb&#x2019;s RSS feed</a></li>\n<li>A &#x201C;Reply via email&#x201D; link in each RSS post to encourage interaction: <a href=\"view-source:https://obsolete29.com/feed/feed.xml\">Mike Harley&#x2019;s RSS feed</a></li>\n<li>Secret RSS-only posts that do not appear on the webiste: <a href=\"https://www.zylstra.org/blog/feed/\">Ton Z&#x133;lstra&#x2019;s RSS feed</a></li>\n<li>Send out newsletters based on your RSS feed: <a href=\"https://kevq.uk/im-newslettering-again/\">Kev Quirk is newslettering again</a> (defunct)</li>\n<li>Add the location from where you write to your RSS feed: <a href=\"https://rubenerd.com/feed\">Ruben Schade&#x2019;s RSS feed</a></li>\n</ul>",
      "value" : "Small and independent blogs are always full of surprises. The more blogs I stumble upon, the more genuinely surprised I am by the things people do with their blogs. It seemed like a good idea to summarize highlights here. I hope it might inspire non-bloggers to blog and bloggers to tinker more with their site—because obviously the tinkering never ends!\nI randomly selected blogs for each thing. There are ample other sites that use that particular feature, but I had to start somewhere. Some blogs appear muiltple times, probably making them even funkier! This list is incomplete, I’ll try to periodically update it as I encounter more cool stuff. Enjoy! Content related Publish reviews of books/music/… in a cool sortable grid: Chris Burnell’s Music Hack together your own last.fm to scrobble music to your own site: Jan Boddez' Owning My Scrobbles Sync your laptop battery, local weather, and current location with your site: Aaron Parecki’s homepage Publicly display global website statistics: Luke Harris' stats page More stats: game playtime, AWStats server data: Roy Tang’s stats Create and regularly update a “uses” page: Ru Singh' uses page Create and regularly update a “now” page: Derek Sivers' the /now page movement Auto-import game metadata from How Long To Beat and others: Jefklak’s Codex games page Use your own site to publish checkins instead of Foursquare: Henrique Dias' checkins Regularly publish week reviews or link bundles: Stefan Imhoff’s Link Bundle #15 Have an “on this day” page that displays posts from previous years: Frank Meeuwsen’s on this day archive Group multiple posts into series: Amos' long-form series Group multiple posts into research questions: Emmanuel Quartey’s questions section Syndicate the HTTP blog to a Gemini capsule: Brain Baking Gemini (defunct) Design related Create an official coat of arms as the logo of your site: Marijn Florence’s heraldry adventure Design your site around ever-evolving note-taking systems: Andy Matuschak’s Evergreen Notes An audible frequency graph that determines posting activity: Chris Burnells' All posts archive Write a custom static blog engine from scratch, because we can: Jan-Lukas Else’s blog Implement a simple client-site search using lunr.js: Brain Baking archives Show articles from others blogs you read below your own articles: an article from Drew DeVault Use a public inbox as a commenting system: an article from Drew DeVault Implement reaction buttons for each post: Jan-Lukas Else’s thoughts on reactions IndieWeb related Have a guestbook page where people can send Webmentions to to sign it: Ana Rodrigues' guestbook Collaborative pixel-art that gets saved every five minutes: Aaron Parecki’s IndieWebCamp Pixel Art Publish replies to others' sites using Webmentions: James' Coffee Blog, Replies Post Tweets on your own site first, then syndicate to Twitter: Sebastiaan Andeweg’s tweets Summarize all IndieWeb-based RSVP events in a calendar: Jamie Tanna’s RSVPs Work together on MicroPub/Sub as a new social reading protocol: Neal Mather’s blog Join the IndieWeb ring to promote own and others' sites: Horst Gutmann’s blog Buuild a custom Webmention receiver/sender: IndieWeb examples RSS related Provide multiple RSS feeds for notes, articles, etc: Ton Zijlstra’s feeds Automatic publishing of favorites from an RSS reader: Peter Rukavina’s favorites Styled OPML Blogrolls that can be imported into your reader: Ruben Schade’s Omake OPML Styled RSS feeds to better explain what a web feed is: Matt Webb’s RSS feed A “Reply via email” link in each RSS post to encourage interaction: Mike Harley’s RSS feed Secret RSS-only posts that do not appear on the webiste: Ton Zĳlstra’s RSS feed Send out newsletters based on your RSS feed: Kev Quirk is newslettering again (defunct) Add the location from where you write to your RSS feed: Ruben Schade’s RSS feed",
      "lang" : "en-us"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "note" : [ "I'm Wouter Groeneveld, a level 36 Brain Baker, and I love the smell of freshly baked thoughts (and bread) in the morning. I sometimes convince others to bake their brain (and bread) too." ],
        "name" : [ "Wouter Groeneveld" ],
        "url" : [ "https://brainbaking.com/" ],
        "photo" : [ "https://brainbaking.com/img/avatar.jpg" ]
      },
      "lang" : "en-us",
      "value" : "Wouter Groeneveld"
    } ]
  },
  "lang" : "en-us"
}
