{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "What I learnt about leadership via watching Track Cycling" ],
    "category" : [ "notes" ],
    "url" : [ "https://jwong.co.uk/2022/04/what-i-learnt-about-leadership-via-watching-track-cycling/" ],
    "published" : [ "2022-04-06T09:17:01+00:00" ],
    "updated" : [ "2022-04-06T09:37:52+00:00" ],
    "content" : [ {
      "html" : "<p>The 2022 F1 season has started and if you don&#x2019;t follow it there are two things you need to know.</p>\n\n\n\n<ol><li>New rules came into effect this season.</li><li>Hamilton is not in the winning car.</li></ol>\n\n\n\n<p>I find F1 interesting from a technical and engineering perspective. The way the drivers gain speed, and the way they use drag to keep the car from flying off the ground. It reminds me a lot of track cycling.</p>\n\n\n\n<p>In track cycling a lot of the races involve the cyclists working as a team ( even when they are not a team) to be in a chance of winning the race. A good example of this is the Points Race or the Team sprint.</p>\n\n\n\n<p>What&#x2019;s interesting to me is how if the lead cyclist rides too far ahead of everyone else, they could drop the rest of the group, and lose the support they need to get to the finishing line.&#xA0; If they cycle at a pace others can keep up with, they can form a group that can support each other and take it in turns to lead the pack.</p>\n\n\n\n<p>It reminds me of some habits I often catch myself doing. Pushing ahead too much, and leaving people behind because I was too laser focused or I was too eager to move ahead. I leave people behind.</p>\n\n\n\n<p>I&#x2019;ve also been the person who have felt left behind. Seeing peers understand concepts and follow the conversation and partake in a conversation that just fly over my own head. It&#x2019;s not a great feeling.</p>\n\n\n\n<p>Then you watch a team sprint. </p>\n\n\n\n<p>I&#x2019;m in awe how they ride with a centimetre between each bike. The trust they must have to cycle so closely together and know they won&#x2019;t take each other out. They do this so that the lead cyclist reduces drag for the rest of the team. Over time the starting cyclist will fall to the back and support the team from behind. This happens over and over again.</p>\n\n\n\n<p>It isn&#x2019;t about the starting cyclist being the best. Nor is it about the last cyclist being the youngest or worse. Each person is there for different reasons and are lined up with a particular reason in mind.</p>\n\n\n\n<p>What I&#x2019;m trying to say is that we don&#x2019;t all need to be the starting cyclist. But when it&#x2019;s our turn to lead the pack, that we raise up to the challenge knowing our team is right behind us, supporting us.</p>\n\n\n\n<hr class=\"wp-block-separator\">\n\n\n\n<p>For more info about Track Cycling I recommend this video: <a rel=\"noreferrer noopener\" href=\"https://www.youtube.com/watch?v=uv9QsSb-m98\" target=\"_blank\">https://www.youtube.com/watch?v=uv9QsSb-m98</a></p>\n\n\n\n<p>This is another good video team sprinting. The link&#xA0; is set to start at 1:50 because it explains some of the key needs of doing a team sprint.&#xA0;<a rel=\"noreferrer noopener\" href=\"https://youtu.be/Nt-uxNgaZwg?t=109\" target=\"_blank\">https://youtu.be/Nt-uxNgaZwg?t=109</a></p>\n\n\n\n<p>Photo by <a href=\"https://unsplash.com/@dylan_nolte?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">dylan nolte</a> on <a href=\"https://unsplash.com/s/photos/track-cycling?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a></p>",
      "value" : "The 2022 F1 season has started and if you don’t follow it there are two things you need to know. New rules came into effect this season.Hamilton is not in the winning car.\nI find F1 interesting from a technical and engineering perspective. The way the drivers gain speed, and the way they use drag to keep the car from flying off the ground. It reminds me a lot of track cycling.\nIn track cycling a lot of the races involve the cyclists working as a team ( even when they are not a team) to be in a chance of winning the race. A good example of this is the Points Race or the Team sprint.\nWhat’s interesting to me is how if the lead cyclist rides too far ahead of everyone else, they could drop the rest of the group, and lose the support they need to get to the finishing line.  If they cycle at a pace others can keep up with, they can form a group that can support each other and take it in turns to lead the pack.\nIt reminds me of some habits I often catch myself doing. Pushing ahead too much, and leaving people behind because I was too laser focused or I was too eager to move ahead. I leave people behind.\nI’ve also been the person who have felt left behind. Seeing peers understand concepts and follow the conversation and partake in a conversation that just fly over my own head. It’s not a great feeling.\nThen you watch a team sprint.\nI’m in awe how they ride with a centimetre between each bike. The trust they must have to cycle so closely together and know they won’t take each other out. They do this so that the lead cyclist reduces drag for the rest of the team. Over time the starting cyclist will fall to the back and support the team from behind. This happens over and over again.\nIt isn’t about the starting cyclist being the best. Nor is it about the last cyclist being the youngest or worse. Each person is there for different reasons and are lined up with a particular reason in mind.\nWhat I’m trying to say is that we don’t all need to be the starting cyclist. But when it’s our turn to lead the pack, that we raise up to the challenge knowing our team is right behind us, supporting us.\nFor more info about Track Cycling I recommend this video: https://www.youtube.com/watch?v=uv9QsSb-m98\nThis is another good video team sprinting. The link  is set to start at 1:50 because it explains some of the key needs of doing a team sprint. https://youtu.be/Nt-uxNgaZwg?t=109\nPhoto by dylan nolte on Unsplash",
      "lang" : "en-GB"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "jwong" ],
        "url" : [ "https://jwong.co.uk/author/jwong/" ]
      },
      "lang" : "en-GB",
      "value" : "jwong"
    } ]
  },
  "lang" : "en-GB"
}
