{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "I've reached a local maxima in my career" ],
    "category" : [ "career", "nablopomo", "work", "worklife" ],
    "url" : [ "https://shkspr.mobi/blog/2022/11/ive-reached-a-local-maxima-in-my-career/" ],
    "published" : [ "2022-11-01" ],
    "updated" : [ "2022-11-01" ],
    "content" : [ {
      "html" : "<a class=\"hidden\" href=\"https://shkspr.mobi/blog/wp-content/uploads/2018/07/edent-at-number-10-small.jpeg\" itemprop=\"https://schema.org/image\"></a><p><small>(Welcome to #NaBloPoMo - <a href=\"https://wordpress.com/blog/2013/11/01/nablopomo-november-2013/\">National Blog Posting Month</a>. I'm publishing a new blog post every day in November.)</small></p><p>My employer encourages employees to have \"career conversations\" with their line manager. And I <em>hate</em> it.  I don't resent them for making me participate, and it's probably good for me to engage in a little introspection. But that doesn't mean I can't whine like a petulant toddler.</p><p>Since my dreams of being the first astronaut to win an Oscar® crumbled to dust, I haven't known what I want out of my professional life.  I am a complete career magpie, going \"Oooh! Shiny!\" and hopping jobs to the next fun thing.</p><p>For the last five years, I've been at the same grade at work. I haven't been doing the same <em>job</em> - I've transferred teams and departments multiple times.  I've also - to my surprise - received a few pay-rises.  I'm far too British to discuss my actual salary - but it is good. Not quite as good as if I were working in the private sector - but I get a decent pension, generous holidays, and reasonable job security.</p><p>I'm now at the point where I face several challenges to moving up to the next grade.</p><p>My pay - G7 DDaT Technology Specialist Architect Accomplished B - now exceeds the standard pay for the next grade up and, in some cases, the grade after that. Which means either taking a pay cut, or trying to find a department which has the budget to go beyond the standard pay scales. Last year I turned down a job at a higher grade because they were reluctant to even <em>match</em> what I was currently on.  The same pay for more responsibility? Yeah, nah.  Which brings me on to the next issue…</p><p>My management ambitions - I have none. I've been a team leader and line manager and I didn't enjoy either experience. And, crucially, I don't think I was particularly good at it. People deserve managers who are interested in people and their development. That's not me - and I have no desire to either fake it, or learn to do it better. <em>All</em> of the jobs I've seen at the next grade up <em>require</em> people management.</p><p>My workload - I like having a life. I work my hours and finish on time. I occasionally have an out-of-hours call, but that's rare. I've done jobs where I flew all over the world at short notice. It's fun for a while, but not something I'm looking for any more. My job is sometimes stressful, but work are good at making sure I'm looking after myself. And it's tempered by knowing what I'm working on <em>matters</em>. Which leads on to…</p><p>My impact - maybe I'm naïve, but I believe in the transformative power of the state's technological offering. Would I get that satisfaction from helping make shareholders a little richer? Or fiddling around with a niche product? I only have a limited time on Earth and I've like to work on something that I consider important. I know that I could go work at a hedge-fund and donate my outsized salary to charity - but I want to help practically.</p><p>My risk tolerance - a little while ago I held discussions with a cool start-up to be their CTO. It didn't work out for a variety of reasons. But one of the big ones was my attitude to risk. Do I want to gamble that the thing I work on will get acquired by Zuck? Even if I lucked out, would it materially change my life? I try to stay off the hedonic treadmill. But I already own all the houses, toys, and private jets that I want.  The upside of a massive risk doesn't seem particularly attractive to me right now.</p><p>In short, I've reached a local maxima. The only journey from here appears to be downwards. Either a cut in salary or in quality of life. If I make it through that valley, the upside is… what exactly? It feels like that <a href=\"https://bemorewithless.com/the-story-of-the-mexican-fisherman/\">old joke</a> about the MBA who tells a casual fisherman to spend his life building an empire just so that he can spend his retirement fishing on the lake.</p><h2 id=\"now-what\"><a href=\"https://shkspr.mobi/blog/2022/11/ive-reached-a-local-maxima-in-my-career/#now-what\" class=\"heading-link\">Now What?</a></h2><p>I have some longer term plans which hopefully kick in around the year 2030. But the gap between now and then seems a mystery. Here's my rough idea of what's going to happen next.</p><p>By the new year, I should have finished my <a href=\"https://shkspr.mobi/blog/tag/MSc\">MSc</a>.  That will help me determine if I want to do a <a href=\"https://www.uel.ac.uk/postgraduate/courses/prof-doc-information-security\">Professional Doctorate</a> or similar at some point in the future.</p><p>I'll have completed a full year in my new job. That will be enough time to know if I want to continue doing it for a bit longer, or whether I'll start casting my eye around.</p><p>And then… I don't know. I guess my choices are:</p><ol><li>Stay where I am.</li><li>Find another Civil Service job - either more interesting or better paid but with a similar work/life balance.</li><li>Take a risk and go work for myself (doing what?!) or for someone else (who?!)</li><li>Start a new course of study and, maybe, convince work to fund it.</li></ol><p>And, you know what? I'm happy with not planning. Sure, I might see the <em>perfect</em> job which I'm not qualified for. In which case, I'll look at how I get qualified.</p><p>The world isn't short on opportunities.</p>",
      "value" : "(Welcome to #NaBloPoMo - National Blog Posting Month. I'm publishing a new blog post every day in November.)\nMy employer encourages employees to have \"career conversations\" with their line manager. And I hate it. I don't resent them for making me participate, and it's probably good for me to engage in a little introspection. But that doesn't mean I can't whine like a petulant toddler.\nSince my dreams of being the first astronaut to win an Oscar® crumbled to dust, I haven't known what I want out of my professional life. I am a complete career magpie, going \"Oooh! Shiny!\" and hopping jobs to the next fun thing.\nFor the last five years, I've been at the same grade at work. I haven't been doing the same job - I've transferred teams and departments multiple times. I've also - to my surprise - received a few pay-rises. I'm far too British to discuss my actual salary - but it is good. Not quite as good as if I were working in the private sector - but I get a decent pension, generous holidays, and reasonable job security.\nI'm now at the point where I face several challenges to moving up to the next grade.\nMy pay - G7 DDaT Technology Specialist Architect Accomplished B - now exceeds the standard pay for the next grade up and, in some cases, the grade after that. Which means either taking a pay cut, or trying to find a department which has the budget to go beyond the standard pay scales. Last year I turned down a job at a higher grade because they were reluctant to even match what I was currently on. The same pay for more responsibility? Yeah, nah. Which brings me on to the next issue…\nMy management ambitions - I have none. I've been a team leader and line manager and I didn't enjoy either experience. And, crucially, I don't think I was particularly good at it. People deserve managers who are interested in people and their development. That's not me - and I have no desire to either fake it, or learn to do it better. All of the jobs I've seen at the next grade up require people management.\nMy workload - I like having a life. I work my hours and finish on time. I occasionally have an out-of-hours call, but that's rare. I've done jobs where I flew all over the world at short notice. It's fun for a while, but not something I'm looking for any more. My job is sometimes stressful, but work are good at making sure I'm looking after myself. And it's tempered by knowing what I'm working on matters. Which leads on to…\nMy impact - maybe I'm naïve, but I believe in the transformative power of the state's technological offering. Would I get that satisfaction from helping make shareholders a little richer? Or fiddling around with a niche product? I only have a limited time on Earth and I've like to work on something that I consider important. I know that I could go work at a hedge-fund and donate my outsized salary to charity - but I want to help practically.\nMy risk tolerance - a little while ago I held discussions with a cool start-up to be their CTO. It didn't work out for a variety of reasons. But one of the big ones was my attitude to risk. Do I want to gamble that the thing I work on will get acquired by Zuck? Even if I lucked out, would it materially change my life? I try to stay off the hedonic treadmill. But I already own all the houses, toys, and private jets that I want. The upside of a massive risk doesn't seem particularly attractive to me right now.\nIn short, I've reached a local maxima. The only journey from here appears to be downwards. Either a cut in salary or in quality of life. If I make it through that valley, the upside is… what exactly? It feels like that old joke about the MBA who tells a casual fisherman to spend his life building an empire just so that he can spend his retirement fishing on the lake.Now What?\nI have some longer term plans which hopefully kick in around the year 2030. But the gap between now and then seems a mystery. Here's my rough idea of what's going to happen next.\nBy the new year, I should have finished my MSc. That will help me determine if I want to do a Professional Doctorate or similar at some point in the future.\nI'll have completed a full year in my new job. That will be enough time to know if I want to continue doing it for a bit longer, or whether I'll start casting my eye around.\nAnd then… I don't know. I guess my choices are:Stay where I am.Find another Civil Service job - either more interesting or better paid but with a similar work/life balance.Take a risk and go work for myself (doing what?!) or for someone else (who?!)Start a new course of study and, maybe, convince work to fund it.\nAnd, you know what? I'm happy with not planning. Sure, I might see the perfect job which I'm not qualified for. In which case, I'll look at how I get qualified.\nThe world isn't short on opportunities.",
      "lang" : "en-GB"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "@edent" ],
        "photo" : [ {
          "value" : "https://shkspr.mobi/apple-touch-icon.png",
          "alt" : ""
        } ],
        "url" : [ "https://edent.tel/" ]
      },
      "lang" : "en-GB",
      "value" : "@edent"
    } ]
  },
  "lang" : "en-GB"
}
