{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "My experience at Modern Frontends Live" ],
    "category" : [ "category: thoughts" ],
    "url" : [ "https://hidde.blog/modern-frontends-live/My experience at Modern Frontends Live" ],
    "published" : [ "2022-11-19" ],
    "content" : [ {
      "html" : "<div class=\"entry-content-post\">\n      <p>This isn't a post I wanted to write, but alas, sometimes not staying silent matters. This week I spoke at <a href=\"https://modernfrontends.live/\">Modern Frontends Live</a> in London. I was disappointed to see the organiser lied and misrepresented what they offered, as it impacted attendees, speakers and sponsors that were involved (financially and mentally).</p>\n<p>I didn't want to name names either, but my judgment after interacting with her and a  number of people I trust, I fear <strong>Gen Ashley</strong>, the organiser, might try it again, potentially under a different event name and/or try to hide what happened. To inform other attendees, sponsors and speakers, I want to be sure to share my experience.</p>\n<p>Below I'll list the misrepresentations that I found specifically problematic. Other writeups are available from <a href=\"https://dev.to/thisisjofrank/my-experience-of-modern-frontends-conference-1cgg\">Jo Franchetti</a> and <a href=\"https://www.cassie.codes/posts/modern-frontends/\">Cassie Evans</a>, I wholeheartedly agree with what they have written already.</p>\n<p>First, some context (that shaped my thoughts on conferencing). I have been involved with Fronteers Conference for 5 years (until 2013), anything from sitting at registration and holding mics to curation, team chairing and organiser handbook author (writing down what <a href=\"https://quirksmode.org/\">PPK</a> and <a href=\"https://krijnhoetmer.nl/\">Krijn</a> largely shaped). I was also involved with CSS Day and Performance Now to help out with practical stuff like registration. I've also given over 50 talks. Long story short, I do notice stuff at events sometimes.</p>\n<p>Second, not everything about the event was bad. I'm grateful the organisers put me in a decent hotel, served a tasty speaker's dinner and were friendly and treated me mostly with respect (but, for completeness, also broke promises to me, and treated others badly). I actually had a good time meeting friends, some for the first time. As a lot of my work is virtual, it was great to have lots of interesting conversations and relating to developers (my job is in developer relations), and to finally meet some of the Open UI and other W3C groups in person.</p>\n<h2>Wildly exaggerated attendee numbers</h2>\n<p>The conference website showed (and therefore <em>promised</em>) '3000+' attendees. There were a few hundred, to my best estimation. I asked Gen and the people manning the registration desk various times what the number of actual attendees was. She tried to dodge this question, said there were about 1000 tickets of which a number was free tickets, but she didn't know how many were attending as not everyone showed up.</p>\n<p><img src=\"https://hidde.blog/_images/mfl-site.png\" alt=\"screenshot of modernfrontends.live, displaying 100+ speakers announced, 2 workshop days, 2 conference days, 100+ speakers, 3000+ developers\"> <em>Screenshot of the homepage taken on 19 November 2022, the day after the conference</em></p>\n<p>Conference registration systems show numbers and these badges are sent to a printing company. Health and safety people and catering need to know these numbers too. It seems nearly impossible to not know how many badges or you have.</p>\n<p>Either way, a few hundred is not a little bit less than 3000, it is 5-10% of what was promised.</p>\n<p>It's okay if ticket sales don't go as expected. It's not okay to stay silent about it and have everyone only find out on the event day. A few hundred is a small-ish event, 3000 is a huge event. Sponsors count on numbers to make their spend worthwhile, attendees count on numbers to estimate with how many people they could network. As a speaker, I need correct numbers to decide too, as there are a lot of events and me and my employer (if it's for work) are mindful about where we go. I don't mind speaking to 10 or 1000 people, but the number is one of the things I use to decide, especially when considerable travel time is involved.</p>\n<h2>Payment taken for a non-existent livestream</h2>\n<p>Livestream tickets were sold, but there were not cameras. These tickets (£42) were still on sale during the event, while there were no cameras. It was framed as ‘technical issues’. I've seen a lot of  livestream-related technical issues, but they usually involve at least the presence of cameras.</p>\n<p>I found out while attending a session and accidentally scrolling my Twitter timeline, as one does. People had paid for a stream, got no information regarding how to access it. Friends wondered if there were even cameras. I looked around in the room, noticed none. Asked the technician, confirmed there were none in that room. I felt a little sick, assuming there must be a misunderstanding, left the room (sorry speaker) and went to check all other rooms. No cameras.</p>\n<p>Then I confronted Gen. She laughed at the idea that people had assumed cameras were needed for a livestream. Why did we assume such a thing, she wondered, and said they had planned to livestream with Streamyard. Maybe a possibility in theory, but it was halfway the first day and it hadn't happened yet, nor did I as a speaker receive instructions around setting that up (and anyone I checked with had not either).</p>\n<p>It's ok if the livestream you planned fails or even if the camera team you hired all got covid on the day. It's not okay to not communicate about that, or promise videos, as this tweet suggests they did:</p>\n<blockquote>\n<p>Just got an email. “Due to technical issues, we will not be streaming live, unless it gets fixed soon.”</p>\n<p>If not resolved, We will share recordings at a later date”</p>\n</blockquote>\n<p>Posted by <a href=\"https://twitter.com/ukF1dev/status/1593169409333694465\">@ukF1dev on November 17 2022</a></p>\n<p>To my knowledge, after a lot of pressure the organiser have promised the people who bought a ticket a refund and a free ticket to “next year's event”.</p>\n<h2>Broken travel arrangement promises</h2>\n<p>Some speakers were not paid for travel, others were promised. Some paid thousands from their own pockets. I can personally say two hotel nights were covered for me by the conference. Travel reimbursement was promised to be paid before the event, after many reminders I am still waiting for that.</p>\n<p>I firmly believe an event should pay speakers' travel expenses as a minimum.  Getting there and staying there should be paid from the conference budget, because speakers are an essential part of the event. They attract attendees and spend a lot of time to prepare, speak and attend. Exceptions could include events that are free to attend or that are (actually, like, really) community driven. I love those events and am usually happy to make time for them. Exceptions should not include events that charge attendees in the hundreds and sponsors in the thousands.</p>\n<p>Somewhat controversially and socialistically, I feel this should apply equally between speakers, and also apply to speakers who work for very rich employers. This helps avoid power imbalance in a couple of ways. I know some organisers take speakers whose employer pays the travel and it helps with the budget, and I get that, events can be very costly.</p>\n<p>It's okay if you don't want to pay any of the speaker's travel expenses, but do it fairly. It's also okay if you get so much email that you miss one of a speaker's three reminders, but communication is important. In my case they kept sending me emails and DMs to ask me to boost their event, but meanwhile ignored my requests to pay what they promised to pay.</p>\n<h2>Venue represented wrongly</h2>\n<p>Under a “The venue” heading, the website showed an enormous wall to wall screen and a very large audience. This isn't what the venue looked like. I understand a marketing website wants to persuade, but the gap between what this photo shows and the actual main room is too large. Was I naive to assume this reflected reality? I don't know, the screens at View Source (2019) in Amsterdam or JSConfEU (2019) in Berlin were a bit like the one shown on this photo. It's quite large for a developer conference, but it happens.</p>\n<p><img src=\"https://hidde.blog/_images/mfl-venue.jpg\" alt=\"heading “the venue”, picture of enormous wall to wall screen with very large audience\"> <em>Another screenshot of the homepage taken on 19 November 2022, the day after the conference</em></p>\n<p>In <a href=\"https://dev.to/thisisjofrank/my-experience-of-modern-frontends-conference-1cgg\">her post</a>, Jo Franchetti describes the venue in more detail.</p>\n<h2>Conclusion</h2>\n<p>Organising events is hard, lonely and stressful. I have a lot of respect for conference organisers, I have done it myself (not without many mistakes, believe me) and have friends who do still do it. So, by default, I cut organisers a lot of slack and have a lot of understanding for the many ways it could go wrong in. I believe in good intentions, generally anyway. I am also grateful for the things the conference did do right, thanks for that.</p>\n<p>There were red flags from the start (from the accessibility and front-end of the website to the lack of communication), but those did not stop me from going. The issues that emerged during the event did make me regret somewhat, but all I could do then is still try to enjoy it and deliver interesting content for the attendees that paid to come.</p>\n<p>The specific issues I've put in this post cross the line between honest mistakes and bad behaviour. They cross the line, because they consistute fraud (the livestream) and because they impact attendees, sponsors and speakers. The front-end community doesn't deserve this, and I'm worried for people new to the industry, who get may assume this is normal or ok. It's not normal. In the last year I've spoken at a number of events that had a very high bar to make it great for attendees, sponsors and speakers (shoutout to Beyond Tellerrand, JSConf Budapest and State of the Browser).</p>\n<p>In any case, if you were at the event, I encourage you to speak up, too.</p>\n\n      <div class=\"entry-content-credits\">\n        \n      </div>\n    </div>",
      "value" : "This isn't a post I wanted to write, but alas, sometimes not staying silent matters. This week I spoke at Modern Frontends Live in London. I was disappointed to see the organiser lied and misrepresented what they offered, as it impacted attendees, speakers and sponsors that were involved (financially and mentally).\nI didn't want to name names either, but my judgment after interacting with her and a number of people I trust, I fear Gen Ashley, the organiser, might try it again, potentially under a different event name and/or try to hide what happened. To inform other attendees, sponsors and speakers, I want to be sure to share my experience.\nBelow I'll list the misrepresentations that I found specifically problematic. Other writeups are available from Jo Franchetti and Cassie Evans, I wholeheartedly agree with what they have written already.\nFirst, some context (that shaped my thoughts on conferencing). I have been involved with Fronteers Conference for 5 years (until 2013), anything from sitting at registration and holding mics to curation, team chairing and organiser handbook author (writing down what PPK and Krijn largely shaped). I was also involved with CSS Day and Performance Now to help out with practical stuff like registration. I've also given over 50 talks. Long story short, I do notice stuff at events sometimes.\nSecond, not everything about the event was bad. I'm grateful the organisers put me in a decent hotel, served a tasty speaker's dinner and were friendly and treated me mostly with respect (but, for completeness, also broke promises to me, and treated others badly). I actually had a good time meeting friends, some for the first time. As a lot of my work is virtual, it was great to have lots of interesting conversations and relating to developers (my job is in developer relations), and to finally meet some of the Open UI and other W3C groups in person. Wildly exaggerated attendee numbers\nThe conference website showed (and therefore promised) '3000+' attendees. There were a few hundred, to my best estimation. I asked Gen and the people manning the registration desk various times what the number of actual attendees was. She tried to dodge this question, said there were about 1000 tickets of which a number was free tickets, but she didn't know how many were attending as not everyone showed up.\nscreenshot of modernfrontends.live, displaying 100+ speakers announced, 2 workshop days, 2 conference days, 100+ speakers, 3000+ developers Screenshot of the homepage taken on 19 November 2022, the day after the conference\nConference registration systems show numbers and these badges are sent to a printing company. Health and safety people and catering need to know these numbers too. It seems nearly impossible to not know how many badges or you have.\nEither way, a few hundred is not a little bit less than 3000, it is 5-10% of what was promised.\nIt's okay if ticket sales don't go as expected. It's not okay to stay silent about it and have everyone only find out on the event day. A few hundred is a small-ish event, 3000 is a huge event. Sponsors count on numbers to make their spend worthwhile, attendees count on numbers to estimate with how many people they could network. As a speaker, I need correct numbers to decide too, as there are a lot of events and me and my employer (if it's for work) are mindful about where we go. I don't mind speaking to 10 or 1000 people, but the number is one of the things I use to decide, especially when considerable travel time is involved. Payment taken for a non-existent livestream\nLivestream tickets were sold, but there were not cameras. These tickets (£42) were still on sale during the event, while there were no cameras. It was framed as ‘technical issues’. I've seen a lot of livestream-related technical issues, but they usually involve at least the presence of cameras.\nI found out while attending a session and accidentally scrolling my Twitter timeline, as one does. People had paid for a stream, got no information regarding how to access it. Friends wondered if there were even cameras. I looked around in the room, noticed none. Asked the technician, confirmed there were none in that room. I felt a little sick, assuming there must be a misunderstanding, left the room (sorry speaker) and went to check all other rooms. No cameras.\nThen I confronted Gen. She laughed at the idea that people had assumed cameras were needed for a livestream. Why did we assume such a thing, she wondered, and said they had planned to livestream with Streamyard. Maybe a possibility in theory, but it was halfway the first day and it hadn't happened yet, nor did I as a speaker receive instructions around setting that up (and anyone I checked with had not either).\nIt's ok if the livestream you planned fails or even if the camera team you hired all got covid on the day. It's not okay to not communicate about that, or promise videos, as this tweet suggests they did:\nJust got an email. “Due to technical issues, we will not be streaming live, unless it gets fixed soon.”\nIf not resolved, We will share recordings at a later date”\nPosted by @ukF1dev on November 17 2022\nTo my knowledge, after a lot of pressure the organiser have promised the people who bought a ticket a refund and a free ticket to “next year's event”. Broken travel arrangement promises\nSome speakers were not paid for travel, others were promised. Some paid thousands from their own pockets. I can personally say two hotel nights were covered for me by the conference. Travel reimbursement was promised to be paid before the event, after many reminders I am still waiting for that.\nI firmly believe an event should pay speakers' travel expenses as a minimum. Getting there and staying there should be paid from the conference budget, because speakers are an essential part of the event. They attract attendees and spend a lot of time to prepare, speak and attend. Exceptions could include events that are free to attend or that are (actually, like, really) community driven. I love those events and am usually happy to make time for them. Exceptions should not include events that charge attendees in the hundreds and sponsors in the thousands.\nSomewhat controversially and socialistically, I feel this should apply equally between speakers, and also apply to speakers who work for very rich employers. This helps avoid power imbalance in a couple of ways. I know some organisers take speakers whose employer pays the travel and it helps with the budget, and I get that, events can be very costly.\nIt's okay if you don't want to pay any of the speaker's travel expenses, but do it fairly. It's also okay if you get so much email that you miss one of a speaker's three reminders, but communication is important. In my case they kept sending me emails and DMs to ask me to boost their event, but meanwhile ignored my requests to pay what they promised to pay. Venue represented wrongly\nUnder a “The venue” heading, the website showed an enormous wall to wall screen and a very large audience. This isn't what the venue looked like. I understand a marketing website wants to persuade, but the gap between what this photo shows and the actual main room is too large. Was I naive to assume this reflected reality? I don't know, the screens at View Source (2019) in Amsterdam or JSConfEU (2019) in Berlin were a bit like the one shown on this photo. It's quite large for a developer conference, but it happens.\nheading “the venue”, picture of enormous wall to wall screen with very large audience Another screenshot of the homepage taken on 19 November 2022, the day after the conference\nIn her post, Jo Franchetti describes the venue in more detail. Conclusion\nOrganising events is hard, lonely and stressful. I have a lot of respect for conference organisers, I have done it myself (not without many mistakes, believe me) and have friends who do still do it. So, by default, I cut organisers a lot of slack and have a lot of understanding for the many ways it could go wrong in. I believe in good intentions, generally anyway. I am also grateful for the things the conference did do right, thanks for that.\nThere were red flags from the start (from the accessibility and front-end of the website to the lack of communication), but those did not stop me from going. The issues that emerged during the event did make me regret somewhat, but all I could do then is still try to enjoy it and deliver interesting content for the attendees that paid to come.\nThe specific issues I've put in this post cross the line between honest mistakes and bad behaviour. They cross the line, because they consistute fraud (the livestream) and because they impact attendees, sponsors and speakers. The front-end community doesn't deserve this, and I'm worried for people new to the industry, who get may assume this is normal or ok. It's not normal. In the last year I've spoken at a number of events that had a very high bar to make it great for attendees, sponsors and speakers (shoutout to Beyond Tellerrand, JSConf Budapest and State of the Browser).\nIn any case, if you were at the event, I encourage you to speak up, too.",
      "lang" : "en"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Hidde de Vries (@hdv@front-end.social or @hdv on Twitter) is a web enthusiast, accessibility specialist and conference speaker. He works in Sanity.io's developer relations team from Rotterdam (Netherlands). Previously, he worked for W3C (WAI), Mozilla, the Dutch government and others as a freelancer.\nBuy me a coffee Follow @hdv on Twitter" ]
      },
      "lang" : "en",
      "value" : "Hidde de Vries (@hdv@front-end.social or @hdv on Twitter) is a web enthusiast, accessibility specialist and conference speaker. He works in Sanity.io's developer relations team from Rotterdam (Netherlands). Previously, he worked for W3C (WAI), Mozilla, the Dutch government and others as a freelancer.\nBuy me a coffee Follow @hdv on Twitter"
    } ]
  },
  "lang" : "en"
}
