{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "It's Just Jenn 🏳️‍⚧️ (@itsjustjenn@beige.party)" ],
    "summary" : [ "Today is a heavy and Momentous day for me. As some of you who knew me before, 1 year ago today my best friend since childhood died. From diagnosis to dead in 3 months. He was just shy of his 46th birthday. Again, fuck cancer. \n\nHe was the best man (and literally my best man in the before times) I've ever known. He made me want to be a better person. \n\nAnd so I've tried to become a better person to honor him, to become the best Jennifer I could possibly be. \n\nThis month has been Momentous. Starting month 6 of HRT, going out as myself for only the second time with my dear sister Valerie. And with her getting my ears pierced, using the women's restroom and being correctly Gendered for the very first time. It's since happened a couple times and I'll never get tired of it. \n\nAnd Friday I came out to my in-laws, and I was shocked to find out they were loving and supportive about it. \n\nToday I'm sending a version of the text I sent them go my two sister-in-law. I'm boarding a plane soon and will probably hit send right before take off. Hopefully I land to acceptance. But it doesn't matter, I will essentially be out at that point, and I'm so ready. \n\nSo in the hope it helps somebody else, here is what I wrote them:\n\n\"Hi! There's something we want to tell you guys about. Something beautiful and wonderful, that we just can't hold in anymore.\n\nLast year my best friend Jeremy got sick and died, in the prime of his life. And I realized...life is short and tomorrow isn't guaranteed. And it was time to make an attempt to come alive again. \n\nSo I started taking care of myself. Started dieting, started therapy. Started by ignoring the obvious truth staring me in the face and making a last attempt to be happy with who I was. And as I lost weight and went to therapy and did a lot of soul searching, a lifetime of denial and repression and sadness came flooding back. I started visualizing the end goal, and what I realized is that even after I lose the weight, even after I do the mental work, I'd still be a failure as a man. Because...I'm not a man, I'm a woman, and I always have been. I've fought this my entire life and i just didnt have it in me anymore. Not if I wanted to live. \n\nEvery time I saw a reflection of myself I saw a face that didn't belong to me, and my chest would grow tight until I couldn't breathe, and I'd feel as if I was drowning, but nobody could see me being dragged into the  murky depths. Transition is literally saving my marriage, my family, and my life.\n\nSo that's pretty much it. We're happier than we've ever been and want to share that with our family and the world. We hope you'll welcome me as a sister as you welcolmed me as a brother. When you're ready,  we'd be happy to talk about it. Just let us know. Love you all!\" \n\n#transgender #comingout #nevertooold" ],
    "url" : [ "https://beige.party/@itsjustjenn/111563842430966862" ]
  }
}
