{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "My answers (to your AMA questions)" ],
    "category" : [ "Ask Me Anything" ],
    "url" : [ "https://jlelse.blog/posts/ama-answers" ],
    "published" : [ "2022-06-29T21:36:19+02:00" ],
    "content" : [ {
      "html" : "<p>Recently I made an <a href=\"https://jlelse.blog/thoughts/2022/06/ask-me-anything\">invitation to ask me anything</a>. Only two mails arrived, but I would like to answer them anyway:</p><blockquote><p>What was your inspiration in creating your own blogging engine, as opposed to using one of the many options that still hook into the IndieWeb?</p></blockquote><p>For a long time I used to use ready-made blog solutions. From WordPress to Medium, then Ghost and finally Hugo. At some point I discovered the IndieWeb, for which there were a few ready-made tools here and there, but nothing that lured me away from my Hugo setup. With Hugo, the only real option left was to create my own tools that brought me IndieWeb functionality, especially since I didn&#x2019;t want to include any third-party scripts or services due to privacy concerns, but wanted to keep control. At some point the combination of a static site and dynamic tools became too complex and I combined everything into one dynamic tool, which simplified a lot of things. I was inspired by other members of the IndieWeb community, such as <a href=\"https://aaronparecki.com/\" target=\"_blank\" rel=\"noopener\">Aaron Parecki</a> and <a href=\"https://www.jvt.me/\" target=\"_blank\" rel=\"noopener\">Jamie Tanna</a>.</p><blockquote><p>Do you want to change something in your past and if so what?</p></blockquote><p>I think everyone has a few things in the past that maybe could or should have been done better. But isn&#x2019;t it the mistakes that you learn from? Without having done something wrong in the past, I would know less about what I need to pay more attention to in the future. I am shaped by my past and grateful for what I have learned.</p><blockquote><p>What makes you happy?</p></blockquote><p>A lot of things! When I spend time with my girlfriend; when the people I care about are doing well; when I feel I&#x2019;ve done something good; when I&#x2019;ve programmed something and it works the way I imagined.</p><blockquote><p>What&#x2019;s your next big programming project?</p></blockquote><p>I honestly don&#x2019;t know that at all. At the moment I have hardly any personal ideas about what I could program. But they are mostly quite spontaneous ideas anyway, with which I can plan little. From time to time I fix some small bugs in my blog software. But a big programming project is not in sight, at least not in the hobby area.</p><blockquote><p>Why did you start blogging when you were younger?</p></blockquote><p>On the one hand, I&#x2019;m quite introverted. I&#x2019;m usually more the quiet, reticent type around other people. On the other hand, I somehow have a great need to communicate. But I&#x2019;m mostly interested in rather special topics. In addition, writing allows me to think about things much better than talking to other people. Online I can share my views, topics and discoveries much better and exchange ideas about them. By the way, my blogging started with writing articles about Android, a topic I was very interested in back then.</p><blockquote><p>What is your greatest wish?</p></blockquote><p>I wish and hope that somehow everything will change for the better, that mankind will become more reasonable and stop senseless wars and environmental destruction and save what can be saved.</p><blockquote><p>What are your next goals in terms of life, programming and work?</p></blockquote><p>What a complicated question&#x2026;</p><p>I&#x2019;m starting a new job in the second half of the year. I hope to finish well at my current job and start well at my new job, and that it turns out to be a good decision.</p><p>As for programming, I plan to get back into more current development topics as part of the job and maybe specialize in one direction.</p><p>My next goal in life? In the short term, I&#x2019;m thinking of doing more sports again, developing a better cleaning routine and doing my tax return. And in the medium term, a big goal, which will probably take a while, is to move in with my girlfriend at some point, because long-distance relationships are kind of annoying.</p><blockquote><p>How satisfied are you with the decision to give up your own car and use car sharing?</p></blockquote><p>I am very satisfied! It seems that I have often used the car only for convenience. Most things can be done by foot, bike or public transport without a car (at least for me in a big city). Car sharing is my solution when I really need a car. With the car, I have never kept track of the costs, but they must have been high, although the car was provided to me by my grandmother and she also paid the taxes and insurance. Anyway, I am now glad not to have to pay unexpectedly high bills for new tires or repairs. And the current high fuel costs hardly affect me directly either. I also feel much freer without a car and very rarely miss it. What I definitely don&#x2019;t miss is the annoying search for a parking space. I hope that I can continue to get by without my own car for as long as possible.</p><blockquote><p>Do you want to make a German AMA as well?</p></blockquote><p>Currently, I&#x2019;m not planning anything in that direction. But <a href=\"https://www.deepl.com/translator\" target=\"_blank\" rel=\"noopener\">DeepL</a> might help with the translation (and helped me writing this post).</p>",
      "value" : "Recently I made an invitation to ask me anything. Only two mails arrived, but I would like to answer them anyway:\nWhat was your inspiration in creating your own blogging engine, as opposed to using one of the many options that still hook into the IndieWeb?\nFor a long time I used to use ready-made blog solutions. From WordPress to Medium, then Ghost and finally Hugo. At some point I discovered the IndieWeb, for which there were a few ready-made tools here and there, but nothing that lured me away from my Hugo setup. With Hugo, the only real option left was to create my own tools that brought me IndieWeb functionality, especially since I didn’t want to include any third-party scripts or services due to privacy concerns, but wanted to keep control. At some point the combination of a static site and dynamic tools became too complex and I combined everything into one dynamic tool, which simplified a lot of things. I was inspired by other members of the IndieWeb community, such as Aaron Parecki and Jamie Tanna.\nDo you want to change something in your past and if so what?\nI think everyone has a few things in the past that maybe could or should have been done better. But isn’t it the mistakes that you learn from? Without having done something wrong in the past, I would know less about what I need to pay more attention to in the future. I am shaped by my past and grateful for what I have learned.\nWhat makes you happy?\nA lot of things! When I spend time with my girlfriend; when the people I care about are doing well; when I feel I’ve done something good; when I’ve programmed something and it works the way I imagined.\nWhat’s your next big programming project?\nI honestly don’t know that at all. At the moment I have hardly any personal ideas about what I could program. But they are mostly quite spontaneous ideas anyway, with which I can plan little. From time to time I fix some small bugs in my blog software. But a big programming project is not in sight, at least not in the hobby area.\nWhy did you start blogging when you were younger?\nOn the one hand, I’m quite introverted. I’m usually more the quiet, reticent type around other people. On the other hand, I somehow have a great need to communicate. But I’m mostly interested in rather special topics. In addition, writing allows me to think about things much better than talking to other people. Online I can share my views, topics and discoveries much better and exchange ideas about them. By the way, my blogging started with writing articles about Android, a topic I was very interested in back then.\nWhat is your greatest wish?\nI wish and hope that somehow everything will change for the better, that mankind will become more reasonable and stop senseless wars and environmental destruction and save what can be saved.\nWhat are your next goals in terms of life, programming and work?\nWhat a complicated question…\nI’m starting a new job in the second half of the year. I hope to finish well at my current job and start well at my new job, and that it turns out to be a good decision.\nAs for programming, I plan to get back into more current development topics as part of the job and maybe specialize in one direction.\nMy next goal in life? In the short term, I’m thinking of doing more sports again, developing a better cleaning routine and doing my tax return. And in the medium term, a big goal, which will probably take a while, is to move in with my girlfriend at some point, because long-distance relationships are kind of annoying.\nHow satisfied are you with the decision to give up your own car and use car sharing?\nI am very satisfied! It seems that I have often used the car only for convenience. Most things can be done by foot, bike or public transport without a car (at least for me in a big city). Car sharing is my solution when I really need a car. With the car, I have never kept track of the costs, but they must have been high, although the car was provided to me by my grandmother and she also paid the taxes and insurance. Anyway, I am now glad not to have to pay unexpectedly high bills for new tires or repairs. And the current high fuel costs hardly affect me directly either. I also feel much freer without a car and very rarely miss it. What I definitely don’t miss is the annoying search for a parking space. I hope that I can continue to get by without my own car for as long as possible.\nDo you want to make a German AMA as well?\nCurrently, I’m not planning anything in that direction. But DeepL might help with the translation (and helped me writing this post).",
      "lang" : "en"
    } ],
    "author" : [ {
      "type" : [ "h-card" ],
      "properties" : {
        "name" : [ "Jan-Lukas Else" ],
        "photo" : [ "https://jlelse.dev/profile.png" ],
        "url" : [ "https://jlelse.blog/" ]
      },
      "lang" : "en",
      "value" : "Jan-Lukas Else"
    } ]
  },
  "lang" : "en"
}
