{
  "type" : [ "h-event" ],
  "properties" : {
    "name" : [ "June IndieWeb PopUp Event: Very Sensitive Data on Your Personal Website" ],
    "category" : [ "popup", "indiewebcamp", "monthly", "online" ],
    "url" : [ "https://events.indieweb.org/2021/06/june-indieweb-popup-event-very-sensitive-data-on-your-personal-website-DNjCEi05jHfH" ],
    "start" : [ "2021-06-26T18:00:00Z" ],
    "end" : [ "2021-06-26T20:00:00Z" ],
    "content" : [ {
      "html" : "<p>Since the pause on in-person meetups, we've done online camps, then started the Popup idea...a traditional Indiewebcamp session, done as a standalone event.  These events have been sporadic.</p>\n\n<p>For the next few months, we'll be trialing a monthly popup, usually on the last weekend of the month, unless there is a conflict, with the topic to be announced the month before.</p>\n\n<p>Suppose you have implemented private posts on your website, which only you can view. What are the use cases for, and implications of, posting sensitive data like medical records on your own website?</p>\n\n<p>Possible Topics</p>\n\n<p>storing X-rays, immunization records, and other protected health information (PHI) on your own website   using your website to track, address, or treat conditions like drug addiction or mental health problems, Quantified Self, etc</p>",
      "value" : "Since the pause on in-person meetups, we've done online camps, then started the Popup idea...a traditional Indiewebcamp session, done as a standalone event. These events have been sporadic.\nFor the next few months, we'll be trialing a monthly popup, usually on the last weekend of the month, unless there is a conflict, with the topic to be announced the month before.\nSuppose you have implemented private posts on your website, which only you can view. What are the use cases for, and implications of, posting sensitive data like medical records on your own website?\nPossible Topics\nstoring X-rays, immunization records, and other protected health information (PHI) on your own website using your website to track, address, or treat conditions like drug addiction or mental health problems, Quantified Self, etc",
      "lang" : "en"
    } ]
  },
  "lang" : "en"
}
