{
  "type" : [ "h-entry" ],
  "properties" : {
    "name" : [ "What happens to TLDs when their country stops existing?" ],
    "category" : [ "/projects/qr-tattoo", "history", "internet", "research" ],
    "url" : [ "https://astrid.tech/2022/04/05/1/dead-tlds", "https://aay.tw/e5J71" ],
    "uid" : [ "https://astrid.tech/2022/04/05/1/dead-tlds" ],
    "content" : [ {
      "html" : "<div><p>When I was deciding on what TLD to get for my QR tattoo, one of my first\nthoughts was to just use a subdomain of <code>aay.tw</code>. Makes sense; it&#x2019;s short, and I\ndon&#x2019;t have to pay any extra money.</p>\n<p>However, someone brought up a good point &#x2014; can I trust that <code>.tw</code> will be\naround for the next few decades? After all, <code>.tw</code> is Taiwan&#x2019;s domain, and if you\nknow anything about contemporary geopolitics, there&#x2019;s a lot of variables\ninvolved here. So, I ended up being safe and just picking out a new <code>.org</code>\nbecause those will only go away when ICANN goes away.</p>\n<p>Still, this is an interesting thing to think about. Suppose China ends up\ninvading and successfully annexing Taiwan; what would happen to the\n<a href=\"https://domainnamestat.com/statistics/tld/tw-TLD_ID-1285\">2.7 million registered domains under <code>.tw</code></a>?\nOr, suppose Russia, for some reason, ends up annexing Ukraine (I really think\nthis is nearly impossible, but hey, it&#x2019;s just a thought experiment). What will\nhappen to the\n<a href=\"https://domaintyper.com/domain-names/top-level-domains/ccTLD/ua-domain\">nearly 700 thousand domains under <code>.ua</code></a>?</p>\n<p>In general, if a country stops existing, what happens to its TLD?</p>\n<h2 id=\"historical-precedent\">Historical precedent</h2>\n<p>Note that this section is mostly sourced from Wikipedia articles so take what\nyou will of that.</p>\n<h3 id=\"the-collapse-of-the-soviet-union\">The collapse of the Soviet Union</h3>\n<p>Back in 1989, the Eastern Bloc countries were assigned <code>.su</code> (Soviet Union),\n<code>.pl</code> (Poland), <code>.cs</code> (Czechoslovakia), <code>.yu</code> (Yugoslavia) and <code>.dd</code> (East\nGermany). domain. 15 months later, in 1991, the Soviet Union collapsed, and it\nseems that ICANN had to deal with the fallout of that.<sup id=\"fnref-su\"><a href=\"https://astrid.tech/2022/04/05/1/dead-tlds/#fn-su\" class=\"footnote-ref\">su</a></sup></p>\n<p>This situation is not the same as the one with Taiwan or Ukraine; the Soviet\nUnion did not collapse because it was invaded, but because of internal political\nfailures that are out of scope for this article. It is still an example of a\nstate ceasing to exist, so there might be some historical precedent there.</p>\n<h4 id=\"pl\"><code>.pl</code></h4>\n<p>Although the Polish People&#x2019;s Republic ended, its successor, the Republic of\nPoland, continued existing afterwards. In other words, there was a different\nstate, but it was still the same country. Thus, it inherited <code>.pl</code>.</p>\n<h4 id=\"su\"><code>.su</code></h4>\n<p>The Union of Soviet Sovialist Republics collapsed, and its constituent republics\nbroken off of it (i.e. Ukraine, the Baltic States) got their own domains. ICANN\nintroduced <code>.ru</code> in 1994 to phase out <code>.su</code>, but the Russian government nad\ninternet users wanted to keep it, so ICANN let it happen.</p>\n<p>It seems that ICANN wants to terminate it, IANA states that it&#x2019;s being phased\nout, but Russia still wants to keep it, and there&#x2019;s still 100,000 domains\nregistered with it, so it seems to be in a gray area. Apparently, because of\nthis grayness and lax and outdated terms of use, it&#x2019;s host to lots of cool sites\nsuch as white supremacist site Daily Stormer (to escape deplatforming on\nliterally everywhere else), cybercrime activities, the pro-Putin youth movement\nNashi up until 2019, the Dontesk People&#x2019;s Republic, and more.</p>\n<h4 id=\"dd\"><code>.dd</code></h4>\n<p><code>.dd</code> was only ever used internally by some East German universities, so it was\njust terminated. East and West Germany reunited only a year after <code>.dd</code> was\nintroduced, and West Germany already had <code>.de</code>, so they just used that.</p>\n<h4 id=\"yu\"><code>.yu</code></h4>\n<p>When the Socialist Federal Republic of Yugoslavia dissolved, some of its\nconstituent states broke off and got their own TLDs, like Slovenia and Croatia.\nHowever, Serbia and Montenegro came together to form the Federal Republic of\nYugoslavia, and they kept the <code>.yu</code> domain. But then, they named themselves\nSerbia and Montenegro in 2003, and they finally dissolved in 2006 and each got\ntheir own TLDs. <code>.yu</code> ended up being put on a transition period before being\nterminated in 2010. All of the <code>.yu</code> sites were simply wiped out.</p>\n<h4 id=\"cs\"><code>.cs</code></h4>\n<p>Czechoslovakia was split in 1993, and <code>.cs</code> was deleted in 1995. There were\n2,300 hosts on <code>.cs</code> before its termination.</p>\n<h3 id=\"other-change-of-governments\">Other change of governments</h3>\n<p>In Afghanistan, Libya, and Iraq, they changed their government, but control over\ntheir respective TLDs (<code>.af</code>, <code>.ly</code>, <code>.iq</code>) were always given to the new\ngovernment.</p>\n<p>On an interesting side note, although Iraq&#x2019;s TLD was introduced in 1997, it was\nin limbo for a few years because the delegated manager was imprisoned in Texas\nfor a while, until ICANN redelegated it in 2005.</p>\n<h3 id=\"summary\">Summary</h3>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<table><thead><tr><th>TLD</th><th>Country&#x2019;s fate</th><th>TLD&#x2019;s fate</th></tr></thead><tbody><tr><td><code>.pl</code></td><td>Transfer of power</td><td>Alive</td></tr><tr><td><code>.su</code></td><td>Broken up/Transfer of power for Russia</td><td>Alive, but kinda in limbo</td></tr><tr><td><code>.dd</code></td><td>Unified with/into West Germany</td><td>Dead</td></tr><tr><td><code>.cs</code></td><td>Broken up</td><td>Dead</td></tr><tr><td><code>.yu</code></td><td>Broken up</td><td>Dead</td></tr><tr><td><code>.af</code></td><td>Transfer of power</td><td>Alive</td></tr><tr><td><code>.ly</code></td><td>Transfer of power</td><td>Alive</td></tr><tr><td><code>.iq</code></td><td>Transfer of power</td><td>Alive</td></tr></tbody></table>\n<p>This list is full of countries breaking up or changing governments, but no\nannexations. I guess you could sorta view East Germany as being annexed into\nWest Germany, but at the same time, almost no one used <code>.dd</code> so there was also\nthat going for it. There isn&#x2019;t too much historical precedent to look at.</p>\n<h2 id=\"the-icann-agreements\">The ICANN agreements</h2>\n<p>ICANN does have\n<a href=\"https://www.icann.org/resources/pages/cctlds/cctlds-en\">a publicly-available list of its ccTLD agreements that it has made with all countries with ccTLDs</a>.\nThis includes\n<a href=\"https://www.icann.org/resources/unthemed-pages/sponsorship-agmt-2003-03-26-en\">Taiwan&#x2019;s</a>\nand\n<a href=\"https://www.icann.org/en/system/files/files/ua-icann-af-10feb15-en.pdf\">Ukraine&#x2019;s</a>.</p>\n<p>Based on my (admittedly cursory) scan of the Taiwan one, there&#x2019;s a lot of\nmention about &#x201C;the territory of the Governmental Authority,&#x201D; which implies that\nif the Governmental Authority no longer has territory, things might become\nsomewhat hairy.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>At this point, I&#x2019;m too lazy to look deeper into the ICANN agreements. Too much\nlegalese. I guess if there&#x2019;s a takeaway from this research, it&#x2019;s that a ccTLD\ncould stop existing after the country stops existing.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-su\"><a href=\"https://en.wikipedia.org/wiki/.su\">https://en.wikipedia.org/wiki/.su</a><a href=\"https://astrid.tech/2022/04/05/1/dead-tlds/#fnref-su\" class=\"footnote-backref\">&#x21A9;</a></li>\n</ol>\n</div></div>",
      "value" : "When I was deciding on what TLD to get for my QR tattoo, one of my first thoughts was to just use a subdomain of aay.tw. Makes sense; it’s short, and I don’t have to pay any extra money.\nHowever, someone brought up a good point — can I trust that .tw will be around for the next few decades? After all, .tw is Taiwan’s domain, and if you know anything about contemporary geopolitics, there’s a lot of variables involved here. So, I ended up being safe and just picking out a new .org because those will only go away when ICANN goes away.\nStill, this is an interesting thing to think about. Suppose China ends up invading and successfully annexing Taiwan; what would happen to the 2.7 million registered domains under .tw? Or, suppose Russia, for some reason, ends up annexing Ukraine (I really think this is nearly impossible, but hey, it’s just a thought experiment). What will happen to the nearly 700 thousand domains under .ua?\nIn general, if a country stops existing, what happens to its TLD? Historical precedent\nNote that this section is mostly sourced from Wikipedia articles so take what you will of that. The collapse of the Soviet Union\nBack in 1989, the Eastern Bloc countries were assigned .su (Soviet Union), .pl (Poland), .cs (Czechoslovakia), .yu (Yugoslavia) and .dd (East Germany). domain. 15 months later, in 1991, the Soviet Union collapsed, and it seems that ICANN had to deal with the fallout of that.su\nThis situation is not the same as the one with Taiwan or Ukraine; the Soviet Union did not collapse because it was invaded, but because of internal political failures that are out of scope for this article. It is still an example of a state ceasing to exist, so there might be some historical precedent there. .pl\nAlthough the Polish People’s Republic ended, its successor, the Republic of Poland, continued existing afterwards. In other words, there was a different state, but it was still the same country. Thus, it inherited .pl. .su\nThe Union of Soviet Sovialist Republics collapsed, and its constituent republics broken off of it (i.e. Ukraine, the Baltic States) got their own domains. ICANN introduced .ru in 1994 to phase out .su, but the Russian government nad internet users wanted to keep it, so ICANN let it happen.\nIt seems that ICANN wants to terminate it, IANA states that it’s being phased out, but Russia still wants to keep it, and there’s still 100,000 domains registered with it, so it seems to be in a gray area. Apparently, because of this grayness and lax and outdated terms of use, it’s host to lots of cool sites such as white supremacist site Daily Stormer (to escape deplatforming on literally everywhere else), cybercrime activities, the pro-Putin youth movement Nashi up until 2019, the Dontesk People’s Republic, and more. .dd\n.dd was only ever used internally by some East German universities, so it was just terminated. East and West Germany reunited only a year after .dd was introduced, and West Germany already had .de, so they just used that. .yu\nWhen the Socialist Federal Republic of Yugoslavia dissolved, some of its constituent states broke off and got their own TLDs, like Slovenia and Croatia. However, Serbia and Montenegro came together to form the Federal Republic of Yugoslavia, and they kept the .yu domain. But then, they named themselves Serbia and Montenegro in 2003, and they finally dissolved in 2006 and each got their own TLDs. .yu ended up being put on a transition period before being terminated in 2010. All of the .yu sites were simply wiped out. .cs\nCzechoslovakia was split in 1993, and .cs was deleted in 1995. There were 2,300 hosts on .cs before its termination. Other change of governments\nIn Afghanistan, Libya, and Iraq, they changed their government, but control over their respective TLDs (.af, .ly, .iq) were always given to the new government.\nOn an interesting side note, although Iraq’s TLD was introduced in 1997, it was in limbo for a few years because the delegated manager was imprisoned in Texas for a while, until ICANN redelegated it in 2005. Summary TLDCountry’s fateTLD’s fate.plTransfer of powerAlive.suBroken up/Transfer of power for RussiaAlive, but kinda in limbo.ddUnified with/into West GermanyDead.csBroken upDead.yuBroken upDead.afTransfer of powerAlive.lyTransfer of powerAlive.iqTransfer of powerAlive\nThis list is full of countries breaking up or changing governments, but no annexations. I guess you could sorta view East Germany as being annexed into West Germany, but at the same time, almost no one used .dd so there was also that going for it. There isn’t too much historical precedent to look at. The ICANN agreements\nICANN does have a publicly-available list of its ccTLD agreements that it has made with all countries with ccTLDs. This includes Taiwan’s and Ukraine’s.\nBased on my (admittedly cursory) scan of the Taiwan one, there’s a lot of mention about “the territory of the Governmental Authority,” which implies that if the Governmental Authority no longer has territory, things might become somewhat hairy. Conclusion\nAt this point, I’m too lazy to look deeper into the ICANN agreements. Too much legalese. I guess if there’s a takeaway from this research, it’s that a ccTLD could stop existing after the country stops existing. https://en.wikipedia.org/wiki/.su↩",
      "lang" : "en"
    } ]
  },
  "lang" : "en"
}
